[
 {
  "url": "https://en.wikipedia.org/wiki/Affenpinscher",
  "title": "Affenpinscher - Wikipedia",
  "paragraph": "The Affenpinscher, also known as the Monkey Terrier, is a small-sized terrier-like toy Pinscher breed of dog that originated in Germany. With a distinctive appearance and charming personality, the Affenpinscher has gained popularity among dog lovers worldwide.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Afghan_Hound",
  "title": "Afghan Hound - Wikipedia",
  "paragraph": "The Afghan Hound is a Hound distinguished by its thick, fine, silky coat, and a tail with a ring curl at the end. The breed is selectively bred for its unique features in the cold mountains of Afghanistan. Its local name is Tāžī Spay (Pashto: تاژي سپی) or Sag-e Tāzī (Dari: سگ تازی). Other names for this breed are Tāzī, Balkh Hound, Baluchi Hound, Barakzai Hound, Shalgar Hound, Kabul Hound, Galanday Hound or sometimes incorrectly African Hound. As with other sighthounds, they have the ability to run fast and turn well.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Africanis",
  "title": "Africanis - Wikipedia",
  "paragraph": "The Africanis is a dog landrace found across southern Africa.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Aidi",
  "title": "Aidi - Wikipedia",
  "paragraph": "The Aidi (Berber languages: ⴰⵢⴷⵉ, romanized: aydi, lit. 'dog') is a Berber dog breed native to the Atlas Mountains of North Africa and is used as a livestock guardian, protecting herds of sheep and goats.[1] It is most commonly found in Morocco, which holds the standard under the Fédération Cynologique Internationale.[2][3][4] The Aidi is also found in Algeria, Tunisia and Libya.[5][6] It possesses hunting capabilities and good scenting ability. In Morocco, it is often paired in hunting with the Sloughi, which chases down prey that the Aidi has located by scent.[7] \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Airedale_Terrier",
  "title": "Airedale Terrier - Wikipedia",
  "paragraph": "The Airedale Terrier (often shortened to \"Airedale\"), also called Bingley Terrier and Waterside Terrier, is a dog breed of the terrier type that originated in the valley (dale) of the River Aire, in the West Riding of Yorkshire, England.[1]  It is traditionally called the \"King of Terriers\" because it is the largest of the terrier breeds.  The Airedale was bred from the Old English Black and Tan Terrier and the Otterhound and probably some other Terrier breeds, and has contributed to other dog breeds, such as the Yorkshire Terrier. Originally bred to serve as a versatile hunting and all around working farm dog, this breed has also been used as a war dog, guide dog, and police dog in Britain. In the United States, the breed has been used to hunt big game, upland birds, and water fowl, and serve in many other working capacities.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Akbash",
  "title": "Akbash - Wikipedia",
  "paragraph": "The Akbash (Turkish: Akbaş), is a traditional Turkish breed or type of flock guardian dog from western Anatolia.[3] The word akbaş means 'white head', and thus distinguishes this dog from the Karabaş, or 'black head'.[4]: 33 [5] It was recognised by the Turkish Ministry of Agriculture and Rural Affairs in 2006; it is under the tutelage of the Köpek Irkları ve Kinoloji Federasyonu, the Turkish dog breed society, but is not recognised by the Fédération Cynologique Internationale.[3][6]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Akita_(dog)",
  "title": "Akita (dog) - Wikipedia",
  "paragraph": "The Akita (秋田, Akita, Japanese pronunciation: [akʲita]) is a Japanese  dog breed of large size. Originating from the mountains of northern Japan, the Akita has a short double coat similar to that of many other northern spitz breeds. Historically, they were used by samurai for guarding, fighting and the hunting of  bears. \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Aksaray_Malaklisi",
  "title": "Aksaray Malaklisi - Wikipedia",
  "paragraph": "The Aksaray Malaklısı or Malaklı Karabaş is a Turkish breed of large livestock guardian dog, from the Aksaray Province in Central Anatolia.[1][2][3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Alano_Espa%C3%B1ol",
  "title": "Alano Español - Wikipedia",
  "paragraph": "The Alano Español or Spanish Bulldog is a Spanish breed of medium to large sized dog of alaunt-bulldog type. It has at various times been used as a war dog, for bullfighting, for the management of cattle, for hunting and as a guard dog.[4]: 498 [5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Alapaha_Blue_Blood_Bulldog",
  "title": "Alapaha Blue Blood Bulldog - Wikipedia",
  "paragraph": "The Alapaha Blue Blood Bulldog is a breed of bulldog from the United States, and it is predominantly used as a guard dog. It is a very powerful, muscular breed with large head and brachycephalic muzzle. The hair coat is short, typically colored white with black, blue, buff or brown patches, and its tail is kept un-docked.[1][2] Sexual dimorphism is common in the breed, with larger dogs typically twice the weight of smaller bitches.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Alaskan_Husky",
  "title": "Alaskan husky - Wikipedia",
  "paragraph": "The Alaskan husky is a breed of medium-sized working sled dog, developed specifically for its performance as such.[1][2][3] \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Alaskan_Klee_Kai",
  "title": "Alaskan Klee Kai - Wikipedia",
  "paragraph": "12–16 years[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Alaskan_Malamute",
  "title": "Alaskan Malamute - Wikipedia",
  "paragraph": "The Alaskan Malamute (/ˈmæləˌmjuːt/) is a large breed of dog that was originally bred for its strength and endurance to haul heavy freight as a sled dog and hound.[2] It is similar to other arctic breeds such as the husky, the spitz, the Greenland Dog, Canadian Eskimo Dog, the Siberian Husky, and the Samoyed.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Alopekis",
  "title": "Alopekis - Wikipedia",
  "paragraph": "The Alopekis (Greek: Αλωπεκίς) is a small, foxlike dog from Greece with pricked ears, a sickle-shaped tail, and a smooth short coat.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Alpine_Dachsbracke",
  "title": "Alpine Dachsbracke - Wikipedia",
  "paragraph": "The Alpine Dachsbracke (German: Alpenländische Dachsbracke) is a small breed of dog of the scent hound type originating in Austria. The Alpine Dachsbracke was bred to track wounded deer as well as boar, hare, and fox. It is highly efficient at following a trail even after it has gone cold. The Alpine Dachsbracke is very sturdy, and Austria is said to be the country of origin.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/American_Bulldog",
  "title": "American Bulldog - Wikipedia",
  "paragraph": "The American Bulldog is a large, muscular breed of mastiff-type that was used as stock dogs, catch dogs, and guardians on farms and ranches.[2] The breed is descended from the Old English Bulldog, which is thought to have arrived in America as early as the 17th century, brought over by working-class immigrants from England.[3][4] During WWI and WWII, the breed was on the verge of extinction, with the only surviving dogs being kept primarily on farms in the southeast. John D. Johnson and Alan Scott are widely regarded as the forefathers of rescuing the breed from extinction.\n[2] On January 1, 1999, the United Kennel Club first recognized the American Bulldog.[4] In November 2019, the American Bulldog was added to the American Kennel Club (AKC) Foundation Stock Service (FSS).[5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/American_Bully",
  "title": "American Bully - Wikipedia",
  "paragraph": "The American Bully is a modern breed of dog that was developed as a companion dog, and originally standardized and recognized as a breed in 2004 by the American Bully Kennel Club (ABKC). Their published breed standard describes the dog as giving the \"impression of great strength for its size\". In 2008, the American Bully was recognized by the European Bully Kennel Club (EBKC), and on July 15, 2013, by the United Kennel Club (UKC).[1]  Neither The Kennel Club nor American Kennel Club (AKC) have recognized or accepted the American Bully into their registry as a purebred dog. The founding registry (ABKC) divided the American Bully into four categories, including the Pocket, Standard, Classic, and XL, whereas other registries, including the UKC, have approved one consistent size standard.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/American_Cocker_Spaniel",
  "title": "American Cocker Spaniel - Wikipedia",
  "paragraph": "The American Cocker Spaniel is a breed of sporting dog. It is a spaniel type dog that is closely related to the English Cocker Spaniel; the two breeds diverged during the 20th century due to differing breed standards in the US and the UK. In the United States, the breed is usually called a Cocker Spaniel, while elsewhere in the world, it is called an American Cocker Spaniel to distinguish it from its older English cousin. The word cocker is commonly held to stem from their use to hunt woodcock in England, while spaniel is thought to be derived from the breed's origins in Spain.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/American_English_Coonhound",
  "title": "American English Coonhound - Wikipedia",
  "paragraph": "The English Coonhound, also referred to as the American English Coonhound (by the American Kennel Club only) or the Redtick Coonhound,[1] is a breed of coonhound that originated in and is typically bred in the Southern United States. It is descended from hunting hounds, especially foxhounds, brought to America by settlers during the 17th and 18th centuries.[2] The breed's first recognition came from the United Kennel Club in 1905 as the English Fox and Coonhound.[3] Further recognition has been granted in recent years by the American Kennel Club, first in the Foundation Stock Service and in 2011 as a fully recognized member of the hound group.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/American_Eskimo_Dog",
  "title": "American Eskimo Dog - Wikipedia",
  "paragraph": "The American Eskimo Dog is a breed of companion dog, originating in Germany. The American Eskimo Dog is a member of the Spitz family. It is considered an ancient dog breed due to its recent admixture with wolves. The breed's progenitors were German Spitz, but due to anti-German sentiment during the First World War, it was renamed \"American Eskimo Dog.\" Although modern American Eskimo Dogs have been exported as German Spitz Gross (or Mittel, depending on the dog's height), the breeds have diverged and the standards are significantly different. In addition to serving as a watchdog and companion, the American Eskimo Dog also achieved a high degree of popularity in the United States in the 1930s and 1940s as a circus performer.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/American_Foxhound",
  "title": "American Foxhound - Wikipedia",
  "paragraph": "The American Foxhound is a breed of dog, closely related to the English Foxhound. They are scent hounds, bred to hunt foxes by scent. United States Founding Father George Washington contributed to the breed's development.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/American_Hairless_Terrier",
  "title": "American Hairless Terrier - Wikipedia",
  "paragraph": "The American Hairless Terrier is a breed of companion dog from the United States that was developed from naturally hairless Rat Terriers.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/American_Leopard_Hound",
  "title": "American Leopard Hound - Wikipedia",
  "paragraph": "The American Leopard Hound is an American breed of hunting dog. It is recognized by the  United Kennel Club (UKC) as a scenthound and is in the American Kennel Club's Foundation Stock Service.[1][2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/American_Pit_Bull_Terrier",
  "title": "American Pit Bull Terrier - Wikipedia",
  "paragraph": "The American Pit Bull Terrier (APBT) is a dog breed recognized by the United Kennel Club (UKC)[1] and the American Dog Breeders Association (ADBA),[2] but not the American Kennel Club (AKC).[3] It is a medium-sized, short-haired dog, of a solid build, whose early ancestors came from the British Isles. When compared with the English Staffordshire Bull Terrier, the American Pit Bull Terrier is larger by margins of 6–8 inches (15–20 cm) in height and 25–35 pounds (11–16 kg) in weight. The American Pit Bull Terrier varies in size: males are normally about 18–21 inches (45–53 cm) in height and around 35–60 pounds (15–27 kg) in weight, while females are normally around 17–20 inches (43–50 cm) in height and 30–50 pounds (13–22 kg) in weight.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/American_Staffordshire_Terrier",
  "title": "American Staffordshire Terrier - Wikipedia",
  "paragraph": "The American Staffordshire Terrier, also known as the AmStaff is a medium-sized, short-coated American dog breed[2][3][4][5] recognized by the American Kennel Club, but not the United Kennel Club, which instead allows American Staffordshire Terriers to be registered under the American Pit Bull Terrier breed.[6] \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/American_Water_Spaniel",
  "title": "American Water Spaniel - Wikipedia",
  "paragraph": "The American Water Spaniel (often abbreviated to AWS) is a breed of spaniel which originated in the United States. It was developed in the state of Wisconsin during the 19th century from a number of other breeds, including the Irish and English Water Spaniels. The breed was saved by Dr. Fred J. Pfeifer, who set up the breed club and standard, and whose work led to recognition for the breed by the United Kennel Club, and later, the American Kennel Club. While they are the state dog of Wisconsin, they remain a rare breed.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Anglo-Fran%C3%A7ais_de_Petite_V%C3%A9nerie",
  "title": "Anglo-Français de Petite Vénerie - Wikipedia",
  "paragraph": "The Anglo-Français de Petite Vénerie is a medium-sized breed of dog used in hunting as a scenthound, usually in packs. It is one of the Anglo-French hound breeds which were created by crossing French scenthounds with English foxhounds. The name Petite Vénerie does not mean that dogs of the breed are petite or small, but rather that it is used to hunt small game.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Appenzeller_Sennenhund",
  "title": "Appenzeller Sennenhund - Wikipedia",
  "paragraph": "The Appenzeller Sennenhund is a Swiss breed of medium-sized working dog. It originates in the Appenzell region of north-eastern Switzerland, and is one of four regional breeds of Sennenhund or Swiss mountain dog, all of which are characterised by a distinctive tricolour coat.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Ari%C3%A8ge_Pointer",
  "title": "Ariège Pointer - Wikipedia",
  "paragraph": "The Ariège Pointer is a French breed of hunting dog of pointer type. It originates in the Ariège département of Occitanie, in south-western France. The breed name may be rendered in English as Ariège Pointing Dog or Braque de l'Ariège.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Ariegeois",
  "title": "Ariégeois - Wikipedia",
  "paragraph": "The Ariégeois is a French breed of medium-sized scent hound from the département of Ariège in the Midi-Pyrenées region of southern France. It may have derived from cross-breeding of pack-hunting hounds such as the Grand Bleu de Gascogne or Grand Gascon-Saintongeois with local Briquet dogs.[2] It hunts either alone or in a pack, and is used both as a courser and for driving game to waiting guns. While most successful with hares, it is also used for hunting deer and boar.[3] It does not adapt well to urban life,[4] and is not usually kept as a companion dog.[5]: 46 \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Armant_(dog)",
  "title": "Armant (dog) - Wikipedia",
  "paragraph": "The Armant (also known as the Egyptian Sheepdog or Ermenti) is a breed of herding dog from Egypt. It is believed the Armant descends from Briards brought to Egypt by Napoleon's armies,[note 1] these dogs were likely crossed with local dogs to produce the first examples of the breed.[2][3][4] The Armant is named after the town of Armant in Egypt, the supposed place of origin of the breed, the breed is not very well known but is used extensively within Egypt as both a herding dog and a guard dog.[5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Armenian_Gampr",
  "title": "Armenian Gampr - Wikipedia",
  "paragraph": "The Armenian Gampr (Armenian: Գամփռ, romanized: Gamp’ṙ) is an Armenian breed of flock guardian dog native to the Armenian Highlands. It falls within the Ovcharka group of livestock guardian dogs, which can be found throughout the Transcaucasus area.[1]: 67  It was recognised in 2011 by the International Kennel Union in Moscow,[1]: 67 [2][3] under the guidance of the Armenian Kennel Club, which had developed the breed standard in the 1990s.[1]: 67 \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Artois_Hound",
  "title": "Artois Hound - Wikipedia",
  "paragraph": "The Artois Hound is a rare breed of dog, and a descendant of the Bloodhound. A scent hound 22–23 inches high at the withers, weighing anything between 55 and 65 pounds, it is a well constructed dog with a slow graceful gait. It has a large, strong head, a medium-length back and a pointed tail that tends to be long and sickle-shaped. Their ears are set at eye level; they have large prominent eyes and quite thick lips.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Assyrian_Mastiff",
  "title": "Assyrian Mastiff - Wikipedia",
  "paragraph": "The Assyrian Mastiff,[1][2] was a landrace in Assyria. This dog was often used as a livestock guardian against predators and they were bred by the Assyrians and Babylonians for lion and wild horse-hunting.[3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Australian_Cattle_Dog",
  "title": "Australian Cattle Dog - Wikipedia",
  "paragraph": "The Australian Cattle Dog (ACD), or simply Cattle Dog, is a breed of herding dog originally developed in Australia for droving cattle over long distances across rough terrain. This breed is a medium-sized, short-coated dog that occurs in two main colour forms. It has either red or black hair distributed fairly evenly through a white coat, which gives the appearance of a \"red\" or \"blue\" dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Australian_Kelpie",
  "title": "Australian Kelpie - Wikipedia",
  "paragraph": "The Australian Kelpie, or simply Kelpie, is an Australian sheepdog capable of mustering and droving with little or no guidance. It is a medium-sized dog and comes in a variety of colours. The Kelpie has been exported throughout the world and is used to muster livestock, primarily sheep, cattle and goats.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Australian_Shepherd",
  "title": "Australian Shepherd - Wikipedia",
  "paragraph": "The Australian Shepherd is a breed of herding dog from the United States. The name of the breed is technically a misnomer, as it was developed in California in the 19th century, although it has its origins in Asturias, in the northwest of Spain; the breed was unknown in Australia at the time. It is claimed that Australian Shepherds descend from a variety of herding breeds, including collies imported, alongside sheep, from Australia and New Zealand; the breed reportedly took its name from this trade. Originally used solely as a herding dog, the Australian Shepherd has become one of the most popular companion dog breeds in North America.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Australian_Stumpy_Tail_Cattle_Dog",
  "title": "Australian Stumpy Tail Cattle Dog - Wikipedia",
  "paragraph": "The Australian Stumpy Tail Cattle Dog or Stumpy is a naturally bobtailed  or tailless, medium-sized cattle dog similar and/or related to the Australian Cattle Dog which is commonly referred to as a “Heeler”, whereas, the Stumpy is not. The Australian Stumpy Tail Cattle Dog was developed in Australia[1]  to herd cattle,[2] and descends from crosses between European herding dogs and the Australian dingo. The name is spelled both with hyphenation, and without, and while the shorter name Stumpy is sometimes applied, the name Heeler most often refers to the Australian Cattle Dog .[3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Australian_Terrier",
  "title": "Australian Terrier - Wikipedia",
  "paragraph": "The Australian Terrier is a small breed of dog of the terrier dog type. The breed was developed in Australia, although the ancestral types of dogs from which the breed descends were from Great Britain.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Austrian_Black_and_Tan_Hound",
  "title": "Austrian Black and Tan Hound - Wikipedia",
  "paragraph": "The Austrian Black and Tan Hound is a breed of dog originating in Austria.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Austrian_Pinscher",
  "title": "Austrian Pinscher - Wikipedia",
  "paragraph": "The Austrian Pinscher (Österreichischer Pinscher) is a medium-sized breed of pinscher-type dog from Austria, where dogs of the type were originally farm dogs, keeping barns free of rats and acting as home guards, livestock guardians, and drovers. The name originally given to the breed in 1928 was the Österreichischer Kurzhaarpinscher (Austrian Shorthaired Pinscher) to differentiate it from similarly named breeds, but today in its country of origin the breed is officially called the Österreichischer Pinscher, or Austrian Pinscher in English.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Azawakh",
  "title": "Azawakh - Wikipedia",
  "paragraph": "The Azawakh is a breed of dog from West Africa. With ancient origins, it is raised throughout the Sahelian zone of Mali, Niger,  and Burkina Faso.  This region  includes the Azawagh Valley for which the breed is named.  While commonly associated with the nomadic Tuareg people, they are also bred and owned by other ethnic groups such as the Peulh, Bella, and Hausa. The Azawakh is more related to the Sloughi than it is to the Saluki.[1][unreliable source?]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/B%E1%BA%AFc_H%C3%A0_dog",
  "title": "Bắc Hà dog - Wikipedia",
  "paragraph": "The Bắc Hà dog (Vietnamese: chó Bắc Hà), is a medium size spitz dog breed and one of Vietnam's Four Great National Dogs (Vietnamese: tứ đại quốc khuyển).[1][2] This primitive dog breed is primarily used a hunter and guard dog by the Hmong people in northern Vietnam, especially in the Bắc Hà district and Si Ma Cai district of Lào Cai province.[2][3] While not recognized by the Fédération Cynologique Internationale, the Bắc Hà dog is recognized by the Vietnam Kennel Association.[4]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bakharwal_dog",
  "title": "Bakharwal dog - Wikipedia",
  "paragraph": "The Bakharwal dog is found in northern India.[1][2][3] It is an ancient working Indian dog breed found in Ladakh and across the Pir Panjal Range of India, where it has been bred for many centuries by the Bakarwal Gujjar nomadic tribe as a livestock guardian dog and settlement protector.[4][5] While the Bakharwal Dog is mainly found in India, it is found in smaller numbers in Afghanistan and Pakistan.[6]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Banjara_Hound",
  "title": "Banjara Hound - Wikipedia",
  "paragraph": "The Banjara Hound, also known as the Vanjari Hound, is a breed of dog found in India. It is a sighthound-type dog bred and used for hunting by the nomadic Banjara of Maharashtra.[1][2][3] The Banjara Hound is a rough-coated breed of sighthound, usually brindle or solid-coloured. It resembles a large Saluki, standing around 28 in (71 cm), and is famed for its stamina and ability to pull down deer.[1][4][5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bankhar_Dog",
  "title": "Bankhar Dog - Wikipedia",
  "paragraph": "The Bankhar dog (Buryat: Hotosho, Mongolian: Bankhar, Russian: Бурят-монгольский волкодав), is a landrace livestock guarding dog. Originally bred by the Buryat people, their success contributed to their spread across Buryatia and Mongolia and into adjacent regions before they were nearly annihilated in the mid-20th Century.[1]  Bankhar dogs are prized for their intellect and perseverance even in hostile weather conditions.[2][3] They are loyal and affectionate with their families, but formidable against intruders, including humans, wolves, eagles and snow leopards. [3][4][2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Barak_hound",
  "title": "Barak hound - Wikipedia",
  "paragraph": "The Barak[1][2] or Bosnian Broken-haired Hound[1] (Bosnian,Serbo-Croatian: Bosanski oštrodlaki gonič / Босански оштродлаки гонич),[1] is a hunting dog breed developed in Bosnia. The breed is a scenthound, originally used to hunt large game. Other names include Bosnian Rough-haired Hound[3] and Bosnian Rough-coated Hound.[4] These names refer to the texture of the shaggy coat, usually called broken-haired or hard in English dog fancier jargon.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Barbado_da_Terceira",
  "title": "Barbado da Terceira - Wikipedia",
  "paragraph": "The Barbado da Terceira is Portuguese breed of herding and guard dog from the Atlantic island of Terceira in the Azores, for which it is named. It was recognised by the Direcção-Geral de Veterinária of Portugal in 2004.[1][2] It is not recognised by the Fédération Cynologique Internationale.[3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Barbet_(dog)",
  "title": "Barbet (dog) - Wikipedia",
  "paragraph": "The Barbet is a breed of dog; it is a medium-sized French water dog. It is listed in Group 8 (retrievers, flushing dogs, water dogs) by the Société Centrale Canine, the French Kennel Club and the Fédération Cynologique Internationale (International Canine Federation).\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Basenji",
  "title": "Basenji - Wikipedia",
  "paragraph": "The Basenji (/bəˈsɛndʒi/) is a breed of hunting dog. It was bred from stock that originated in central Africa. The Fédération Cynologique Internationale places the breed in the Spitz and primitive types. The Basenji produces an unusual yodel-like sound, due to its unusually shaped larynx.[1] This trait also gives the Basenji the nickname the 'barkless dog.'[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Basque_Shepherd_Dog",
  "title": "Basque Shepherd Dog - Wikipedia",
  "paragraph": "The Basque Shepherd Dog, Basque: Euskal Artzain Txakurra, Spanish: Perro de Pastor Vasco, is a traditional Spanish breed of sheepdog originating in the historic Basque Country.[1]: 535  It is believed that they originated from Central European herding dogs.[citation needed]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Basset_Art%C3%A9sien_Normand",
  "title": "Basset Artésien Normand - Wikipedia",
  "paragraph": "The Basset Artésien Normand (Norman Artesian Basset) is a short legged hound type dog developed in France. The word basset refers to short-legged hounds.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Basset_Bleu_de_Gascogne",
  "title": "Basset Bleu de Gascogne - Wikipedia",
  "paragraph": "The Basset Bleu de Gascogne (French pronunciation: ​[bɑsɛ blø də ɡasˈkɔɲ]), also known as the Blue Gascony Basset, is a long-backed, short legged breed of dog of the hound type. A French native breed, it is rare outside its homeland. It is recognized internationally by the Fédération Cynologique Internationale, in the UK by The Kennel Club, and by the United Kennel Club in the United States. The \"bleu\" of its name is a reference to its coat which has a ticked appearance.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Basset_Fauve_de_Bretagne",
  "title": "Basset Fauve de Bretagne - Wikipedia",
  "paragraph": "The Basset Fauve de Bretagne is a short-legged hunting breed of dog of the scent hound type, originally from Brittany, a historical duchy of France.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Basset_Hound",
  "title": "Basset Hound - Wikipedia",
  "paragraph": "The Basset Hound is a short-legged breed of dog in the hound family. The Basset is a scent hound that was originally bred for the purpose of hunting hare. Their sense of smell and ability to ground-scent is second only to the Bloodhound.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bavarian_Mountain_Hound",
  "title": "Bavarian Mountain Hound - Wikipedia",
  "paragraph": "The Bavarian Mountain Hound (German: Bayerischer Gebirgsschweißhund) is a breed of dog from Germany. As a scent hound, it has been used in Germany since the early 20th century to trail wounded game. It is a cross between the blood hound, labrador, great dane, german shepard,beauceron, rhodesian ridgeback and the Hanover Hound. This dog needs plenty of exercise and if not given the correct mental and physical stimulation can be prone to depression and sometimes become destructive, though having all these traits they are very kind loving dogs that are great with kids and adults. These dogs tend to be vocal dogs with stubborn attitudes yet still obedient and one of the most intelligent of the hound breeds.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Beagle",
  "title": "Beagle - Wikipedia",
  "paragraph": "The beagle is a breed of  small scent hound, similar in appearance to the much larger foxhound. The beagle was developed primarily for hunting hare, known as beagling. Possessing a great sense of smell and superior tracking instincts, the beagle is the primary breed used as a detection dog for prohibited agricultural imports and foodstuffs in quarantine around the world. The beagle is intelligent and is a popular pet due to its size, good temper, and a lack of inherited health problems.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Beagle-Harrier",
  "title": "Beagle-Harrier - Wikipedia",
  "paragraph": "The Beagle-Harrier is a scenthound. It is a breed of dog originating from France.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bearded_Collie",
  "title": "Bearded Collie - Wikipedia",
  "paragraph": "The Bearded Collie, or Beardie, is a herding breed of dog once used primarily by Scottish shepherds,[1] but now mostly a popular family companion.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Beauceron",
  "title": "Beauceron - Wikipedia",
  "paragraph": "The Beauceron is a herding dog breed originating from the plains of Central France. The Beauceron is also known as Berger de Beauce (sheepdog from Beauce) or  Bas Rouge (red-stockings).\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bedlington_Terrier",
  "title": "Bedlington Terrier - Wikipedia",
  "paragraph": "The Bedlington Terrier is a breed of small dog named after the mining town of Bedlington, Northumberland in North East England.  Originally bred to hunt, the Bedlington Terrier has since been used in dog racing, numerous dog sports, as well as in conformation shows and as a companion dog. It is closely related to the Dandie Dinmont Terrier, Whippet and Otterhound.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Belgian_Shepherd",
  "title": "Belgian Shepherd - Wikipedia",
  "paragraph": "The Belgian Shepherd  (also known as the Belgian Sheepdog, Belgian Malinois, or the Chien de Berger Belge) is a breed of medium-sized herding dog from Belgium. While predominantly considered a single breed, it is bred in four distinct varieties based on coat type and colour; the long-haired black Groenendael, the rough-haired fawn Laekenois, the short-haired fawn Malinois, and the long-haired fawn Tervuren; in the United States the American Kennel Club considers the four varieties to be separate breeds.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bergamasco_Shepherd",
  "title": "Bergamasco Shepherd - Wikipedia",
  "paragraph": "The Bergamasco Shepherd, Italian: Cane da Pastore Bergamasco, is an Italian breed of sheepdog. It originated in the Alpi e Prealpi Bergamasche, where it was used as a herding dog for both sheep and cattle.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Berger_Picard",
  "title": "Berger Picard - Wikipedia",
  "paragraph": "The Berger Picard (/bɛərˌʒeɪ pɪˈkɑːr/ bair-ZHAY pih-KAR, French: [bɛʁʒe pikaʁ]) or Picardy Shepherd, is a French herding dog originating in Picardy. These dogs nearly became extinct after both World War I and World War II[1] and remain a rare breed.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bernese_Mountain_Dog",
  "title": "Bernese Mountain Dog - Wikipedia",
  "paragraph": "The Bernese Mountain Dog (German: Berner Sennenhund) is a large dog breed, one of the four breeds of Sennenhund-type dogs from Bern, Switzerland and the Swiss Alps. These dogs have roots in the Roman mastiffs. The name Sennenhund is derived from the German Senne (\"alpine pasture\") and Hund (hound/dog), as they accompanied the alpine herders and dairymen called Senn. Berner (or Bernese in English) refers to the area of the breed's origin, in the canton of Bern. This breed was originally kept as a general farm dog. Large Sennenhunde in the past were also used as draft animals, pulling carts.  The breed was officially established in 1912.[3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bichon_Fris%C3%A9",
  "title": "Bichon Frisé - Wikipedia",
  "paragraph": "A Bichon Frisé (/ˈbiːʃɒn ˈfriːz/ or /ˈbiːʃɒn frɪˈzeɪ/; from French: bichon à poil frisé, French pronunciation: ​[biʃɔ̃ fʁize], meaning 'curly haired dog') is a small breed of dog of the bichon type.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Billy_(dog)",
  "title": "Billy (dog) - Wikipedia",
  "paragraph": "The Billy is a large scenthound originating from central western France.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Black_and_Tan_Coonhound",
  "title": "Black and Tan Coonhound - Wikipedia",
  "paragraph": "The Black and Tan Coonhound is a breed of hunting dog.  Developed in the United States from crosses between the Bloodhound and the Black and Tan Virginia Foxhound, this scent hound runs its game entirely by scent and is used primarily for raccoon hunting.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Black_Norwegian_Elkhound",
  "title": "Black Norwegian Elkhound - Wikipedia",
  "paragraph": "The Black Norwegian Elkhound (Norwegian Elghund Sort (NES) in Norwegian) is a small Spitz breed classified by the FCI as a hunting dog.[1] It is currently an uncommon breed in Norway and very rare outside the Nordic countries of Scandinavia. It is a sibling breed to a Grey Norwegian Elkhound, but is smaller, more agile, doesn't bark and was bred  explicitly for on-leash dog hunting.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Black_Russian_Terrier",
  "title": "Black Russian Terrier - Wikipedia",
  "paragraph": "The Black Russian Terrier (Russian: Русский чёрный терьер), also known as the Chornyi Terrier (chornyi being Russian for black) is a breed of dog created in USSR in Red Star (Krasnaya Zvezda) Kennel during the late 1940s and the early 1950s for use as military/working dogs. At the present time, the Black Russian Terrier is a breed recognized by the FCI (FCI's from September 1983), AKC (AKC's from July 2004), CKC, KC, ANKC, NZKC and other cynological organizations. The contemporary Black Russian Terrier is a working dog, guarding dog, sporting and companion dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Black_Mouth_Cur",
  "title": "Black Mouth Cur - Wikipedia",
  "paragraph": "The Black Mouth Cur, also known as the Southern Cur, Southern Black Mouth Cur and the Yellow Black Mouth Cur, is a medium to large sized breed of cur-type dog from the United States. Originating in the south of the country, the breed is a popular hunting companion used to hunt a large variety of game.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bloodhound",
  "title": "Bloodhound - Wikipedia",
  "paragraph": "The bloodhound is a large scent hound, originally bred for hunting deer, wild boar and, since the Middle Ages, for tracking people.  Believed to be descended from hounds once kept at the Abbey of Saint-Hubert, Belgium, in French it is called, le chien de Saint-Hubert.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Blue_Lacy",
  "title": "Blue Lacy - Wikipedia",
  "paragraph": "The Lacy Dog or Blue Lacy Dog[1] is a breed of working dog that originated in the State of Texas in the mid-19th century.[2] The Lacy was first recognized in 2001 by the Texas Senate. In Senate Resolution No. 436, the 77th Legislature honored the Lacy as \"a true Texas breed.\"[3] In 2005, in House Concurrent Resolution No. 108, the 79th Legislature called the Lacy \"a Texas original; the only dog breed to have originated in this state.\"[4] In June 2005, Governor Rick Perry signed the legislation adopting the Blue Lacy as \"the official State Dog Breed of Texas\".[5] As expected, the vast majority of Lacy dogs are found in Texas. However, as the breed becomes more recognized, breeding populations are being established across the United States, Canada, and most recently in Europe.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Blue_Picardy_Spaniel",
  "title": "Blue Picardy Spaniel - Wikipedia",
  "paragraph": "The Blue Picardy Spaniel (or Épagneul Bleu de Picardie) is a breed of Spaniel originating in France, from the area around the mouth of the River Somme, around the start of the 20th century. It is descended from Picardy Spaniels and English Setters, and is described as a quiet breed that requires much exercise due to its stamina. It is especially good with children. Similar to the Picardy Spaniel, it has a distinctive coloured coat. Recognised by only a handful of kennel associations, the breed is predominantly known in France and Canada.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bluetick_Coonhound",
  "title": "Bluetick Coonhound - Wikipedia",
  "paragraph": "The Bluetick Coonhound is a breed of coonhound originating in the United States. The Bluetick Coonhound is known for its friendly personality, cold nose,[1] and deep bawl mouth. It is most commonly used as a raccoon hunting dog, but may also be kept as a pet.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Boerboel",
  "title": "Boerboel - Wikipedia",
  "paragraph": "The Boerboel (pronounced [ˈbuːrbul]) is a South African breed of large dog of mastiff type, used as a family guard dog. It is large, with a short coat, strong bone structure and well-developed muscles.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bohemian_Shepherd",
  "title": "Bohemian Shepherd - Wikipedia",
  "paragraph": "The Bohemian Shepherd (Czech: Chodský pes) is an ancient sheep herding dog and watch dog originating from the Czech Republic.[1][2] [3] Since 2019, the Bohemian Shepherd has been provisionally recognized by the FCI and the AKC's Foundation Stock Service.[4][5][6]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bolognese_dog",
  "title": "Bolognese dog - Wikipedia",
  "paragraph": "The Bolognese (pronounced [boloɲˈɲeːze]) is a small dog breed of the bichon type, originating in Italy. The name refers to the northern Italian city of Bologna. It is part of the toy dog group and is considered a companion dog. \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Border_Collie",
  "title": "Border Collie - Wikipedia",
  "paragraph": "The Border Collie is a breed of herding dog of medium size. Widely considered to be the most intelligent dog breed,[1] they are descendants of landrace sheepdogs that were once found all over the British Isles, but became standardised in the Anglo-Scottish border region. They are now mostly used as working dogs to herd livestock, specifically sheep.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Border_Terrier",
  "title": "Border Terrier - Wikipedia",
  "paragraph": "The Border Terrier is a British breed of small, rough-coated terrier. It originates from the area of the Anglo-Scottish border, and shares ancestry with the Dandie Dinmont Terrier and the Bedlington Terrier from the same area.[2] The dogs were traditionally used in fox-hunting, and worked with the Border Hunt in Northumberland.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Borzoi",
  "title": "Borzoi - Wikipedia",
  "paragraph": "The Borzoi[a] or Russian Hunting Sighthound[b] is a Russian breed of hunting dog of sighthound type. It was formerly used for wolf hunting,[1]: 125  and until 1936 was known as the Russian Wolfhound.[1]: 130 [3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Boston_Terrier",
  "title": "Boston Terrier - Wikipedia",
  "paragraph": "The Boston Terrier is a breed of dog originating in the United States of America. This \"American Gentleman\" was accepted in 1893 by the American Kennel Club as a non-sporting breed.[2] Color and markings are important when distinguishing this breed from the AKC standard. They should be either black, brindle or seal with white markings.[3][4] Boston Terriers are small and compact with a short tail and erect ears. The AKC says they are highly intelligent and very easily trained.[5] They are friendly and can be stubborn at times. The average life span of a Boston Terrier is around 11 to 13 years.[6]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bouvier_des_Ardennes",
  "title": "Bouvier des Ardennes - Wikipedia",
  "paragraph": "Bouvier des Ardennes is a rare dog breed from Belgium.[1] Originating in the Ardennes region these dogs were used to herd cattle. The loss of farms in the area led to serious decline in the numbers of these dogs until 1985 when some breeders found a few dogs and used the original breed standard as their guide in re-introducing the dog.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bouvier_des_Flandres",
  "title": "Bouvier des Flandres - Wikipedia",
  "paragraph": "The Bouvier des Flandres is a herding dog breed originating in Flanders, Belgium. They were originally used for general farm work including cattle droving, sheep herding, and cart pulling, and nowadays as guard dogs and police dogs, as well as being kept as pets. The French name of the breed means, literally, \"Cow Herder of Flanders\", referring to the Flemish origin of the breed. Other names for the breed are Toucheur de Boeuf (cattle driver), Vlaamse Koehond (Flemish cow dog), and Vuilbaard (dirty beard).\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Boxer_(dog)",
  "title": "Boxer (dog) - Wikipedia",
  "paragraph": "The Boxer is a medium to large, short-haired dog breed of mastiff-type, developed in Germany. The coat is smooth and tight-fitting; colors are fawn, brindled, or white, with or without white markings. Boxers are brachycephalic (they have broad, short skulls), have a square muzzle, mandibular prognathism (an underbite), very strong jaws, and a powerful bite ideal for hanging on to large prey. The Boxer was bred from the Old English Bulldog and the now extinct Bullenbeisser, which became extinct by crossbreeding rather than by a decadence of the breed. The Boxer is a member of both The Kennel Club and American Kennel Club (AKC) Working Group.[4]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Boykin_Spaniel",
  "title": "Boykin Spaniel - Wikipedia",
  "paragraph": "The Boykin Spaniel is a medium-sized breed of dog, a Spaniel bred for hunting wild turkeys and ducks in the Wateree River Swamp of South Carolina, in the United States. It is the state dog of South Carolina, where it was discovered and further developed by hunters in the 1900s. 1 September, 1984 is Boykin Spaniel Day in South Carolina.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bracco_Italiano",
  "title": "Bracco Italiano - Wikipedia",
  "paragraph": "The Bracco Italiano[a] is an Italian breed of pointing dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Braque_d%27Auvergne",
  "title": "Braque d'Auvergne - Wikipedia",
  "paragraph": "The Braque d'Auvergne is a breed of dog originating in the mountain area of Cantal, in the historic Auvergne province in the mid-south of France. It is a pointer and versatile gundog. The breed descends from ancient regional types of hunting dogs.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Braque_du_Bourbonnais",
  "title": "Braque du Bourbonnais - Wikipedia",
  "paragraph": "The Braque du Bourbonnais is a breed of gundog, of rustic appearance, sometimes born with a short tail, with a coat ticked with liver, fawn, black, or white\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Braque_Fran%C3%A7ais",
  "title": "Braque Français - Wikipedia",
  "paragraph": "The Braques Français are hunting dogs, from a very old type of gun dog used for pointing the location of game birds for a hunter. There are two breeds of Braque Français, both from the south of France,[1][2]  the Braque français, type Gascogne  (French Pointing Dog – Gascogne type, larger size) and the Braque français, type Pyrénées (French Pointing Dog – Pyrenean type, smaller size) They are popular hunting dogs in France, but are seldom seen elsewhere.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Braque_Saint-Germain",
  "title": "Braque Saint-Germain - Wikipedia",
  "paragraph": "The Braque Saint-Germain (translated into English as the St. Germain Pointing Dog) is a medium-large breed of dog, a versatile hunter used for hunting as a gun dog and pointer as well as for hunting other small game. Braque is a term meaning pointing dogs. The breed was created around 1830 by crossing English and French pointing type dogs.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Briard",
  "title": "Briard - Wikipedia",
  "paragraph": "The Briard (pronounced [bʁijaʁ] (listen))[2]: 108  or Berger de Brie (pronounced [bɛʁʒe də bʁi])[2]: 89  plural: Bergers de Brie}} is a French breed of large shepherd dog, traditionally used both for herding sheep and to defend them. It was first shown at the first Paris dog show, in 1863; the first Briard to be registered in the Livre des Origines Françaises, the national stud-book, was Sans Gêne in 1885.[3] It was in the past also known as the Chien de Berger français de Plaine.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Briquet_Griffon_Vend%C3%A9en",
  "title": "Briquet Griffon Vendéen - Wikipedia",
  "paragraph": "A Briquet Griffon Vendéen is a breed of hunting dog originating in France.  Prior to the first World War it was bred down in size by the Comte d’Elva from the Grand Griffon Vendéen. The Briquet Griffon Vendéen was almost extinct after World War II, but thanks to the effort of Hubert Dezamy, a French dog show judge, the breed was restored.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Brittany_(dog)",
  "title": "Brittany (dog) - Wikipedia",
  "paragraph": "The Brittany is a breed of gun dog bred primarily for bird hunting.  Although it is often referred to as the Brittany Spaniel, they are not actually spaniels. The AKC reclassified them in 1984 as just Brittanys, since they are pointing dogs and have less genetically in common with Spaniels, and more in common with Setters, which are pointing dogs. The breed's working characteristics are more akin to those of a pointer or setter than a spaniel. \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Broholmer",
  "title": "Broholmer - Wikipedia",
  "paragraph": "The Broholmer, also called the Danish Mastiff, is a large mastiff breed of dog from Denmark, recognized by the Danish Kennel Club and the Fédération Cynologique Internationale.  It has been employed as a guard dog in the homes of the wealthy. The breed's numbers dwindled severely during World War II, but the dog made a successful return in the 1970s.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bruno_Jura_Hound",
  "title": "Bruno Jura Hound - Wikipedia",
  "paragraph": "The Bruno Jura Hound is a breed of scenthound from the Jura Mountains on the French-Swiss border.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Griffon_Bruxellois",
  "title": "Griffon Bruxellois - Wikipedia",
  "paragraph": "The Griffon Bruxellois or  Brussels Griffon is a breed of toy dog, named for their city of origin of Brussels, Belgium. The Griffon Bruxellois may refer to three different breeds, the Griffon Bruxellois, the Griffon Belge and the Petit Brabançon.[1] Identical in standard except for coat and colour differences, in some standards they are considered varieties of the same breed, much like Belgian Shepherd Dogs.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bucovina_Shepherd_Dog",
  "title": "Bucovina Shepherd Dog - Wikipedia",
  "paragraph": "The Romanian Bucovina Shepherd Dog (Romanian: Ciobănesc Românesc de Bucovina) is a breed  of livestock guardian dogs native to the historical Bukovina (Bucovina) region. The breed is closely related to other livestock guardian breeds of the region, such as the Greek Shepherd, Tornjak, or Šarplaninac. There are four Romanian shepherd dog breeds: the Romanian Mioritic Shepherd Dog (old name Barac), the Carpathian Shepherd Dog (old name Zăvod), the Romanian Raven Shepherd Dog, and the Bucovina Shepherd Dog. In the FCI, this particular breed is officially dubbed the \"Romanian Bucovina Shepherd\".[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bull_Arab",
  "title": "Bull Arab - Wikipedia",
  "paragraph": "The Bull Arab is a type of dog developed in Australia by Mike Hodgens and Heather Rea for pig hunting.[2][1][3] The dog was developed from crossing large, strong dogs of which the most common were Bull Terriers, Pointing breeds, and Greyhounds. The result was a medium to large size, short-haired, muscular dog.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bull_Terrier",
  "title": "Bull Terrier - Wikipedia",
  "paragraph": "The Bull Terrier is a breed of dog in the terrier family. There is also a miniature version of this breed which is officially known as the Miniature Bull Terrier.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bulldog",
  "title": "Bulldog - Wikipedia",
  "paragraph": "The Bulldog is a British breed of dog of mastiff type. It may also be known as the English Bulldog or British Bulldog. It is a medium sized, muscular dog of around 40–55 lb (18–25 kg). They have large heads with thick folds of skin around the face and shoulders, and a relatively flat face with a protruding lower jaw. The breed has significant health issues as a consequence of breeding for its distinctive appearance, including brachycephalia, hip dysplasia, heat sensitivity, and skin infections. Due to concerns about their quality of life, breeding Bulldogs is illegal in Norway and the Netherlands.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bullmastiff",
  "title": "Bullmastiff - Wikipedia",
  "paragraph": "The Bullmastiff is an English breed of dog of mastiff type and large size, with a solid build and a short muzzle. It was developed as a guard dog in the nineteenth century by cross-breeding the English Mastiff with the now-extinct Old English Bulldog. It was recognised as a breed by The Kennel Club in 1924.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bully_Kutta",
  "title": "Bully Kutta - Wikipedia",
  "paragraph": "The Bully Kutta[A] is a type of large dog that originated in the Indian subcontinent, dating back to the 16th century.[4][better source needed] The Bully Kutta is a working dog used for hunting and guarding. The type is popular in the Punjab region of India and Pakistan, including Haryana and Delhi, as well as in Maharashtra[5] and Tamil Nadu.[3][4][better source needed]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Burgos_Pointer",
  "title": "Burgos Pointer - Wikipedia",
  "paragraph": "The Burgos Pointer (Spanish: Perdiguero de Burgos), also called the Burgalese Pointer, is a breed of dog native to Spain. Originating from Castile, especially in the province of Burgos, this hardy breed is used for hunting and has some outstanding features for small game.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Ca_M%C3%A8_Mallorqu%C3%AD",
  "title": "Ca Mè Mallorquí - Wikipedia",
  "paragraph": "The Ca Mè Mallorquí is a Spanish breed of pointing dog originating in the Mediterranean island of Mallorca, in the Balearic Islands. It was traditionally used as a pointing dog in hunting. It was officially recognised by the national government of Spain in 2004, but is not recognised by either the Fédération Cynologique Internationale or the Real Sociedad Canina de España.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Ca_de_Bou",
  "title": "Ca de Bou - Wikipedia",
  "paragraph": "The Ca de Bou, also known as the Perro de Presa Mallorquin, Mallorca Mastiff or the Majorcan Bulldog, is a breed of bulldog type dogs from Majorca, the largest of the Balearic Islands.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Cairn_Terrier",
  "title": "Cairn Terrier - Wikipedia",
  "paragraph": "The Cairn Terrier is a terrier breed originating in the Scottish Highlands and recognized as one of Scotland's earliest working dogs.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Calupoh",
  "title": "Calupoh - Wikipedia",
  "paragraph": "The Calupoh is a canine breed native to Mexico.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Campeiro_Bulldog",
  "title": "Campeiro Bulldog - Wikipedia",
  "paragraph": "The Campeiro Bulldog (Portuguese: Buldogue campeiro, Portuguese pronunciation: [buwˈdɔɡ kãˈpejɾu]) is a breed of bulldog from Brazil.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Can_de_Chira",
  "title": "Can de Chira - Wikipedia",
  "paragraph": "The Can de Chira (also known as the perro pastor altoaragonés) is a breed of herding dog from the High Aragon region of Spain.[1][2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Can_de_Palleiro",
  "title": "Can de Palleiro - Wikipedia",
  "paragraph": "The Can de Palleiro is a traditional Spanish breed of shepherd dog from the autonomous community of Galicia in north-western Spain. It was recognised by royal decree in 2001, and the stud-book was established in the same year.[1]: 525 [4] It is named after the haystack (palleiro) near which it traditionally sleeps.[5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Canaan_Dog",
  "title": "Canaan Dog - Wikipedia",
  "paragraph": "The Canaan Dog is the oldest[3] breed of pariah dog still existing and abundant across the Middle East.[1][2] It can be found in Israel,  Palestine,[4] Jordan, Lebanon and the Sinai Peninsula, and these, or dogs nearly identical, were also found in Iraq and Syria[5][6] over 9000 years ago.[3] It is the national dog of Israel.[7] As of 2012, there were 2,000 to 3,000 Canaan Dogs across the world.[8]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Canadian_Eskimo_Dog",
  "title": "Canadian Eskimo Dog - Wikipedia",
  "paragraph": "The Canadian Eskimo Dog or Canadian Inuit Dog[2] is a breed of working dog from the Arctic. Other names include qimmiq[3] or qimmit[4] (Inuit language word for \"dog\").  The Greenland Dog is considered the same breed as the Canadian Eskimo Dog since they have not yet diverged enough genetically to be considered separate breeds, despite their geographic isolation.[5][6]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Cane_Corso",
  "title": "Cane Corso - Wikipedia",
  "paragraph": "The Cane Corso[a] is an Italian breed of mastiff. It is usually kept as a companion dog or guard dog; it may also be used to protect livestock. In the past it was used for hunting large game, and also to herd cattle.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Cane_di_Oropa",
  "title": "List of Italian dog breeds - Wikipedia",
  "paragraph": "Seventeen Italian dog breeds are recognised by the Ente Nazionale della Cinofilia Italiana,[1] of which fifteen are recognised also by the Fédération Cynologique Internationale. A further six are in the process of recognition by the ENCI. There are a number of local breeds or types without national recognition.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Cane_Paratore",
  "title": "Cane Paratore - Wikipedia",
  "paragraph": "The Cane Paratore is a breed of herding dog from Italy, the breed primarily exists in its traditional role in Abruzzo, its historical region of origin, having not gained popularity from outside dog fanciers.[1][2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Cantabrian_Water_Dog",
  "title": "Cantabrian Water Dog - Wikipedia",
  "paragraph": "The Cantabrian Water Dog (Spanish: perro de agua cantábrico) is a landrace breed of dog developed in the coast of Cantabria, northern Spain, as an assistant to fishermen. The breed was classified and recognized by the Breeds Committee of the Spanish Ministry of Environment on 22 March 2011.[1] It is recognised by the Royal Canine Society of Spain as a variety of the Spanish water dog.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/C%C3%A3o_da_Serra_de_Aires",
  "title": "Portuguese Sheepdog - Wikipedia",
  "paragraph": "The Portuguese Sheepdog (Portuguese: cão da Serra de Aires, literally 'dog of Serra de Aires') is a medium-sized breed of dog of the herding dog type, and is one of the indigenous regional dogs of Portugal. The Portuguese name refers to Serra de Aires, a mountain near Montforte in the Alentejo region (sometimes mistaken for the Serra d'Aire, a range of hills or mountains marking the boundary between Ribatejo and Oeste, north of the Tagus river). The breed is nicknamed cão macaco ('macaque dog', 'monkey dog') for its furry face and lively attitude.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/C%C3%A3o_de_Castro_Laboreiro",
  "title": "Castro Laboreiro Dog - Wikipedia",
  "paragraph": "The Castro Laboreiro Dog (Portuguese: cão de Castro Laboreiro, 'dog of Castro Laboreiro'), also known as the Portuguese cattle dog or Portuguese watchdog, is a dog breed of the livestock guardian type, originating from Castro Laboreiro in the northern mountains of Portugal.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/C%C3%A3o_de_Gado_Transmontano",
  "title": "Cão de Gado Transmontano - Wikipedia",
  "paragraph": "The Cão de Gado Transmontano[a] or Transmontano Mastiff is a breed of livestock guardian dog from Portugal. It originates in the historical province of Trás-os-Montes e Alto Douro in north-eastern Portugal, and is a rare breed confined mostly to this area.[1][2][3][full citation needed]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/C%C3%A3o_Fila_de_S%C3%A3o_Miguel",
  "title": "Saint Miguel Cattle Dog - Wikipedia",
  "paragraph": "The Saint Miguel Cattle Dog (Portuguese: cão fila de São Miguel [ˈkɐ̃w ˈfilɐ ðɨ ˈsɐ̃w miˈɣɛl], literally 'catch dog of São Miguel') is a dog breed of mastiff type originating on São Miguel Island in the Azores, an island chain which is one of the autonomous regions of Portugal. The breed was originally used as a herding dog for working with cattle.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Cardigan_Welsh_Corgi",
  "title": "Cardigan Welsh Corgi - Wikipedia",
  "paragraph": "The Cardigan Welsh Corgi (/ˈkɔːrɡi/; Welsh for \"dwarf dog\")[1] is one of two separate dog breeds known as Welsh Corgis that originated in Wales; the other is the Pembroke Welsh Corgi. It is one of the oldest breeds of the British Isles.[1] Cardigan Welsh Corgis are known to be an extremely loyal dog breed.[2] They are also versatile and can live in a variety of settings.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Carea_Leon%C3%A9s",
  "title": "Carea Leonés - Wikipedia",
  "paragraph": "The  Carea Leonés (English: Leonese Sheepdog)[2] is a breed of herding dog from León, Castile and León, Spain (Europe), and is used as a sheepdog. For centuries, they tended flocks of Churra (sheep) in the mountains of the historical region of León.[3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Carolina_Dog",
  "title": "Carolina Dog - Wikipedia",
  "paragraph": "The Carolina dog, also known as a yellow dog,[1] yaller dog,[2][3][4] American Dingo,[3] or Dixie Dingo,[3] is a breed of medium-sized dog occasionally found feral in the Southeastern United States, especially in isolated stretches of longleaf pines and cypress swamps. Efforts to establish them as a standardized breed has gained the Carolina Dog breed recognition in two smaller kennel clubs and full acceptance into the breed-establishment program of one major kennel club.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Carpathian_Shepherd_Dog",
  "title": "Carpathian Shepherd Dog - Wikipedia",
  "paragraph": "[http://www.fci.be/Nomenclature/Standards/350g01-en.pdf\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Catahoula_Leopard_Dog",
  "title": "Catahoula Leopard Dog - Wikipedia",
  "paragraph": "The Catahoula Leopard Dog is an American dog breed named after Catahoula Parish, Louisiana. It became the state dog of Louisiana in 1979. It is recognized by the United Kennel Club under the name Louisiana Catahoula Leopard Dog, while the American Kennel Club Foundation Stock Service calls it Catahoula Leopard Dog. Both registries have assigned the breed a herding group designation, although it has traditionally been used in hunting feral boars.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Catalan_Sheepdog",
  "title": "Catalan Sheepdog - Wikipedia",
  "paragraph": "The  Catalan Sheepdog (Catalan: Gos d'atura català, French: Berger Catalan, Spanish: Pastor catalán) is a breed of Catalan Pyrenean dog used as a sheepdog. This dog is bred in Europe, especially in Spain, Finland, Germany, and Sweden.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Caucasian_Shepherd_Dog",
  "title": "Caucasian Shepherd Dog - Wikipedia",
  "paragraph": "The Caucasian Shepherd Dog or Caucasian Ovcharka is a large livestock guardian dog native to the countries of the Caucasus region, notably Georgia, Armenia, Azerbaijan, Russian oblast of Rostov, Russian Krais of Krasnodar & Stavropol, and Russian republics of Adygea, Kalmykia, Karachay-Cherkessia, Kabardino-Balkaria, North Ossetia, Ingushetia, Chechnya and Dagestan.[1] It was developed in the Soviet Union from about 1920 from dogs of the Caucasus Mountains and the steppe regions of Southern Russia.[2] The Caucasus Mountains in Georgia has historically been the principal region of distribution of the Caucasian Shepherd dogs, both in terms of numbers and the quality of the dogs present in the area.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Cavalier_King_Charles_Spaniel",
  "title": "Cavalier King Charles Spaniel - Wikipedia",
  "paragraph": "The Cavalier King Charles Spaniel is a British breed of toy dog of spaniel type. Four colours are recognised: Blenheim (chestnut and white), tricolour (black/white/tan), black and tan, and ruby; the coat is smooth and silky.[2] The lifespan is usually between eight and twelve years.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Central_Asian_Shepherd_Dog",
  "title": "Central Asian Shepherd Dog - Wikipedia",
  "paragraph": "70 cm (28 in) minimum\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Cesky_Fousek",
  "title": "Český fousek - Wikipedia",
  "paragraph": "The Český Fousek is a Czech breed of versatile hunting dog that was traditionally and currently used to hunt, point, and retrieve. This refers to the dog's natural ability in tracking, pointing, and retrieving game.[1][2] The name is in Czech, in which český means Czech and fousek is derived from vousy (facial hair) or vousky (whiskers). While the name is used for both sexes, Český Fousek specifically refers to a male dog while the female is traditionally called Česká Fouska.[3]  The breed is part of the griffon hunting dog family and have the beard and moustache (\"facial furnishings\") common to wirehairs. There is a large difference in size between the females and males of this breed, with the weight difference being up to 11 kilograms (24 lb).\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Cesky_Terrier",
  "title": "Cesky Terrier - Wikipedia",
  "paragraph": "The Cesky Terrier (/ˈtʃɛski/ CHES-kee; Czech: Český teriér, lit. 'Bohemian Terrier' or 'Czech Terrier') is a small terrier type dog originating in  Czechoslovakia.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Chesapeake_Bay_Retriever",
  "title": "Chesapeake Bay Retriever - Wikipedia",
  "paragraph": "The Chesapeake Bay Retriever is a large breed of dog belonging to the retriever, gundog, and sporting breed groups.[1][2][3] The breed was developed in the United States Chesapeake Bay area during the 19th century. Historically used by local market hunters to retrieve waterfowl, pull fishing nets, and rescue fishermen, it is today primarily a family pet and hunting companion, known for a bright and happy disposition; courage; willingness to work; alertness; intelligence; love of water; and hunting capabilities. The Chesapeake is a medium- to large-sized dog similar in appearance to the Labrador Retriever, but with a wavy coat.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Chien_Fran%C3%A7ais_Blanc_et_Noir",
  "title": "Chien Français Blanc et Noir - Wikipedia",
  "paragraph": "The Chien Français Blanc et Noir (translated into English as the French White and Black dog) is a breed of dog of the scenthound type, originating in France. The breed is used for hunting in packs and descends from the old Hound of Saintonge type of large hunting dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Chien_Fran%C3%A7ais_Blanc_et_Orange",
  "title": "Chien Français Blanc et Orange - Wikipedia",
  "paragraph": "The Chien Français Blanc et Orange is a breed of dog of the scenthound type, originating in France. The breed is used for hunting in packs and descends from the old Hound of Saintonge type of large hunting dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Chien_Fran%C3%A7ais_Tricolore",
  "title": "Chien Français Tricolore - Wikipedia",
  "paragraph": "The Chien Français Tricolore translated into English as the French Tricolour Hound, is a breed of dog of the scenthound type, originating in France. The breed is used for hunting in packs.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Chihuahua_(dog)",
  "title": "Chihuahua (dog) - Wikipedia",
  "paragraph": "The Chihuahua[a] or Spanish: Chihuahueño is a Mexican breed of toy dog. It is named for the Mexican state of Chihuahua and is among the smallest of all dog breeds.[3] It is usually kept as a companion animal or for showing.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Chilean_Terrier",
  "title": "Chilean Terrier - Wikipedia",
  "paragraph": "The Chilean Terrier is the first breed of dog from Chile.[1] The breed dates back to the late 19th century, resulting from the crossing of the Smooth Fox Terrier with the Ratonero Bodeguero Andaluz. This dog is recognised by the Kennel Club of Chile (KCC), but is not recognized by the FCI. Since 2011, the breed is classified into Group 3 of Alianz Canine Worldwide (ACW).[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Chinese_Crested_Dog",
  "title": "Chinese Crested Dog - Wikipedia",
  "paragraph": "The Chinese Crested Dog is a hairless breed of dog. Like most hairless dog breeds, the Chinese Crested Dog comes in two varieties, without hair and with hair, which can be born in the same litter: the hairless and the powderpuff.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Chinook_(dog)",
  "title": "Chinook (dog) - Wikipedia",
  "paragraph": "The Chinook is a breed of sled dog, developed in the state of New Hampshire during the early 20th century. The Chinook is New Hampshire's official state dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Chippiparai",
  "title": "Chippiparai - Wikipedia",
  "paragraph": "The Chippiparai is a breed of sighthound from the State of Tamil Nadu in southern India.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Chongqing_dog",
  "title": "Chongqing dog - Wikipedia",
  "paragraph": "The Chongqing dog (Chinese: 重庆犬; pinyin: Chóngqìng quǎn) is an ancient mastiff Tugou historically used for hunting and guarding in Chongqing, China.[1][2][3] Today this breed is prized as a fearless and tough protector of their family and home.[2][4]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Chortai",
  "title": "Chortai - Wikipedia",
  "paragraph": "The Chortai, sometimes spelt Chortaj, is a breed of sighthound from Ukraine.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Chow_Chow",
  "title": "Chow Chow - Wikipedia",
  "paragraph": "The Chow Chow is a spitz-type of dog breed originally from northern China.[3] The Chow Chow is a sturdily built dog, square in profile, with a broad skull and small, triangular, erect ears with rounded tips. The breed is known for a very dense double coat that is either smooth or rough.[1]: 4–5  The fur is particularly thick in the neck area, giving it a distinctive ruff or mane appearance. The coat may be shaded/self-red, black, blue, cinnamon/fawn, or cream.[1]: 4–5 [4]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Chukotka_sled_dog",
  "title": "Chukotka sled dog - Wikipedia",
  "paragraph": "The Chukotka Sled Dog (Russian: чуко́тская ездова́я, [t]chukótskaya yezdováya, \"Chukotsky riding dog\", literally \"riding Chukotsky\") is the aboriginal spitz breed of dog indigenous to the Chukchi people of Russia.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Cimarr%C3%B3n_Uruguayo",
  "title": "Cimarrón Uruguayo - Wikipedia",
  "paragraph": "The Cimarrón Uruguayo (Uruguayan Cimarrón) is a breed of molosser-type dog originating in Uruguay.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Cirneco_dell%27Etna",
  "title": "Cirneco dell'Etna - Wikipedia",
  "paragraph": "The Cirneco dell'Etna[a] is an Italian breed of hunting dog from the Mediterranean island of Sicily. It is named for the Etna volcano in eastern Sicily. It has a keen sense of smell, and is used to hunt small game, particularly rabbits.[3][4] As with many working dogs, registration is conditional on successful completion of a working trial.[5]\n"
 },
 {
  "url": "https://en.wikipedia.org/w/index.php?title=Classic_Dingo&action=edit&redlink=1",
  "title": "Classic Dingo - Wikipedia",
  "paragraph": "Other reasons this message may be displayed:\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Clumber_Spaniel",
  "title": "Clumber Spaniel - Wikipedia",
  "paragraph": "The Clumber Spaniel is a breed of dog of the spaniel type, developed in the United Kingdom. It is the largest of the spaniels, and comes in predominantly white with either lemon or orange markings. The name of the breed is taken from Clumber Park in Nottinghamshire where the breed was first developed. It is a gundog that specialises in hunting in heavy cover. They are gentle and loyal, and can act aloof with strangers. They have several habits which could be considered disadvantages, including a constant shedding of its coat and snoring.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Colombian_fino_hound",
  "title": "Colombian Fino Hound - Wikipedia",
  "paragraph": "The Colombian Fino Hound (Spanish: Sabueso Fino Colombiano)  is a breed of scent hound from Colombia.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Continental_bulldog",
  "title": "Continental bulldog - Wikipedia",
  "paragraph": "The Continental Bulldog, or Conti for short, is a newer dog breed created in Switzerland. It is officially recognized by the FCI since 2022.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Coton_de_Tul%C3%A9ar",
  "title": "Coton de Tulear - Wikipedia",
  "paragraph": "The Coton de Tuléar is a breed of small dog named for the city of Tuléar (also known as Toliara) in Madagascar. This breed is thought to have originated from a group of small white dogs that swam across the Malagasy channel following a shipwreck.[1] Known for its cotton-like coat, the Coton de Tuléar typically grows to no more than 18 pounds (8.2 kg), and are white, sometimes with grey, tan, black, or tri-colored markings. The Coton de Tuléar Day is celebrated on November 26th. [2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Cretan_Hound",
  "title": "Cretan Hound - Wikipedia",
  "paragraph": "\nThe Kritikos Lagonikos (Cretan Hound) (Greek:Kρητικός Λαγωνικός) is a breed of dog from the island of Crete, in Greece.[1] The Cretan Hound is recognized both in Greece and in Germany.[2] The breed is also considered to be the oldest European dog breed dating to perhaps before 3200 BCE and Neolithic times. [3][4] \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Croatian_Sheepdog",
  "title": "Croatian Sheepdog - Wikipedia",
  "paragraph": "The Croatian Sheepdog is a dog breed from Croatia.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Curly_Coated_Retriever",
  "title": "Curly-coated Retriever - Wikipedia",
  "paragraph": "The Curly-coated Retriever (not always hyphenated, and often called the Curly for short) is a breed of dog originally bred in England for upland bird and waterfowl hunting.  It is the tallest of the retrievers and is easily distinguishable by the mass of tight curls covering its body. Curly Coated and Wavy Coated (now known as the Flat-Coated Retriever) were the first two recognised retriever breeds, established as early as 1860.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Cursinu",
  "title": "Corsican Dog - Wikipedia",
  "paragraph": "The Corsican Dog (chien corse) or Cursinu, is a breed of dog originating from Corsica. It has existed on the island since the 16th century, but went into decline during the late 20th century; however it was saved and became recognized by the Société Centrale Canine. Used for a variety of working purposes, it has no specific health issues.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Czechoslovakian_Wolfdog",
  "title": "Czechoslovakian Wolfdog - Wikipedia",
  "paragraph": "Československý vlčák (Czech)\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Dachshund",
  "title": "Dachshund - Wikipedia",
  "paragraph": "The dachshund  (UK: /ˈdækshʊnd, -ənd, -hʊnt/ DAKS-huund, -⁠ənd, -⁠huunt or US: /ˈdɑːkshʊnt, -hʊnd, -ənt/ DAHKS-huunt, -⁠huund, -⁠ənt;[1][2][3][4] German: \"badger dog\"), also known as the wiener dog, badger dog, doxie, and sausage dog, is a short-legged, long-bodied, hound-type dog breed. The dog may be smooth-haired, wire-haired, or long-haired. Coloration varies.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Dalmatian_(dog)",
  "title": "Dalmatian (dog) - Wikipedia",
  "paragraph": "White background with black or brown spots. Black-spotted dogs will always have black noses, and brown will always have brown\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Dandie_Dinmont_Terrier",
  "title": "Dandie Dinmont Terrier - Wikipedia",
  "paragraph": "A Dandie Dinmont Terrier is a small Scottish dog breed in the terrier family. The breed has a very long body, short legs, and a distinctive topknot of hair on the head. They are friendly but tough, and are suitable for interaction with older children. There are breed-specific health concerns: they can be affected by spinal problems due to their elongated body, and the breed is affected by canine cancer at a higher than average rate.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Danish_Spitz",
  "title": "Danish Spitz - Wikipedia",
  "paragraph": "The Danish Spitz is a dog breed, originating from Denmark. The breed is known for making a good family pet, particularly as they are patient with children. Throughout time they've been known under various names, including Samoyed Spitz, Wolf Spitz, Greenland Spitz and White Spitz, which made it difficult to keep track of the breed and the breeding. Today the breed is known as the Danish Spitz.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Danish-Swedish_Farmdog",
  "title": "Danish–Swedish Farmdog - Wikipedia",
  "paragraph": "Danish–Swedish farmdog (Swedish: Dansk-svensk gårdshund, Danish: Dansk/svensk gårdhund) is a breed of dog that has its origin in Denmark and southern Sweden, but has become popular all over Scandinavia. It is a native breed which has historically lived on farms in the eastern part of Denmark and southernmost part of Sweden (i.e. on both sides of Øresund, the narrow strait that separates the Danish island of Zealand from the southern tip of the Scandinavian peninsula), serving as a guard dog, rat catcher and hunting dog.[1] The breed's soft and gentle temperament also makes them excellent companion dogs.\nThere are some indications that the breed originates from the pinscher breeds and the British white hunting terriers.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Denmark_Feist",
  "title": "Denmark Feist - Wikipedia",
  "paragraph": "The Denmark Feist, sometimes written DenMark Feist, is a breed of feist from Virginia in the United States.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Dingo",
  "title": "Dingo - Wikipedia",
  "paragraph": "Canis familiaris Linnaeus, 1758[2]Canis familiaris dingo Meyer, 1793[5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Dogo_Argentino",
  "title": "Dogo Argentino - Wikipedia",
  "paragraph": "The Dogo Argentino (plural Dogos Argentinos) is an Argentine breed of large dog of mastiff type. It was bred in the early twentieth century in Córdoba in central Argentina, primarily for dog-fighting, but also for hunting large game such as peccaries and pumas.[3]: 146 [4]: 340 [5]: 189 [6]: 140 [7][1] The foundation stock included a fighting dog of bulldog type, a Bull Terrier and a Mastín del Pirineo.[7]: 21 \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Guatemalan_Dogo",
  "title": "Guatemalan Dogo - Wikipedia",
  "paragraph": "Guatemalan Dogo (Dogo Guatemalteco), formerly known as the Guatemalan Bull Terrier, is a mastiff-type dog breed originating in Guatemala. It is neither recognized by the Fédération Cynologique Internationale (FCI) nor the American Kennel Club (AKC). However, it has the official national recognition of the Asociación Canofila Guatemalteca (ACANGUA) where it belongs to the Group 2.2.1 - Mastiffs.[1] As a unique breed originating in Guatemala, it is also the national dog of the country. It has been introduced to some other countries.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/List_of_Italian_dog_breeds",
  "title": "List of Italian dog breeds - Wikipedia",
  "paragraph": "Seventeen Italian dog breeds are recognised by the Ente Nazionale della Cinofilia Italiana,[1] of which fifteen are recognised also by the Fédération Cynologique Internationale. A further six are in the process of recognition by the ENCI. There are a number of local breeds or types without national recognition.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Dogue_Brasileiro",
  "title": "Dogue Brasileiro - Wikipedia",
  "paragraph": "The Dogue Brasileiro is a mastiff-type working dog breed originating in Brazil. It is neither recognized by the Fédération Cynologique Internationale (FCI) nor the American Kennel Club (AKC). However, it has the official Brazilian recognition by the Brazilian Confederation of Cynophilia (CBKC) where it belongs to the Group 11 – Breeds not recognized by the FCI.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Dogue_de_Bordeaux",
  "title": "Dogue de Bordeaux - Wikipedia",
  "paragraph": "The Dogue de Bordeaux, Bordeaux Mastiff, French Mastiff or Bordeauxdog is a large French mastiff breed. A typical brachycephalic mastiff breed, the Bordeaux is a very powerful dog, with a very muscular body. \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Donggyeongi",
  "title": "Donggyeongi - Wikipedia",
  "paragraph": "The Donggyeongi, also called daeng gyeon (댕견) or Donggyeong gae (동경개), is a naturally bob-tailed dog breed originated in Korea.[1][2]  It is an endangered breed of some 600 dogs in total, and has been protected as a natural heritage in South Korea since 2012 (Cultural Heritage Administration of Korea, number 540).[3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Drentse_Patrijshond",
  "title": "Drentse Patrijshond - Wikipedia",
  "paragraph": "The Drentsche Patrijshond is a versatile spaniel-type hunting dog from the Dutch province of Drenthe. Called the Dutch Partridge Dog (or \"Drent\" for Drenthe) in English, approximately 5,000 dogs are registered with the breed club in the Netherlands, and breed clubs operate in Belgium, Denmark, Scandinavia and North America. The Drentsche Patrijshond bears some resemblance to both spaniel and setter types of dog. An excellent pointer and retriever, this dog is often used to hunt fowl and adapts equally well to the field or marshes.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Drever",
  "title": "Drever - Wikipedia",
  "paragraph": "The Drever is  a breed of dog, a short-legged scenthound from Sweden used for hunting deer and other game. The Drever is descended from the Westphalian Dachsbracke, a type of German hound called Bracke. The breed name Drever was chosen through a contest in 1947.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Dunker",
  "title": "Dunker - Wikipedia",
  "paragraph": "A Dunker, also known as the Norwegian Hound, is a medium-sized breed of dog from Norway. It was bred by Wilhelm Dunker to be a scenthound by crossing a Russian Harlequin Hound with dependable Norwegian scent hounds.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Dutch_Shepherd",
  "title": "Dutch Shepherd - Wikipedia",
  "paragraph": "The Dutch Shepherd is a herding dog of Dutch origin. They were used by shepherds and farmers who needed a versatile dog, with few demands, and a dog that was able to adapt to a harsh and meager existence.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Dutch_Smoushond",
  "title": "Dutch Smoushond - Wikipedia",
  "paragraph": "The Dutch Smoushond (Hollandse Smoushond, Dutch Ratter) is a small breed of dog, related to the Pinscher and Schnauzer breed type kept in stables to eliminate rats and mice in Germany and the Netherlands. It is very rare and not well known outside the Netherlands, its country of origin.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/East_Siberian_Laika",
  "title": "East Siberian Laika - Wikipedia",
  "paragraph": "The East Siberian Laika (Vostotchno-Sibirskaia Laika) is a Russian breed of dog of spitz type, a hunting dog originating in parts of Siberia east of the Yenisei River.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/East-European_Shepherd",
  "title": "East European Shepherd - Wikipedia",
  "paragraph": "The East European Shepherd, also called Vostochno Evropeiskaya Ovcharka or VEO (Russian: Восточно-европейская овчарка or ВЕО) is a Soviet Union breed of shepherd dog. It was selectively bred in the Soviet Union from the German Shepherd to create a larger dog with better resistance to cold conditions, and was intended for military and guard work.[2][3][4]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Ecuadorian_Hairless_Dog",
  "title": "Hairless dog - Wikipedia",
  "paragraph": "A hairless dog is a dog with a genetic disposition for hairlessness and hair loss. There are two known types of genetic hairlessness, a dominant and a recessive type. The dominant type is caused by ectodermal dysplasia as a result of a mutation in the FOXI3 autosomal gene.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/English_Cocker_Spaniel",
  "title": "English Cocker Spaniel - Wikipedia",
  "paragraph": "The English Cocker Spaniel is a breed of gun dog. It is noteworthy for producing one of the most varied numbers of pups in a litter among all dog breeds. The English Cocker Spaniel is an active, good-natured, sporting dog[1] standing well up at the withers and compactly built.[2] There are \"field\" or \"working\" cockers and \"house\" cockers. It is one of several varieties of spaniel and is the foundation of its American cousin, the American Cocker Spaniel. The English Cocker is closer to the working-dog form of the Field Spaniel and the English Springer Spaniel. English Cocker Spaniels are also known as the \"Merry Spaniel\" due to their constantly wagging tail.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/English_Foxhound",
  "title": "English Foxhound - Wikipedia",
  "paragraph": "The English Foxhound is one of the four foxhound breeds of dog. It is a cousin of the American Foxhound. They are scent hounds, bred to hunt foxes by scent.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/English_Mastiff",
  "title": "English Mastiff - Wikipedia",
  "paragraph": "The English Mastiff, or simply the Mastiff, is a British dog breed of very large size. It is likely descended from the ancient Alaunt and Pugnaces Britanniae, with a significant input from the Alpine Mastiff in the 19th century. Distinguished by its enormous size, massive head, short coat in a limited range of colours, and always displaying a black mask, the Mastiff is noted for its gentle and loving nature. The lineage of modern dogs can be traced back to the early 19th century, but the modern type was stabilised in the 1880s and refined since. Following a period of sharp decline, the Mastiff has increased its worldwide popularity.  Throughout its history the Mastiff has contributed to the development of a number of dog breeds, some generally known as mastiff-type dogs or, confusingly, just as \"mastiffs\". It is the largest living canine, outweighing the wolf by up to 50 kg (110 lbs) on average.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/English_Setter",
  "title": "English Setter - Wikipedia",
  "paragraph": "The English Setter is a medium-size breed of dog. It is part of the setter group, which includes the red Irish Setters, Irish Red and White Setters, and black-and-tan Gordon Setters. The mainly white body coat is of medium length with long silky fringes on the back of the legs, under the belly and on the tail. The coat features flecks of colour, and the different colour varieties are referred to as belton.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/English_Shepherd",
  "title": "English Shepherd - Wikipedia",
  "paragraph": "The English Shepherd is a breed of herding dog from the United States.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/English_Springer_Spaniel",
  "title": "English Springer Spaniel - Wikipedia",
  "paragraph": "The English Springer is a breed of gun dog in the Spaniel group traditionally used for flushing and retrieving game. It is an affectionate, excitable breed with a typical lifespan of twelve to fourteen years.[1] They are very similar to the Welsh Springer Spaniel and are descended from the Norfolk or Shropshire Spaniels of the mid-19th century; the breed has diverged into separate show and working lines. The breed suffers from average health complaints. The show-bred version of the breed has been linked to \"rage syndrome\", although the disorder is very rare. It is closely related to the Welsh Springer Spaniel and very closely to the English Cocker Spaniel; less than a century ago, springers and cockers would come from the same litter. The smaller \"cockers\" hunted woodcock while the larger littermates were used to flush, or \"spring\", game. In 1902, The Kennel Club recognized the English Springer Spaniel as a distinct breed.[2] They are used as sniffer dogs on a widespread basis. The term Springer comes from the historic hunting role, where the dog would flush (spring) birds into the air.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/English_Toy_Terrier_(Black_%26_Tan)",
  "title": "English Toy Terrier (Black & Tan) - Wikipedia",
  "paragraph": "The English Toy Terrier (Black & Tan) is a small breed of terrier in the toy dog group.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Entlebucher_Mountain_Dog",
  "title": "Entlebucher Mountain Dog - Wikipedia",
  "paragraph": "The Entlebucher Sennenhund or Entlebucher Mountain Dog is a medium-sized herding dog, it is the smallest of the four regional breeds that constitute the Sennenhund dog type. The name Sennenhund refers to people called Senn, herders in the Swiss Alps. Entlebuch is a region in the canton of Lucerne in Switzerland. The breed is also known in English as the Entelbuch Mountain Dog, Entelbucher Cattle Dog,  and similar combinations.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Estonian_Hound",
  "title": "Estonian Hound - Wikipedia",
  "paragraph": "The Estonian Hound (Estonian: eesti hagijas) is a scent hound-like breed, with the distinction of being the only dog breed developed in Estonia. It was bred in 1947 when the Soviet Union's national economy ministry decided that every country in the Union must have its own breed. In September 2019, the FCI officially recognized the breed.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Estrela_Mountain_Dog",
  "title": "Estrela Mountain Dog - Wikipedia",
  "paragraph": "The Estrela Mountain Dog  (Portuguese: cão da Serra da Estrela) is a large breed of dog from the Estrela Mountains of Portugal bred to guard herds and homesteads.[1]  It is \"one of the oldest breeds in the Iberian Peninsula.\"[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Eurasier",
  "title": "Eurasier - Wikipedia",
  "paragraph": "All colors and color combinations are permitted with the exception of\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Field_Spaniel",
  "title": "Field Spaniel - Wikipedia",
  "paragraph": "The Field Spaniel is a medium-sized dog breed of spaniel type. They were originally developed to be all-black show dogs in the late 19th and early 20th centuries and were unpopular for work as a hunting dog. However, during the mid-20th century they were redeveloped as a longer-legged dog that was more suitable to be used for field work. They are now considered to be a rare breed, and are registered as a Vulnerable Native Breed by The Kennel Club.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Fila_Brasileiro",
  "title": "Fila Brasileiro - Wikipedia",
  "paragraph": "The Fila Brasileiro (Portuguese pronunciation: [ˈfilɐ bɾaziˈlejɾu]) is a Brazilian breed of large working dog of mastiff type.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Finnish_Hound",
  "title": "Finnish Hound - Wikipedia",
  "paragraph": "The Finnish Hound (suomenajokoira, Finnish Bracke) is a breed of dog originally bred for hunting hare and fox.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Finnish_Lapphund",
  "title": "Finnish Lapphund - Wikipedia",
  "paragraph": "The Finnish Lapphund (or Finnish Lapponian Dog) –Finnish: Suomen Lapinkoira– is a hardy, easy going, medium-size breed of Spitz type. Traditionally it has been used for herding reindeer. Although it is one of the most popular dog breeds in its native country, Finland, it is not very numerous outside of the Nordic countries.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Finnish_Spitz",
  "title": "Finnish Spitz - Wikipedia",
  "paragraph": "The Finnish Spitz (Finnish: suomenpystykorva) is a breed of dog originating in Finland.  The breed was originally trained to hunt all types of game from squirrels and other rodents to bears.[1]  It is a \"bark pointer\", indicating the position of game by barking, and drawing the game animal's attention to itself, allowing an easier approach for the hunter. Its original game hunting purpose was to point to game that fled into trees, such as grouse, and capercaillies, but it also serves well for hunting elk. Some individuals have even been known to go after a bear. In its native country, the breed is still mostly used as a hunting dog. The breed is typically friendly and good with children, so it is suitable for domestic life. The Finnish Spitz has been the national dog of Finland since 1979.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Flat-coated_Retriever",
  "title": "Flat-coated Retriever - Wikipedia",
  "paragraph": "The Flat-coated Retriever is a gundog breed originating from England. It was developed as a retriever both on land and in the water.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/French_Bulldog",
  "title": "French Bulldog - Wikipedia",
  "paragraph": "The French Bulldog, French: Bouledogue Français, is a French breed of companion dog or toy dog. It appeared in Paris in the mid-nineteenth century, apparently the result of cross-breeding of Toy Bulldogs imported from England and local Parisian ratters.[4]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/French_Spaniel",
  "title": "French Spaniel - Wikipedia",
  "paragraph": "The French Spaniel (Epagneul Français) is a breed of dog of the Spaniel-like setter. It was developed in France and Canada as a hunting dog, descended from dogs of the 14th century. Popular with royalty during the Middle Ages, it nearly became extinct by the turn of the 20th century but was saved by the efforts of Father Fournier, a French priest. One of the largest breeds of Spaniel, it typically has a white coat with brown markings. It is a friendly breed that has few health issues, but can be affected by a syndrome called acral mutilation and analgesia. The breed is recognised by Canadian and international kennel clubs but not by The Kennel Club (UK). The American Kennel Club has included the breed in its Foundation Stock Service, the first step to full recognition.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Galgo_Espa%C3%B1ol",
  "title": "Galgo Español - Wikipedia",
  "paragraph": "The Galgo Español ('Spanish galgo') or Spanish Greyhound is an ancient breed of dog, specifically a member of the sighthound family.\nThe English greyhound is possibly a descendant of the Spanish greyhound and, for several years in the 20th century, some breeders did cross-breed Galgos and Greyhounds in order to produce faster and more powerful Galgos, specifically for track racing purposes.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Garafian_Shepherd",
  "title": "Pastor Garafiano - Wikipedia",
  "paragraph": "The Pastor Garafiano is a Spanish breed of sheep dog native to the island of La Palma in the Canary Islands. The name comes from the comarca of Garafía, in the north of the island, where the breed was most common, although specimens can be found throughout the island. The breed was officially recognized by the Real Sociedad Canina de España in 2003.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Gascon_Saintongeois",
  "title": "Gascon Saintongeois - Wikipedia",
  "paragraph": "The Gascon Saintongeois is a breed of dog of the scenthound type, recognised in two varieties, Grand (large) and Petit (smaller than the Grand, but not a small dog). Originating in France, the breed is used for hunting in packs and descends from the old Hound of Saintonge type of large hunting dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Georgian_Shepherd",
  "title": "Georgian Shepherd - Wikipedia",
  "paragraph": "The Georgian Shepherd (Georgian: ქართული ნაგაზი), also known as Georgian Mountain Dog (Georgian: ქართული მთის ძაღლი), is a breed of guard dog and livestock guardian dog from the Georgian Caucasus.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/German_Hound",
  "title": "German Hound - Wikipedia",
  "paragraph": "The German Hound (Deutsche Bracke) is a breed of dog originating in Westphalia, a region of Germany. The German Hound is of the scenthound type, used for hunting both large and small game.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/German_Longhaired_Pointer",
  "title": "German Longhaired Pointer - Wikipedia",
  "paragraph": "The German Longhaired Pointer (GLP) is a breed of dog. Developed in Germany, it is used as a multipurpose gundog. It is closely related to its cousins, the German Shorthaired Pointer (GSP), the German Wirehaired Pointer (GWP) and the Large Münsterländer, which was previously part of the breed.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/German_Pinscher",
  "title": "German Pinscher - Wikipedia",
  "paragraph": "The German Pinscher or Deutscher Pinscher is a German breed of terrier in the  Pinscher and Schnauzer group.[3][1]: 218  It shares common origins with the Schnauzer, of which it is essentially a short-haired equivalent.[4] It is seen in two colours, either black-and-tan or self-coloured red, this varying from deer-red to a dark reddish brown.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/German_Roughhaired_Pointer",
  "title": "German Roughhaired Pointer - Wikipedia",
  "paragraph": "The German Roughhaired Pointer, the Deutscher Stichelhaariger Vorstehhund in German, is a medium-sized breed of pointing dog developed in Germany.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/German_Shepherd",
  "title": "German Shepherd - Wikipedia",
  "paragraph": "The German Shepherd[a] is a German breed of working dog of medium to large size. The breed was developed by Max von Stephanitz using various traditional German herding dogs from 1899.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/German_Shorthaired_Pointer",
  "title": "German Shorthaired Pointer - Wikipedia",
  "paragraph": "The German Shorthaired Pointer is a breed of medium-sized pointing dog developed in nineteenth century Germany.[1] It is energetic and powerful, with strong legs and great endurance. It is a versatile all-purpose gun dog suitable for hunting and retrieving on both land and water, with a strong drive to find and chase game.[2] It may also be kept as a companion dog, though as a high-energy sporting dog, it requires significant amounts of exercise. \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/German_Spaniel",
  "title": "German Spaniel - Wikipedia",
  "paragraph": "The German Spaniel, also known as the Deutscher Wachtelhund (German Quail Dog), is a breed of dog that was developed in Germany around 1890, and is used as a hunting dog. Descended from the old German breed, the Stöberer (lit. \"rummager\"), which became popular with commoners following the Revolutions of 1848 in the German states, who required a versatile hunting dog. Stoeberer is now a type of hunting dog in Germany with the Wachtelhund being its sole member. The breed is not very well known outside of Germany, but was recognised by the United Kennel Club in 1996.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/German_Spitz",
  "title": "German Spitz - Wikipedia",
  "paragraph": "The German Spitz (German: Deutscher Spitz) is a breed of spitz-type dogs from Germany. It is considered a single breed, with five distinct varieties based on size and colour: the Wolfsspitz/Keeshond, the Giant Spitz or Großspitz, the Medium Spitz or Mittelspitz, the Miniature Spitz or Kleinspitz and the Pomeranian or Zwergspitz (\"Dwarf Spitz\").\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/German_Wirehaired_Pointer",
  "title": "German Wirehaired Pointer - Wikipedia",
  "paragraph": "The German Wirehaired Pointer is a medium to large-sized griffon type breed of dog developed in the 19th century in Germany for versatile hunting.  It became a leading gun dog in Germany in the later part of the 20th century. It is the result of the careful mixing and crossing of the Wirehaired Pointing Griffon, German Shorthaired Pointer, German Roughhaired Pointer, and the hunting Pudelpointer in the late 19th century.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Giant_Schnauzer",
  "title": "Giant Schnauzer - Wikipedia",
  "paragraph": "The Giant Schnauzer is a breed of dog developed in the 17th century in Germany. It is the largest of the three breeds of Schnauzer—the other two breeds being the Standard Schnauzer and the Miniature Schnauzer. Numerous breeds were used in its development, including the black Great Dane, the Bouvier des Flandres, and the German Pinscher. Originally bred to assist on farms by driving livestock to market and guarding the farmer's property, the breed eventually moved into the city, where it worked guarding breweries, butchers' shops, stockyards and factories. It was unknown outside of Bavaria until it became popular as a military dog during World War I and World War II.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Glen_of_Imaal_Terrier",
  "title": "Glen of Imaal Terrier - Wikipedia",
  "paragraph": "The Glen of Imaal Terrier (Irish: Brocaire Uí Mháil) is a breed of dog of the terrier category and one of four Irish terrier breeds. It is sometimes called the Irish Glen of Imaal Terrier or the Wicklow Terrier, and the name of the breed is often shortened by fanciers to just Glen.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Golden_Retriever",
  "title": "Golden Retriever - Wikipedia",
  "paragraph": "The Golden Retriever is a Scottish breed of retriever dog of medium size. It is characterised by a gentle and affectionate nature and a striking golden coat. It is commonly kept as a pet and is among the most frequently registered breeds in several Western countries. It is a frequent competitor in dog shows and obedience trials; it is also used as a gundog, and may be trained for use as a guide dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Go%C5%84czy_Polski",
  "title": "Gończy Polski - Wikipedia",
  "paragraph": "The Gończy Polski, sometimes translated as the Polish Hound or the Polish Hunting Dog, is a breed of scent hound originating in Poland.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Gordon_Setter",
  "title": "Gordon Setter - Wikipedia",
  "paragraph": "The Gordon Setter is a large breed of dog, a member of the setter family that also includes both the better-known Irish Setter and the English Setter. Setter breeds are classified as members of either the Sporting or Gundog Group depending on the national kennel club or council.  The original purpose of the breed was to hunt gamebirds. Their quarry in the United Kingdom, may be partridge or grouse, pheasant, ptarmigan, blackgame, snipe or woodcock: whilst overseas bird dogs are worked on quail, willow grouse, sand grouse, guinea fowl, sagehen, francolin and any other bird that will sit to a dog—that is to say, will attempt to avoid a potential predator by concealment rather than by taking to the wing at the first sign of danger.  It is this combination of a bird that will sit fast in front of a dog that will remain on point that makes bird dog work possible.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Grand_Anglo-Fran%C3%A7ais_Blanc_et_Noir",
  "title": "Grand Anglo-Français Blanc et Noir - Wikipedia",
  "paragraph": "The Grand Anglo-Français Blanc et Noir (FCI No.323) translated into English as the Great Anglo-French White and Black Hound, is a breed of dog used in hunting as a scenthound, usually in packs. It is one of the Anglo-French hound breeds which were created by crossing French scenthounds with English (Anglo) Foxhounds.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Grand_Anglo-Fran%C3%A7ais_Blanc_et_Orange",
  "title": "Grand Anglo-Français Blanc et Orange - Wikipedia",
  "paragraph": "The Grand Anglo-Français Blanc et Orange translated into English as the Great Anglo-French White and Orange Hound, is a breed of dog used in hunting as a scenthound, usually in packs. It is one of the Anglo-French hound breeds which were created by crossing French scenthounds with English (Anglo) foxhounds.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Grand_Anglo-Fran%C3%A7ais_Tricolore",
  "title": "Grand Anglo-Français Tricolore - Wikipedia",
  "paragraph": "The Grand Anglo-Francais Tricolore is a breed of dog used in hunting as a scenthound, usually in packs. It is one of the Anglo-French hound breeds which were created by crossing French scenthounds with English (Anglo) Foxhounds.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Grand_Basset_Griffon_Vend%C3%A9en",
  "title": "Grand Basset Griffon Vendéen - Wikipedia",
  "paragraph": "The Grand Basset Griffon Vendéen or GBGV is a dog breed from France.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Grand_Bleu_de_Gascogne",
  "title": "Grand Bleu de Gascogne - Wikipedia",
  "paragraph": "The Grand Bleu de Gascogne is a breed of hounds of the scenthound type, originating in France and used for hunting in packs. Today's breed is the descendant of a very old type of large hunting dog, and is an important breed in the ancestry of many other hounds.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Grand_Griffon_Vend%C3%A9en",
  "title": "Grand Griffon Vendéen - Wikipedia",
  "paragraph": "A Grand Griffon Vendéen is a breed of hunting dog originating in France. It was the first of the Vendée griffons to be bred from the Greffier whose lineage dates back to the 16th Century.[1] There are also several other breeds of Griffons from Vendée, all of them smaller: the Briquet Griffon Vendéen, and the Grand and Petit Basset Griffon Vendéen.  Related Griffon breeds include the Griffon Fauve de Bretagne, the Griffon Bleu de Gascogne and the Griffon Nivernais.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Great_Dane",
  "title": "Great Dane - Wikipedia",
  "paragraph": "The Great Dane is a large sized dog breed originating from Germany. The Great Dane descends from hunting dogs from the Middle Ages used to hunt wild boar and deer, and as guardians of German nobility. It is one of the two largest dog breeds in the world, along with the Irish Wolfhound.[2][3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Greater_Swiss_Mountain_Dog",
  "title": "Greater Swiss Mountain Dog - Wikipedia",
  "paragraph": "The Greater Swiss Mountain Dog (German: Grosser Schweizer Sennenhund or French: Grand Bouvier Suisse) is a dog breed which was developed in the Swiss Alps. The name Sennenhund refers to people called Senn or Senner, dairymen and herders in the Swiss Alps. Greater Swiss Mountain Dogs are almost certainly the result of indigenous dogs mating with large mastiff-type dogs brought to Switzerland by foreign settlers. At one time, the breed was believed to have been among the most popular in Switzerland.[1] It was assumed to have almost died out by the late 19th century, since its work was being done by other breeds or machines, but was rediscovered in the early 1900s.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Greek_Harehound",
  "title": "Greek Harehound - Wikipedia",
  "paragraph": "The Greek Harehound (Greek: Ελληνικός Ιχνηλάτης; FCI No. 214) is a rare breed of dog that only comes in a black and tan color, originally bred as a scenthound for tracking and chasing hare in Southern Greece.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Greek_Shepherd",
  "title": "Greek Shepherd - Wikipedia",
  "paragraph": "The Greek Shepherd or Greek Sheepdog (Greek: Ελληνικός Ποιμενικός, Ellinikós Pimenikós) is a breed of livestock guardian dog from Greece. Thought to be ancient in origin, the Greek Shepherd is very closely related to livestock guardian dog breeds from neighbouring countries; it is believed that some dogs are simultaneously claimed to be other breeds as they migrate annually across national borders with the flocks they protect in search seasonal pastures.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Greenland_Dog",
  "title": "Greenland Dog - Wikipedia",
  "paragraph": "The Greenland Dog (Greenlandic: Kalaallit Qimmiat, Danish: Grønlandshund) is a large breed of husky-type dog kept as a sled dog. They were brought from Siberia to North America by the Thule people 1,000 years ago, along with the Canadian Eskimo Dog. The Canadian Eskimo Dog is considered the same breed as the Greenland Dog since they have not yet diverged enough genetically to be considered separate breeds, despite their geographic isolation.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Greyhound",
  "title": "Greyhound - Wikipedia",
  "paragraph": "The English Greyhound, or simply the Greyhound, is a breed of dog, a sighthound which has been bred for coursing, greyhound racing and hunting. Since the rise in large-scale adoption of retired racing Greyhounds, the breed has seen a resurgence in popularity as a family pet.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Griffon_Bleu_de_Gascogne",
  "title": "Griffon Bleu de Gascogne - Wikipedia",
  "paragraph": "The Griffon Bleu de Gascogne is a breed of dog of the scenthound type, originating in France, and is a versatile hunting dog, used on small and large game, in packs or individually. The Griffon Bleu de Gascogne has a speckled, rough coat.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Griffon_Fauve_de_Bretagne",
  "title": "Griffon Fauve de Bretagne - Wikipedia",
  "paragraph": "The Griffon Fauve de Bretagne (English: Fawn Brittany Griffon) is a breed of dog of the scenthound type, originating in France in the region of Brittany.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Griffon_Nivernais",
  "title": "Griffon Nivernais - Wikipedia",
  "paragraph": "The Griffon Nivernais is a breed of dog of the scenthound type, originating in France. It is a versatile hunting dog, used on small and large game, in packs or individually. Today's breed is a reconstruction of an ancient type of dog from the Nivernais region.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Gull_Dong",
  "title": "Gull Dong - Wikipedia",
  "paragraph": "The Gull Dong is a dog breed of India and Pakistan[1] that is often used in dog fighting, hunting, and guarding.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Gull_Terrier",
  "title": "Gull Terrier - Wikipedia",
  "paragraph": "The Gull Terrier (also known as the Gull Terr)[A] is a rare breed of dog that originates from the Punjab region of Pakistan and India; it is believed to be several hundred years old.[1] They are often used in dog fighting, hunting, and guarding. The Gull Terrier is related to the Bull Terrier breeds that come from Great Britain. These English dog breeds, along with those indigenous to the Indian subcontinent such as the Bully Kutta, played a major role in the Gull Terrier's breeding development and are considered to be a direct ancestor of the modern Gull Terrier.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/H%C3%A4llefors_Elkhound",
  "title": "Hällefors Elkhound - Wikipedia",
  "paragraph": "Hällefors Elkhound (Swedish: Hälleforshund) is a Swedish dog breed.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Halden_Hound",
  "title": "Halden Hound - Wikipedia",
  "paragraph": "The Halden Hound (Norwegian: Haldenstøver), is a medium-sized Norwegian dog breed of the  hound class, used for hunting hares and other plains quarry. It resembles an American Foxhound but is smaller. It was named after Halden, a town in southeastern Norway.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Hamiltonst%C3%B6vare",
  "title": "Hamiltonstövare - Wikipedia",
  "paragraph": "The Hamiltonstövare is a breed of dog, bred as a hunting hound. The breed was developed in Sweden by the founder of the Swedish Kennel Club, Count Adolf Hamilton. Its ancestry includes several German hounds as well as English Foxhounds and Harriers.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Hanover_Hound",
  "title": "Hanover Hound - Wikipedia",
  "paragraph": "The Hanover Hound is a breed of dog sometimes referred to as a Hanoverian Hound. It is a hunting and tracking dog descended from bloodhounds of medieval times. It was first introduced into France in the 1980s and is still a very rare breed. It was crossbred with the Bavarian Hound, which gave rise to the Bavarian Mountain Hound.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Harrier_(dog)",
  "title": "Harrier (dog) - Wikipedia",
  "paragraph": "The Harrier is a medium-sized  dog breed of the  hound class, \nused for hunting hares by trailing them. It resembles an English Foxhound but is slightly smaller, though not as small as a Beagle. The breed has been used since the mid 13th century.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Havanese_dog",
  "title": "Havanese dog - Wikipedia",
  "paragraph": "The Havanese, a bichon-type dog, is the national dog of Cuba, developed from the now extinct Blanquito de la Habana (\"little white dog of Havana\"). The Blanquito descended from the also now-extinct Bichón Tenerife. It is believed that the Blanquito was eventually cross-bred with other bichon types, including the poodle, to create what is now known as the Havanese. Sometimes referred to as \"Havana Silk Dogs\", this was originally another name for the Blanquito de la Habana.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Himalayan_Sheepdog",
  "title": "Himalayan Sheepdog - Wikipedia",
  "paragraph": "The Himalayan Sheepdog, known locally by various names including the Bhote, Bangara or Gaddi Kutta, and sometimes called the Himalayan Mastiff, is a breed of livestock guardian dog from the Himalayas, covering   India.[1][2][3][4][5] The Himalayan Sheepdog is found in the Himalayan foothills from eastern Nepal to Kashmir.[4][5][6] The breed is primarily used as a livestock guardian dog, protecting flocks of yak and sheep from various predators, and as a property guardian dog; unusually for a livestock guardian, the breed is also used to assist with herding.[4][5][6] The Himalayan Sheepdog is also used to assist in hunting.[6]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Hierran_Wolfdog",
  "title": "Lobito Herreño - Wikipedia",
  "paragraph": "The Lobito Herreño or Perro de Pastor Herreño is a Spanish breed or type of pastoral dog. It is found mostly on the island of El Hierro in the Canary Islands, but also on Gran Canaria, La Palma and Tenerife.[1] It is not recognised as breed by the Real Sociedad Canina de España, but in 2021 was one of three breeds or types listed as a grupo étnico canino,[2] which the society defines as a regional dog population with consistent form and function evolved through functional selection.[3] The other two dogs in this group are the Podenco Orito Español and the Carea Castellano-Manchego.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Hmong_bobtail_dog",
  "title": "Hmong bobtail dog - Wikipedia",
  "paragraph": "The Hmong bobtail dog (Vietnamese: Chó H'Mông Cộc đuôi), is an ancient medium size spitz dog breed and one of Vietnam's Four Great National Dogs (Vietnamese: tứ đại quốc khuyển).[1][2] This dog is primarily used a hunter, herder and guard dog by the Hmong people in northern Vietnam and today they are also used as border police and military dogs.[3][2][4] While not recognized by the Fédération Cynologique Internationale, the Hmong bobtail dog is recognized by the Vietnam Kennel Association.[5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Hokkaido_(dog)",
  "title": "Hokkaido (dog) - Wikipedia",
  "paragraph": "The Hokkaido (北海道犬, Hokkaidō-inu or Hokkaidō-ken) is a breed of dog originating from Japan. Other names for the breed include Ainu-ken, Seta, Ainu dog, Hokkaidog. In Japan, its name is sometimes shortened to Dō-ken (道犬). The Hokkaido is native to the prefecture of the same name in Japan.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Hovawart",
  "title": "Hovawart - Wikipedia",
  "paragraph": "The Hovawart is a medium to large size German dog breed.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Huntaway",
  "title": "Huntaway - Wikipedia",
  "paragraph": "The Huntaway (also known as the New Zealand Huntaway) is a large, strongly-built breed of dog used for general sheep-herding tasks in New Zealand, where they originate. They were bred to use their loud, deep bark to drive sheep.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Hygen_Hound",
  "title": "Hygen Hound - Wikipedia",
  "paragraph": "A Hygen Hound (Hygenhund)[1] is a Norwegian breed of dog from the hound group, created in the 19th century by Norwegian breeder Hygen from various other hound breeds. The Hygen Hound is an endurance hunter who can traverse Arctic terrain for long periods of time without fatigue.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Ibizan_Hound",
  "title": "Ibizan Hound - Wikipedia",
  "paragraph": "The Ibizan Hound (Spanish: podenco ibicenco, Catalan: ca eivissenc) is a lean, agile dog of the hound family. There are two hair types of the breed: smooth and wire. The more commonly seen type is the smooth. Some consider there to be a third type, long, but the longhair is most likely a variation of the wire.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Icelandic_Sheepdog",
  "title": "Icelandic Sheepdog - Wikipedia",
  "paragraph": "The Icelandic Sheepdog, Icelandic: Íslenskur Fjárhundur,[a] is an Icelandic breed of dog of Nordic Spitz type. It derives from dogs brought to Iceland by Viking settlers in the ninth century; it is both similar and closely related to the Buhund of Norway and the Vallhund of Sweden, which  derive from the same ancestral stock.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Indian_pariah_dog",
  "title": "Indian pariah dog - Wikipedia",
  "paragraph": "The Indian pariah dog, also known as  the Indian native dog or INDog,[6][7] South Asian pye dog and Desi Kutta,[4][6] is a landrace of dog native to the Indian subcontinent.[5] They have erect ears, a wedge-shaped head, and a curved tail. It is easily trainable and often used as a guard dog and police dog.[8][9] This dog is an example of an ancient group of dogs known as pye-dogs. It is possible that the ancestry of this dog dates back 4,500 years.[10]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Indian_Spitz",
  "title": "Indian Spitz - Wikipedia",
  "paragraph": "The Indian Spitz is a spitz-type dog breed belonging to the utility group. The Indian Spitz was one of the most popular dogs in India in the 1980s and 1990s when India's import rules made it difficult to import dogs of other breeds.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Irish_Red_and_White_Setter",
  "title": "Irish Red and White Setter - Wikipedia",
  "paragraph": "The Irish Red and White Setter (Irish: An Sotar Rua agus Bán) is a breed of dog. As with all setters, it is classified as a gundog in the UK and is included in the sporting group in America and Canada. It is virtually identical in use and temperament to the related Irish Setter, as well as the Gordon and English setters, but is more often found as a working gun dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Irish_Setter",
  "title": "Irish Setter - Wikipedia",
  "paragraph": "The Irish Setter (Irish: sotar rua,[1] literally \"red setter\") is a setter, a breed of gundog, and family dog. The term Irish Setter is commonly used to encompass the show-bred dog recognised by the American Kennel Club as well as the field-bred Red Setter recognised by the Field Dog Stud Book.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Irish_Terrier",
  "title": "Irish Terrier - Wikipedia",
  "paragraph": "The Irish Terrier (Irish: Brocaire Rua) is a dog breed from Ireland, one of many breeds of terrier. The Irish Terrier is considered one of the oldest terrier breeds. The Dublin dog show in 1873 was the first to provide a separate class for Irish Terriers. By the 1880s, Irish Terriers were the fourth most popular breed in Ireland and Britain.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Irish_Water_Spaniel",
  "title": "Irish Water Spaniel - Wikipedia",
  "paragraph": "The Irish Water Spaniel (Irish: An Spáinnéar Uisce) is a breed of dog that is the tallest of the spaniels.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Irish_Wolfhound",
  "title": "Irish Wolfhound - Wikipedia",
  "paragraph": "The Irish Wolfhound is an Irish breed of large sighthound. It is among the largest of all breeds of dog. It was developed in the late 19th century by G.A. Graham, whose aim was to recreate the old wolfhounds of Ireland, which were believed to be extinct. These had, by their presence and substantial size, inspired literature, poetry and mythology;[2][3][4] indeed, they were used as guardian dogs and for hunting wolves.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Istrian_Coarse-haired_Hound",
  "title": "Istrian Coarse-haired Hound - Wikipedia",
  "paragraph": "The Istrian Coarse-haired Hound (Croatian: istarski oštrodlaki gonič, Slovene: istrski ostrodlaki gonič) is a dog breed from Croatia. It is a rough-coated scent hound still kept primarily as a hunting dog rather than as a pet.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Istrian_Shorthaired_Hound",
  "title": "Istrian Shorthaired Hound - Wikipedia",
  "paragraph": "The Istrian Short-haired Hound (original name is Istarski Kratkodlaki Gonič) is a breed of dog from Istria in Croatia, descended from a very old type of scenthound. This hound is the slightly smaller counterpart to the longer-coated Istrian Coarse-haired Hound from the same region.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Italian_Greyhound",
  "title": "Italian Greyhound - Wikipedia",
  "paragraph": "The Italian Greyhound (Italian: Piccolo levriero Italiano) is an Italian breed of small sighthound. It may also be called the Italian Sighthound.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Jack_Russell_Terrier",
  "title": "Jack Russell Terrier - Wikipedia",
  "paragraph": "The Jack Russell Terrier is a small terrier that has its origins in fox hunting in England. It is principally white-bodied and smooth, rough or broken-coated and can be any colour.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Jagdterrier",
  "title": "Jagdterrier - Wikipedia",
  "paragraph": "The Jagdterrier (/ˈjɑːktɛriər/ YAHK-terr-i-ər) (English: Hunting Terrier) is a type of working terrier, originating in Germany, that is used for hunting quarry both above and underground. This breed of terrier is also called the German Hunt Terrier.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/J%C3%A4mthund",
  "title": "Jämthund - Wikipedia",
  "paragraph": "The Jämthund, also called the Swedish Elkhound, is a breed of dog of the Spitz type that is found in Northern Europe. The Jämthund is eponymous with Jämtland, a province in the middle of Sweden.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Japanese_Chin",
  "title": "Japanese Chin - Wikipedia",
  "paragraph": "The Japanese Chin (Japanese: 狆, chin), also known as the Japanese Spaniel,[1] is a toy dog breed, being both a lap dog and a companion dog, with a distinctive heritage.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Japanese_Spitz",
  "title": "Japanese Spitz - Wikipedia",
  "paragraph": "The Japanese Spitz (日本スピッツ, Nihon Supittsu, Japanese pronunciation: [nʲippoɴ.sɯ̥ᵝpʲittsɯᵝ]) is a small to medium breed of dog of the Spitz type. There are varying standards around the world as to the ideal size of the breed, but they are always larger than their smaller cousins, the Pomeranian. They were developed in Japan in the 1920s and 1930s by breeding a number of other Spitz type dog breeds together. They are recognized by the vast majority of the major kennel clubs, except the American Kennel Club due to it being of similar appearance to the white Pomeranian, American Eskimo Dog and Samoyed. While they are a relatively new breed, they are becoming widely popular due to their favorable temperament and other features.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Japanese_Terrier",
  "title": "Japanese Terrier - Wikipedia",
  "paragraph": "The Japanese Terrier (日本テリア, Nihon Teria) is a small terrier native to Japan.  It is believed to be descended from the progeny of fox terrier types, pointers and indigenous Japanese dogs.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Korean_Jindo",
  "title": "Korean Jindo - Wikipedia",
  "paragraph": "The Jindo dog (진도개, Jindo-gae, 진도견, Jindo-gyeon, 珍島犬), formerly known as Chindo dog is an indigenous dog[1][2] native to Jindo Island in South Korea. It is one of South Korea's Natural Treasures (대한민국의 천연기념물/大韓民國의 天然紀念物), prized for its loyalty and homing instinct.[3] Due to its protected status within South Korea, only dogs born on Jindo Island can be officially registered as a Jindo by the Government of South Korea after an inspection,[4] although the Jindo dog was registered as a breed by the United Kennel Club on January 1, 1998[5] and by the Fédération Cynologique Internationale in 2005.[6][7]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Jonangi",
  "title": "Jonangi - Wikipedia",
  "paragraph": "The Jonangi, also known as Jonangi Jagilam[1]  or Kolleti Jagilam[2] is an Indian dog breed, mostly found in the separated state of Andhra Pradesh, some parts of Karnataka, and all along the east coast from West Bengal to Tamil Nadu.[3] It was once abundantly found in and around Kolleru Lake in West Godavari and Krishna Districts of Andhra Pradesh. This dog has very short, smooth hair. It is used as a hunting and herding dog by people who have this breed.[4][5][6]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kai_Ken",
  "title": "Kai Ken - Wikipedia",
  "paragraph": "The Kai Ken (甲斐犬, also called the Tora Inu or Tiger Dog) is a  breed of dog from Japan, where it is a national monument. It is a rare dog even in its native land and is one of the six native Japanese dog breeds protected by the Nihon Ken Hozonkai.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kaikadi_(dog)",
  "title": "Kaikadi (dog) - Wikipedia",
  "paragraph": "The Kaikadi is a breed of sighthound from India.[1][2][3] The Kaikadi are kept by the Kaikadi people, a nomadic tribe in Maharashtra and parts of Gujarat.[1][2] They are a particularly small and thin breed of sighthound standing between 38 and 46 centimetres (15 and 18 in) and weighing around 20 kilograms (44 lb).[1][2] They have long, thin legs and powerful thighs and hock joints, a long tapered tail, a long, thin head with prominent eyes, and erect ears.[1][2] Their short coat comes in a variety of colours, but white, tan and black are predominant.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kangal_Shepherd_Dog",
  "title": "Kangal Shepherd Dog - Wikipedia",
  "paragraph": "The Kangal Shepherd Dog (Turkish: Kangal Çoban Köpeği) is a traditional Turkish breed of large livestock guardian dog.[2] The breed name derives from that of the town and district of Kangal in Sivas Province, the easternmost province of the Central Anatolia Region in central Turkey. The coat colour varies from pale fawn to wolf grey, always with a black mask. \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kanni",
  "title": "Kanni - Wikipedia",
  "paragraph": "The Kanni (கன்னி), meaning pure (also known as the Maiden's Beastmaster), is a rare indigenous South Indian sighthound breed of dog found in the state of Tamil Nadu.[2] Their native breeding tract is located around villages in the Tirunelveli, Virudhunagar and Thoothukudi districts. The breed is used mainly for coursing. \"Kanni\" refers to the black and tan and black and sable varieties, while the solid-coloured variety is known as the Chippiparai. However, some experts claim that the Kanni and the Chippiparai are distinct breeds.[3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Karakachan_dog",
  "title": "Karakachan dog - Wikipedia",
  "paragraph": "The Karakachan dog is a breed that originated from Bulgaria. It is related to the livestock guardian dogs of the surrounding countries: Romania to the north, North Macedonia and Serbia to the west, and Greece and Turkey to the south.[1] The dog is named after the Karakachans, Greek nomadic shepherds. Due to their conservative stock-breeding traditions, they have preserved some of the oldest breeds of domestic animals in Europe: the Karakachan sheep, Karakachan horse and the Karakachan dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Karelian_Bear_Dog",
  "title": "Karelian Bear Dog - Wikipedia",
  "paragraph": "The Karelian Bear Dog (Karjalankarhukoira) is a Finnish breed of dog. In its home country, it is seen by many as a national treasure. Karelian Bear Dogs will hunt a variety of animals. Its quick reflexes and fearless nature have made it very popular for hunting large game including brown bears, moose, and wild boar. It was the breed's ability to hunt bears that earned the breed its name. The Karelian Bear Dog is among the top 10 most common dog breeds in Finland. [1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kars_dog",
  "title": "Kars dog - Wikipedia",
  "paragraph": "The Kars, known as the Kars Köpeği  in Turkish, is a breed of livestock guardian dog from eastern Turkey.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Karst_Shepherd",
  "title": "Karst Shepherd - Wikipedia",
  "paragraph": "The Karst Shepherd (Slovene: kraški ovčar listen (help·info) or kraševec listen (help·info)) is a breed of dog of the livestock guardian type, originating in Slovenia.[1][2] This breed is recognised by the Fédération Cynologique Internationale.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Keeshond",
  "title": "Keeshond - Wikipedia",
  "paragraph": "The Keeshond (/ˈkeɪshɒnd/ KAYSS-hond, plur. Keeshonden) is a medium-sized dog with a plush, two-layer coat of silver and black fur with a ruff and a curled tail. The Keeshond is descended from ancient Arctic dogs. Their closest relatives are the German spitzes such as the Großspitz (Large Spitz), Mittelspitz (Medium Spitz), Kleinspitz (Miniature Spitz), Zwergspitz (Dwarf-Spitz) or Pomeranian.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kerry_Beagle",
  "title": "Kerry Beagle - Wikipedia",
  "paragraph": "The Kerry Beagle (Irish: An Pocadán Ciarraíoch) is the only extant scent hound breed native to Ireland.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kerry_Blue_Terrier",
  "title": "Kerry Blue Terrier - Wikipedia",
  "paragraph": "The Kerry Blue Terrier (also known as the Irish Blue Terrier) (Irish: An Brocaire Gorm) is a breed of dog.[1] Originally bred to control vermin including rats, rabbits, badgers, foxes, otters and hares, over time the Kerry became a general working dog used for a variety of jobs including herding cattle and sheep, and as a guard dog. Today the Kerry has spread around the world as a companion and working dog. Despite a Kerry Blue winning Crufts (the most prestigious UK dog show) in 2000,[2] it remains an \"unfashionable\" breed,[3] and is distinctly uncommon; however, it is not as threatened as some of the other terrier breeds such as the Skye Terrier, Sealyham Terrier, and Dandie Dinmont Terrier.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/King_Charles_Spaniel",
  "title": "King Charles Spaniel - Wikipedia",
  "paragraph": "The King Charles Spaniel (also known as the English Toy Spaniel) is a small dog breed of the spaniel type. In 1903, the Kennel Club combined four separate toy spaniel breeds under this single title. The other varieties merged into this breed were the Blenheim, Ruby and Prince Charles Spaniels, each of which contributed one of the four colours available in the breed.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/King_Shepherd",
  "title": "German Shepherd - Wikipedia",
  "paragraph": "The German Shepherd[a] is a German breed of working dog of medium to large size. The breed was developed by Max von Stephanitz using various traditional German herding dogs from 1899.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kintamani_(dog)",
  "title": "Kintamani (dog) - Wikipedia",
  "paragraph": "The Kintamani (Indonesian: anjing kintamani) or the Kintamani-Bali Dog[1] is a dog native to the Indonesian island of Bali and originated from the Kintamani region. It is a popular pet for the Balinese and locally Bali's only official breed. The breed was developed from free-roaming local Bali street dogs and was recognised by the FCI in 2019.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kishu",
  "title": "Kishu - Wikipedia",
  "paragraph": "The Kishu (紀州犬, Kishū-Ken), sometimes called Kishu Inu or Kishu dog, is a Japanese breed of dog. It is descended from ancient medium-sized breeds and named after the Kishu region, now Mie Prefecture and Wakayama Prefecture. It was designated a living national monument of Japan in 1934.[1] Kishu have been prized since prehistoric times for boar and deer hunting.[1][2] Like the Shiba, they are often quiet. Kishu will stalk prey quietly rather than bark.[1] They are the most commonly used purebred native Japanese breed used for hunting boar to this day.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kokoni",
  "title": "Kokoni - Wikipedia",
  "paragraph": "The Kokoni (Greek: Κοκόνι) is a small domestic dog breed from Greece, only recently established as a standardized breed.  The foundation stock, a general landrace of small dogs of the region, are widely found throughout the country.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kombai_(dog)",
  "title": "Kombai dog - Wikipedia",
  "paragraph": "The Kombai or Polygar dog is a breed of working dog native to Tamil Nadu in Southern India.[1] Traditionally kept for guarding and protection, they have a reputation for making excellent guard dogs. They were also occasionally used for hunting big games.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Komondor",
  "title": "Komondor - Wikipedia",
  "paragraph": "The Komondor (/ˈkɒməndɔːr, ˈkoʊm-/[1]), also known as the Hungarian sheepdog, is a large, white-coloured Hungarian breed of livestock guardian dog with a long, corded coat.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kooikerhondje",
  "title": "Kooikerhondje - Wikipedia",
  "paragraph": "The Kooikerhondje (Dutch for \"Duck catcher's small dog\") is a small spaniel-type breed of dog of Dutch ancestry that was originally used as a working dog, particularly in an eendenkooi (duck decoy) to lure ducks.  Kooikers were popular in the 17th and 18th century and appear in the paintings of Rembrandt and Jan Steen. The breed is gaining popularity in the United States, Canada and Scandinavia, where it is still relatively unknown.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Koolie",
  "title": "Koolie - Wikipedia",
  "paragraph": "The Koolie (also known as the Australian Koolie or by the historic misnomer \"German Coolie\") is an Australian dog breed. The Koolie is a working or herding dog which has existed in Australia since the early 19th century when it was bred from imported British working dogs. Robert Kaleski, in an article on Cattle Dogs in the August 1903 issue of the Agricultural Gazette of New South Wales, describes the \"Welsh heeler or merle, erroneously known as the German collie,\" as a \"blue-gray dog about the size and build of a smooth-haired collie, generally with wall eyes.\"  The British background predominated in the dogs that came to be associated with the \"German collie\" name.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Koyun_dog",
  "title": "Rize Koyun - Wikipedia",
  "paragraph": "The Rize Koyan is a breed of livestock guardian dog from north Black Sea shore in Turkey.[1] \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kromfohrl%C3%A4nder",
  "title": "Kromfohrländer - Wikipedia",
  "paragraph": "The Kromfohrländer (/ˈkroʊmfərlændər/ KROHM-fər-land-ər) commonly known as Kromi is a breed of dog that originated in Germany.[1] It is used as a companion dog. Particularly long lived, reaching 17-18 years old regularly.[2] Very attached to their owners, often being described as a \"one-person dog\".[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kuchi_dog",
  "title": "Kuchi dog - Wikipedia",
  "paragraph": "The Kuchi Dog, also known as the Afghan Shepherd, is an Afghan livestock guardian dog, taking its name from the Kuchi people of Afghanistan.[1] It is a working dog following the nomads, protecting caravans and flocks of sheep, goats, camels and other livestock from wolves, big cats and thieves. \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kunming_dog",
  "title": "Kunming dog - Wikipedia",
  "paragraph": "The Kunming dog, Chinese Kunming Dog, Kunming Wolfdog, or Chinese Kunming Wolfdog (Mandarin: 昆明犬 Kūnmíng quǎn) is a wolf-dog breed of working dog developed in Kunming, China in the 1950s from Alsatians hybridized with local dogs; even wolf–dog hybrids. It was recognized as a breed in 2007. It is frequently used by the police and military in its country of origin and has been exported to various other countries.[1] It is the only working dog breed developed in China with international recognition. [2] It has a yellow and black coat.[3]\nThe Kumming Dog is also used to perform many duties. These include, but are not limited to, discovering odors emitted by narcotics and explosives, uncovering human remains, and saving people. Male Kumming dogs are usually 60-75 cm in height and female Kumming dogs average a height of 60-65 cm in height making them slightly smaller.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kurdish_Mastiff",
  "title": "Kurdish Mastiff - Wikipedia",
  "paragraph": "The Kurdish Mastiff,[1][2][3][4] Assyrian Shepherd,[3] or Pishdar dog[5] (Kurdish: سەگی پشدەری) is a dog landrace native to the mountainous Kurdistan Region in Iraq.[3][5] This dog is often used as a livestock guardian against predators and number around a few thousand heads.[5] They have been compared to the Kangal Dog and the Akbash.[5] \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kuvasz",
  "title": "Kuvasz - Wikipedia",
  "paragraph": "The Kuvasz[a] is a traditional Hungarian breed of flock guardian dog. Mention of the breed can be found in old Hungarian texts. They have historically been royal guard dogs, or guarded livestock, but have been increasingly found in homes as pets over the last seventy years. The American Kennel Club includes the breed in the working dog group.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Labrador_Retriever",
  "title": "Labrador Retriever - Wikipedia",
  "paragraph": "The Labrador Retriever or simply Labrador, is a British breed of retriever gun dog. It was developed in the United Kingdom from fishing dogs imported from the colony of Newfoundland (now a province of Canada), and was named after the Labrador region of that colony. It is among the most commonly kept dogs in several countries, particularly in the Western world.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Lagotto_Romagnolo",
  "title": "Lagotto Romagnolo - Wikipedia",
  "paragraph": "The Lagotto Romagnolo[a] is an Italian breed of dog. It originates in the marshlands of the Delta del Po in the eastern part of the Romagna sub-region of Italy. The name derives from Romagnol can lagòt, meaning \"water dog\".[2] Its traditional function was as a gun dog, specifically a water retriever; since the drainage of large areas of wetland habitat in its area of origin, it is now more often used to hunt for truffles.[3][1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Lakeland_Terrier",
  "title": "Lakeland Terrier - Wikipedia",
  "paragraph": "The Lakeland Terrier is a dog breed, which takes its name from its place of origin,[1] the Lake District  in England. The dog is a small to mid-size member of the Terrier family. While independent in personality, it interacts well with owners and all family members,[2] and is mostly hypo-allergenic (non shedding).[3] In the United Kingdom, the Lakeland Terrier is considered a vulnerable dog breed at risk of going extinct through low levels of breeding, according to The Kennel Club.[4] In the United States, the Lakeland Terrier ranked 148 out of 193 breeds by number of American Kennel Club puppy registrations in 2019.[5] \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Lancashire_Heeler",
  "title": "Lancashire Heeler - Wikipedia",
  "paragraph": "The Lancashire Heeler is a small breed of dog developed for use as a drover and herder of cattle. The Lancashire Heeler is listed by the Kennel Club (UK) as an endangered breed.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Landseer_(dog)",
  "title": "Landseer dog - Wikipedia",
  "paragraph": "The Landseer is a dog that originated in Canada. It is a black-and-white variety of the Newfoundland that is recognised as an independent breed in continental Europe.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Lapponian_Herder",
  "title": "Lapponian Herder - Wikipedia",
  "paragraph": "The Lapponian Herder (Lapinporokoira or Lapp Reindeer Dog or Lapsk Vallhund) is a breed of dog from Finland, one of three Lapphund breeds developed from a type of dog used by the Sami people for herding and guarding their reindeer.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Large_M%C3%BCnsterl%C3%A4nder",
  "title": "Large Münsterländer - Wikipedia",
  "paragraph": "The Large Münsterländer (or Großer Münsterländer) is a breed of gun dog originally from the Münster region in Germany.[1][2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Leonberger",
  "title": "Leonberger - Wikipedia",
  "paragraph": "The Leonberger is a dog breed, whose name derives from the city of Leonberg in Baden-Württemberg, Germany.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Levriero_Sardo",
  "title": "Levriero Sardo - Wikipedia",
  "paragraph": "  The Levriero Sardo (Sardinian: Cani de lèpori) is a very rare breed of dog originating in Sardinia. Few specimens exist, but some Sardinian breeders are dedicated to the breed.[1] Locally, the breed is also called vertreddru, which roughly translates to \"little hunting dog.\"[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Lhasa_Apso",
  "title": "Lhasa Apso - Wikipedia",
  "paragraph": "The Lhasa Apso (/ˈlɑːsə ˈæpsoʊ/ LAH-sə AP-soh) is a non-sporting dog breed originating in Tibet.[3] It has traditionally been used as an interior sentinel.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Liangshan_Dog",
  "title": "Liangshan Dog - Wikipedia",
  "paragraph": "The Liangshan Dog (Chinese: 凉山犬) is a medium-sized semi-feral scenthound originally bred by the Yi people of Liangshan Yi Prefecture in Sichuan province, China.[1] Liangshan dogs are prized for their tracking ability, endurance and ferocity while hunting wild boar in mountainous terrain.[2] Liangshan dogs hunt a variety of prey at variable altitudes and climates and are often deliberately underfed to improve drive to be successful.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Lithuanian_Hound",
  "title": "Lithuanian Hound - Wikipedia",
  "paragraph": "The Lithuanian Hound (Lithuanian: Lietuvių skalikas) is a rare, medium-size hunting dog from Lithuania. It is the only dog breed originating from Lithuania and dates back to the medieval Grand Duchy of Lithuania.[3] However, the breed is not recognized by the Fédération Cynologique Internationale (FCI).[4]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Lobito_Herre%C3%B1o",
  "title": "Lobito Herreño - Wikipedia",
  "paragraph": "The Lobito Herreño or Perro de Pastor Herreño is a Spanish breed or type of pastoral dog. It is found mostly on the island of El Hierro in the Canary Islands, but also on Gran Canaria, La Palma and Tenerife.[1] It is not recognised as breed by the Real Sociedad Canina de España, but in 2021 was one of three breeds or types listed as a grupo étnico canino,[2] which the society defines as a regional dog population with consistent form and function evolved through functional selection.[3] The other two dogs in this group are the Podenco Orito Español and the Carea Castellano-Manchego.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/L%C3%B6wchen",
  "title": "Löwchen - Wikipedia",
  "paragraph": "The Löwchen or  Little Lion Dog (German: Löwchen, \"little lion\"; French: Petit chien lion, \"little lion dog\") is a breed of small dog. The Löwchen once had the dubious distinction, like the Portuguese Water Dog and the Havanese, of being the rarest dog in the world. In 1973 there were only 65 registered examples of the breed.[3] Even today, the breed generally has fewer than a few hundred new registrations each year worldwide.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Lupo_Italiano",
  "title": "Lupo Italiano - Wikipedia",
  "paragraph": "The Lupo Italiano is a dog breed from Italy. According to its creator, the breed's foundation was a wolf hybrid produced from crossing a German Shepherd and an Italian wolf, though a number of genetic studies put this in doubt.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Mackenzie_River_husky",
  "title": "Mackenzie River husky - Wikipedia",
  "paragraph": "Mackenzie River husky[1] describes several overlapping historical populations of Arctic and sub-Arctic sled dog originally bred to support fur traders for Hudson’s Bay Company and later prospectors during the Klondike Gold Rush. A mixture of native sled dogs and European freighting dogs, Mackenzie River huskies were prized for their ability to haul heavy loads long distances in the snow with minimal care.[2]  Since the advent of modern mechanized travel in the Arctic, moving cargo by dogsled has become nearly obsolete and only small populations of these dogs still exist.[3] \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Magyar_ag%C3%A1r",
  "title": "Magyar Agár - Wikipedia",
  "paragraph": "The Magyar agár (MA) is a dog breed. It is a type of sighthound originating in Hungary and lands that previously belonged to the Austro-Hungarian Empire (such as Transylvania). It is used for hunting and coursing, and is also kept as a companion.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Mahratta_Greyhound",
  "title": "Mahratta Hound - Wikipedia",
  "paragraph": "The Mahratta Hound, sometimes called the Mahratta Greyhound, is a breed of dog found in India.[1][2][3] It is a sighthound, and like the Banjara Hound it is bred and used for hunting by the nomadic Banjara of Maharashtra.[2][3] The Mahratta Hound is believed to be of Arabian or Persian heritage, is often blue and tan in colour and stands around 22 inches (56 cm). It is prized for its prowess in hunting panther and boar, both very formidable prey for a hound, as well as blackbuck.[3][4]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Maltese_(dog)",
  "title": "Maltese dog - Wikipedia",
  "paragraph": "Maltese dog refers both to an ancient variety of dwarf canine from Italy[1] and generally associated also with the island of Malta, and to a modern breed of dog in the toy group. The contemporary variety is genetically related to the Bichon, Bolognese, and Havanese breeds.[3] The precise link, if any, between the modern and ancient species is not known. Nicholas Cutillo suggested that Maltese dogs might descend from spitz-type canines, and that the ancient variety probably was similar to the latter Pomeranian breeds with their short snout, pricked ears, and bulbous heads.[4][5] These two varieties, according to Stanley Coren, were perhaps the first dogs employed as human companions.[6]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Manchester_Terrier",
  "title": "Manchester Terrier - Wikipedia",
  "paragraph": "The Manchester Terrier is a breed of dog of the smooth-haired terrier type. It was first bred in the 19th century to control vermin, notably rats, at which it excelled. So efficient at the task was it that it often appeared in rat-baiting pits until that sport, which had effectively been illegal in the UK since 1835, finally died out at the beginning of the 20th century.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Maneto",
  "title": "Maneto - Wikipedia",
  "paragraph": "The Maneto is a dog breed native to Andalusia in Spain. It is derived from the medium-sized Andalusian Hound, and is used to hunt rabbits, partridge, quail, and for retrieving ducks from the water. Its legs are short relative to its body, and its ears are triangular and blunt.[1] The breed is recognised by the name Maneto by the Real Sociedad Canina de España. The word \"maneto\" in Spanish indicates an impediment or defect in any of the hands or legs.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Maremmano-Abruzzese_Sheepdog",
  "title": "Maremmano-Abruzzese Sheepdog - Wikipedia",
  "paragraph": "The Maremmano-Abruzzese Sheepdog, Italian: .mw-parser-output .noitalic{font-style:normal}Cane da pastore Maremmano-Abruzzese, also called Maremmano,  Maremma Sheepdog, or Abruzzese Sheepdog, is an Italian breed of livestock guardian dog. It is indigenous to Central Italy, especially to the Maremma region of Tuscany and Lazio, and to some northern areas of Southern Italy, particularly to Abruzzo. It has been used for centuries by Italian shepherds to guard sheep from wolves. The \"Maremmano\" name derives from that of the Maremma marshlands where, until recently, shepherds, dogs and hundreds of thousands of sheep over-wintered,[2]: 33  and where the dogs are still abundant although sheep-farming has decreased substantially. However, the breed is still widely employed in and closely culturally associated with the nearby region of Abruzzo, where sheep herding remains vital to the rural economy and the wolf (specifically the Apennine wolf) remains an active and protected predator.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/McNab_dog",
  "title": "McNab dog - Wikipedia",
  "paragraph": "The McNab Dog, also called the McNab Shepherd or McNab Collie is a herding dog that originated in Hopland, Mendocino County, Northern California.  The McNab was bred to withstand the tough conditions found in California such as heat, burrs, foxtails, and rugged terrain. Until recently, the McNab was little known outside California, but in last three decades have seen a gain in popularity and geographic dispersal of the breed.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Miniature_American_Shepherd",
  "title": "Miniature American Shepherd - Wikipedia",
  "paragraph": "The Miniature American Shepherd, frequently abbreviated MAS, is a small herding dog breed. The MAS is highly intelligent and biddable. The breed is often trained for dog sports such as herding, agility, obedience, canine freestyle, flyball, and others. The Miniature American Shepherd was recognised by the American Kennel Club (AKC) in 2015 and is the club's 186th breed.[2] In September 2019, the Fédération Cynologique Internationale (FCI) officially accepted the breed.[3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Miniature_Bull_Terrier",
  "title": "Miniature Bull Terrier - Wikipedia",
  "paragraph": "The English Miniature Bull Terrier is a breed with origins in the extinct English White Terrier, the Dalmatian and the Bulldog. The first existence is documented in 1872 in The Dogs of British Island.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Miniature_Fox_Terrier",
  "title": "Miniature Fox Terrier - Wikipedia",
  "paragraph": "The Miniature Fox Terrier is a small, fine, lightweight working terrier developed as a hunting dog and vermin router.  It is known colloquially in its native Australia as the “Mini Foxie”.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Miniature_Pinscher",
  "title": "Miniature Pinscher - Wikipedia",
  "paragraph": "The Miniature Pinscher, also known as the Zwergpinscher and Mini Pin, is a small breed of dog of the pinscher type originating in Germany. The breed's earliest ancestors may have included the German Pinscher mixed with Italian greyhounds and dachshunds.[1][2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Miniature_Schnauzer",
  "title": "Miniature Schnauzer - Wikipedia",
  "paragraph": "The Miniature Schnauzer is a breed of small dog of the Schnauzer type that originated in Germany in the mid-to-late 19th century. Miniature Schnauzers may have been developed from the smallest specimens of the Standard Schnauzer,[3][4] or crosses between the standard and one or more smaller breeds such as the Affenpinscher, Miniature Pinscher, and Poodles,[5][6][7][8] as farmers bred a small dog that was an efficient ratting dog. They are described as \"spunky\"[1] but aloof dogs, with good guarding tendencies without some guard dogs' predisposition to bite. Miniature Schnauzers are recognized in four colors internationally: solid black, black and silver, salt and pepper, and white.[9]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Molossus_of_Epirus",
  "title": "Greek Shepherd - Wikipedia",
  "paragraph": "The Greek Shepherd or Greek Sheepdog (Greek: Ελληνικός Ποιμενικός, Ellinikós Pimenikós) is a breed of livestock guardian dog from Greece. Thought to be ancient in origin, the Greek Shepherd is very closely related to livestock guardian dog breeds from neighbouring countries; it is believed that some dogs are simultaneously claimed to be other breeds as they migrate annually across national borders with the flocks they protect in search seasonal pastures.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Mongrel",
  "title": "Mongrel - Wikipedia",
  "paragraph": "A mongrel, mutt or mixed-breed dog is a dog that does not belong to one officially recognized breed and including those that are the result of intentional breeding. Although the term mixed-breed dog is sometimes preferred, many mongrels have no known purebred ancestors. Crossbreed dogs, and \"designer dogs\", while also a mix of breeds, differ from mongrels in being intentionally bred. At other times, the word mongrel has been applied to informally purpose-bred dogs such as curs, which were created at least in part from mongrels, especially if the breed is not officially recognized.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Montenegrin_Mountain_Hound",
  "title": "Montenegrin Mountain Hound - Wikipedia",
  "paragraph": "The Montenegrin Mountain Hound (Serbo-Croatian: crnogorski planinski gonič / црногорски планински гонич) is a rare dog breed from the mountain regions across the Balkans. Black and tan, with a smooth coat, the Montenegrin Mountain Hound was called Black Hound in the past. The breed is of the same origin as the other Balkan hounds. It stands 18 to 22 inches (46 to 56 cm) high and weighs 44 to 55 pounds (20 to 25 kg). The breed is used to hunt fox, hare, and small game, occasionally hunting larger animals such as deer or even wild boar.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Mountain_Cur",
  "title": "Mountain Cur - Wikipedia",
  "paragraph": "The Mountain Cur is a type of working dog that is bred specifically for treeing and trailing small game, like squirrel and raccoons. They are also used for hunting and baying big game like bear and wild boar as well as being an all-purpose farm dog. Curs are a member of the Hound group, and the Mountain Cur is one of several varieties of cur. It can also be used as a water dog. Mainly bred in Ohio, Kentucky, Virginia, and Tennessee, it has been registered with the United Kennel Club since 1998. The Mountain Cur Breeders' Association was formed in 1957.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Mountain_Feist",
  "title": "Treeing Feist - Wikipedia",
  "paragraph": "The Treeing Feist is a  breed of feist from the Southeastern United States. Originally considered a single breed, the Mountain Feist is now considered a separate breed with both being separately recognized by the United Kennel Club.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Mudhol_Hound",
  "title": "Mudhol Hound - Wikipedia",
  "paragraph": "The Mudhol Hound, also known as the Caravan Hound, is a breed of sighthound from India.[1][2][3][4][5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Mudi",
  "title": "Mudi - Wikipedia",
  "paragraph": "The Mudi is a herding dog breed from Hungary. It is closely related to the Puli and Pumi, from which it was separated in the 1930s. They continue to be used in herding, as well as participating in a variety of dog sports.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Neapolitan_Mastiff",
  "title": "Neapolitan Mastiff - Wikipedia",
  "paragraph": "The Neapolitan Mastiff or Mastino Napoletano is an Italian breed of large dog of mastiff type. It descends from the traditional guard dogs of central Italy.[1] It was recognised as a breed by the Ente Nazionale della Cinofilia Italiana in 1949,[2] and accepted by the Fédération Cynologique Internationale in 1956.[3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Nenets_Herding_Laika",
  "title": "Nenets Herding Laika - Wikipedia",
  "paragraph": "The Nenets Herding Laika (Russian: Ненецкая лайка) also known as the reindeer spitz, is an aboriginal spitz landrace of dog originating from the Yamalo-Nenets Autonomous Okrug, in Russia. Unlike other laikas, Nenets Herding Laika are less commonly used for hunting.  Instead they have been selected primarily for reindeer herding ability, originally by the Nenets people, and later by reindeer herders through Russia.[1][2][3]  Nenets herding laika are thought to be the progenitor of several modern breeds, the most well-documented being the Samoyed.[1] Despite this, the breed almost died out during the Soviet era due to lack of interest in preserving genetically purebred examples.[3][4] In 1994, the Russian Kynologic Federation (RKF) approved the first official standard of the breed.[4][5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/New_Guinea_singing_dog",
  "title": "New Guinea singing dog - Wikipedia",
  "paragraph": "The New Guinea singing dog or New Guinea Highland dog[1] is an ancient (basal)[a] lineage of dog[3][4][5] found in the New Guinea Highlands, on the island of New Guinea. Once considered to be a separate species in its own right, under the name Canis hallstromi, it is closely related to the Australian dingo. The dog is unique among canines, as it is one of the few to be considered \"barkless\" (hence its common name of \"singing dog\"), and known for its unusual \"yodel\"-like style of vocalizing. \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/New_Zealand_Heading_Dog",
  "title": "New Zealand Heading Dog - Wikipedia",
  "paragraph": "The New Zealand Heading Dog is a working and herding dog that uses its visual prowess, intelligence and quick movement to control sheep. Bred from Border Collies, Heading Dogs are a sturdy, long-legged and even-haired breed. They are generally black and white in color, but may also be tan.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Newfoundland_(dog)",
  "title": "Newfoundland dog - Wikipedia",
  "paragraph": "The Newfoundland is a large breed of working dog. They can be black, grey, brown, or black and white. However, in the Dominion of Newfoundland, before it became part of the confederation of Canada, only black and Landseer (white-and-black) coloured dogs were considered to be proper members of the breed.[2] They were originally bred and used as working dogs for fishermen in Newfoundland.[3][4] Newfoundlands are known for their giant size, intelligence, tremendous strength, calm disposition, love of children and loyalty. They excel at water rescue/lifesaving because of their muscular build, thick double coat, webbed paws, and swimming abilities.[5][6][7]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Norfolk_Terrier",
  "title": "Norfolk Terrier - Wikipedia",
  "paragraph": "The Norfolk Terrier is a British breed of dog. Prior to gaining recognition as an independent breed in 1964,[1] it was a variety of the Norwich Terrier, distinguished from the \"prick eared\" Norwich by its \"drop ears\" (or folded ears). Together, the Norfolk and Norwich Terriers are the smallest of the working terriers.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Norrbottenspets",
  "title": "Norrbottenspets - Wikipedia",
  "paragraph": "The Norrbottenspets, also known as the Norrbottenspitz, the Nordic Spitz and the Pohjanpystykorva, is a breed of spitz type dog from Sweden. A small- to medium-sized breed with typical spitz-like features, the Norrbottenspets has traditionally been kept as a hunting dog in Northern Sweden and is closely related to similar Nordic spitz breeds such as the Finnish Spitz.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Northern_Inuit_Dog",
  "title": "Northern Inuit Dog - Wikipedia",
  "paragraph": "The Northern Inuit Dog, along with its offshoot breed lines the Tamaskan dog, the British Timber dog and the Utonagan, is a breed of dog developed from a 1980s breeding project in the United Kingdom with the objective of producing a dog breed that resembles wolves.[1][2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Norwegian_Buhund",
  "title": "Norwegian Buhund - Wikipedia",
  "paragraph": "The Norwegian Buhund (Norwegian: Norsk buhund) is a breed of dog of the spitz type. It is closely related to the Icelandic Sheepdog and the Jämthund. The Buhund is used as a watch dog and an all purpose farm and herding dog.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Norwegian_Elkhound",
  "title": "Norwegian Elkhound - Wikipedia",
  "paragraph": "The Norwegian Elkhound is one of the Northern Spitz-type breeds of dog and is the National Dog of Norway. The Elkhound has served as a hunter, guardian, herder, and defender. It is known for its courage in tracking and hunting elk and other large game, such as bears or wolves.[1][2] The Norwegian Elkhound was first presented at a dog exhibition in Norway in 1877.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Norwegian_Lundehund",
  "title": "Norwegian Lundehund - Wikipedia",
  "paragraph": "The Norwegian Lundehund (Norwegian: Norsk lundehund) is a small dog breed of the Spitz type that originates from Norway. Its name is a compound noun composed of the elements lunde, meaning puffin (Norwegian lunde, \"puffin\", or lundefugl, \"puffin bird\"), and hund, meaning dog. The breed was originally developed for the hunting of puffins and their eggs on inaccessible nesting places in caves and on cliffs.  The breed was at the brink of extinction in the 1960s and preservation efforts have since been underway.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Norwich_Terrier",
  "title": "Norwich Terrier - Wikipedia",
  "paragraph": "The Norwich Terrier is a breed of dog originating in the United Kingdom, and was bred to hunt small rodents. With a friendly personality, Norwich Terriers are today mostly a companion dog breed. One of the smallest terriers, these dogs are generally healthy, but are relatively rare, due in part to their low litter size and the common need for caesarian sections. Their drop-eared variety is the Norfolk Terrier. \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Nova_Scotia_Duck_Tolling_Retriever",
  "title": "Nova Scotia Duck Tolling Retriever - Wikipedia",
  "paragraph": "The Nova Scotia Duck Tolling Retriever is a medium-sized gundog bred primarily for hunting. It is often referred to as a \"toller\". It is the smallest of the retrievers, and is often mistaken for a small Golden Retriever. Tollers are intelligent, eager to please, alert, and energetic.[1] The name \"toller\" is derived from their ability to lure waterfowl within gunshot range. The breed originated in Yarmouth County, Nova Scotia, Canada.[2] The American Kennel Club ranks the toller as the 87th most popular dog breed.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Old_Danish_Pointer",
  "title": "Old Danish Pointer - Wikipedia",
  "paragraph": "The Old Danish Pointer is a medium-sized  breed of dog, white with brown markings, originally used as a pointing dog in Denmark.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Old_English_Sheepdog",
  "title": "Old English Sheepdog - Wikipedia",
  "paragraph": "The Old English Sheepdog is a large breed of dog that emerged in England from early types of herding dog. Obsolete names for the breed include Shepherd's Dog[1] and bob-tailed sheep-dog.[2] The nickname Bob-tail (or Bobtail) originates from how dogs of the breed traditionally had their tails docked. Old English Sheepdogs can grow very long coats with fur covering the face and eyes and do not shed unless brushed.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Old_English_Terrier",
  "title": "Black and Tan Terrier - Wikipedia",
  "paragraph": "The Black and Tan Terrier was a broad breed or type of terrier that was one of the earliest terrier breeds. Although it is now extinct, it is believed to be the ancestor of all modern Fell Terrier breeds and the Welsh Terrier, a breed recognised by The Kennel Club.[citation needed]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Olde_English_Bulldogge",
  "title": "Olde English Bulldogge - Wikipedia",
  "paragraph": "The Olde English Bulldogge is an American dog breed, recognized by the United Kennel Club (UKC) in January 2014.  The breed is listed in the UKC Guardian Dog Group.[1]  Five years prior to UKC recognition, the breed was registered by the former Canine Developmental, Health and Performance Registry (CDHPR), a privately held business located in Kalamazoo, Michigan. In the early 2000s, CDHPR had been working with the UKC under a unique agreement to develop breeding plans and strategies in an effort to produce improved breeds of dogs that would be accepted as purebred and, therefore, eligible for UKC registration.[2] \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Otterhound",
  "title": "Otterhound - Wikipedia",
  "paragraph": "The Otterhound is a British dog breed. It is a scent hound and is currently recognised by the Kennel Club as a Vulnerable Native Breed with around 600 animals worldwide.[1][2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pachon_Navarro",
  "title": "Pachón Navarro - Wikipedia",
  "paragraph": "The Pachón Navarro[a] is a Spanish breed of hunting dog from the autonomous community of Navarre, in northern Spain. It is one of five Basque breeds of dog, the others being the Basque Shepherd Dog, the Erbi Txakur, the Villano de Las Encartaciones and the Villanuco de Las Encartaciones.[2][3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pampas_Deerhound",
  "title": "Pampas Deerhound - Wikipedia",
  "paragraph": "Pampas Deerhound (Portuguese: Veadeiro pampeano) is a Brazilian breed of hunting dog; it is also found in Argentina and Uruguay. It is common in Brazil, where it was first recognized by a national kennel club.[1] The dogs were used to track, capture, and hunt deer (pampas deer), and thus earned the name Pampas Deerhound (in Brazilian Portuguese \"Veadeiro pampeano\": veadeiro = deer-hound; pampeano = those who came from the pampas). It is still a widely preferred hunting companion to track other animals, such as wild boars.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Papillon_(dog)",
  "title": "Papillon dog - Wikipedia",
  "paragraph": "The Papillon (French pronunciation: ​[papijɔ̃], French for 'butterfly[-eared]'), also called the Continental Toy Spaniel, is a breed of dog, of the spaniel type. One of the oldest of the toy spaniels, it derives its name from its characteristic butterfly-like look of the long and fringed hair on the ears. A Papillon with dropped ears is called a Phalene.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Parson_Russell_Terrier",
  "title": "Parson Russell Terrier - Wikipedia",
  "paragraph": "The Parson Russell Terrier is a breed of small white terrier that was the original Fox Terrier of the 18th century. The breed is named after the Reverend Jack Russell, credited with the creation of this type of dog. It is the recognised conformation show variety of the Jack Russell Terrier and was first recognised in 1990 in the United Kingdom as the Parson Jack Russell Terrier. In America, it was first recognised as the Jack Russell Terrier in 1997. The name was changed to its current form in 1999 in the UK and by 2008 all international kennel clubs recognised it under the new name.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pastore_della_Lessinia_e_del_Lagorai",
  "title": "Pastore della Lessinia e del Lagorai - Wikipedia",
  "paragraph": "The Pastore della Lessinia e del Lagorai (English: Lessinia and Lagorai Shepherd) is an old Italian dog breed from the northeastern region called Triveneto. It is not recognized by any major kennel organisation.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Patagonian_Sheepdog",
  "title": "Patagonian Sheepdog - Wikipedia",
  "paragraph": "The Patagonian Sheepdog or Spanish: Ovejero Magallánico is a Chilean breed of sheepdog. It was bred in the late nineteenth and early twentieth centuries for sheep-herding work in the Magallanes y la Antártica Chilena Region of the southern part of Chilean Patagonia.[1] It has a long rough coat and is well adapted to the harsh climate of the area. The Kennel Club de Chile publishes a breed standard.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Patterdale_Terrier",
  "title": "Patterdale Terrier - Wikipedia",
  "paragraph": "The Patterdale Terrier is a breed of dog descended from the Northern terrier breeds of the early 18th century.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pekingese",
  "title": "Pekingese - Wikipedia",
  "paragraph": "The Pekingese (also spelled Pekinese) is a breed of toy dog, originating in China. The breed was favored by royalty of the Chinese Imperial court as a companion dog, and its name refers to the city of Peking (Beijing) where the Forbidden City is located. The breed has several characteristics and health issues related to its unique appearance. Because of its desirable characteristics, the Pekingese has been part of the development of designer crossbreeds, such as the Peekapoo (crossed with a poodle) and Peke-a-tese (crossed with a Maltese).\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pembroke_Welsh_Corgi",
  "title": "Pembroke Welsh Corgi - Wikipedia",
  "paragraph": "The Pembroke Welsh Corgi (/ˈkɔːrɡi/; Welsh for \"dwarf dog\"[a]) is a cattle herding dog breed that originated in Pembrokeshire, Wales.[1] It is one of two breeds known as a Welsh Corgi, the other being the Cardigan Welsh Corgi. Pembroke Welsh Corgis descended from the Spitz family of dogs.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Perro_Majorero",
  "title": "Perro Majorero - Wikipedia",
  "paragraph": "The Perro Majorero (English: Majorero dog) is a Spanish breed from the Canary Islands. Traditionally, it has been used as a cattle dog and guard dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Majorca_Shepherd_Dog",
  "title": "Majorca Shepherd Dog - Wikipedia",
  "paragraph": "The Majorca Shepherd Dog (Catalan: Ca de bestiar, Spanish: Perro de pastor mallorquín) is a domesticated breed of dog,[1] used in the Balearic Islands of Spain, both for guarding and herding sheep and as a general purpose farm dog.[2] It is a medium-sized dog with black fur or black with white markings on its chest.  It comes in both shorthaired and longhaired varieties.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Perro_de_Presa_Canario",
  "title": "Presa Canario - Wikipedia",
  "paragraph": "The Presa Canario is a Spanish breed of large dog of mastiff or catch dog type. It originates in the autonomous region of the Canary Islands, and is found mostly in the islands of Gran Canaria and Tenerife.[2]: 587  It was formerly known as the Dogo Canario. It was traditionally used as a guard dog, as a herding dog for both sheep and cattle, and for dog-fighting, which was legal in Spain until 1936 and may have continued clandestinely thereafter.[2]: 587 \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Ca_de_Bou",
  "title": "Ca de Bou - Wikipedia",
  "paragraph": "The Ca de Bou, also known as the Perro de Presa Mallorquin, Mallorca Mastiff or the Majorcan Bulldog, is a breed of bulldog type dogs from Majorca, the largest of the Balearic Islands.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Peruvian_Hairless_Dog",
  "title": "Peruvian Hairless Dog - Wikipedia",
  "paragraph": "The Peruvian Hairless Dog,[1] Peruvian viringo,[2] naked dog, or Chimú dog is one of several breeds of hairless dog. It is native to Peru and it is usually raised as a pet. It has been officially recognized as part of Peru's cultural heritage.[3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Petit_Basset_Griffon_Vend%C3%A9en",
  "title": "Petit Basset Griffon Vendéen - Wikipedia",
  "paragraph": "The Petit Basset Griffon Vendéen (/pɛˌtiː bæˌseɪ ɡrɪˌfɒn vɑːndeɪˈɑːn/), or PBGV, is a breed of dog of the scent hound type, bred to trail hares in bramble-filled terrain of the Vendée district of France. The breed is known in the United States as \"Petit\" or \"PBGV,\" in England as \"Roughie,\" and in Denmark as \"Griffon\" or \"Petit\". The PBGV is one of six types of \"basset\"-type breeds recognised by the Fédération Cynologique Internationale (FCI). [1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Petit_Bleu_de_Gascogne",
  "title": "Petit Bleu de Gascogne - Wikipedia",
  "paragraph": "The Petit Bleu de Gascogne is a breed of dog of the scenthound type, originating in France and used for hunting in packs. Today's breed is the descendant of a large hunting dog. The Petit Bleu de Gascogne is not a small (petite) dog, the name comes from its use on small game.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Phal%C3%A8ne",
  "title": "Phalène - Wikipedia",
  "paragraph": "The Phalène (French pronunciation: ​[falɛn], \"moth[-eared]\") is a toy dog breed, the drop eared variety of the Papillon (\"butterfly[-eared]\") dog. Both varieties can occur in the same litter. \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pharaoh_Hound",
  "title": "Pharaoh Hound - Wikipedia",
  "paragraph": "The Pharaoh Hound or Kelb tal-Fenek is a Maltese breed of hunting dog. It is traditionally used for rabbit-hunting in the rocky terrain of the islands; the Maltese name means \"rabbit dog\". \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Phu_Quoc_Ridgeback",
  "title": "Phu Quoc Ridgeback - Wikipedia",
  "paragraph": "The Phu Quoc Ridgeback (Vietnamese: Chó Phú Quốc) is a rare breed of dog from the island of Phú Quốc in Kiên Giang Province in southern Vietnam. It is one of three ridgeback breeds,[1][2] the others being the Rhodesian Ridgeback and the Thai Ridgeback. It is not recognized by the Fédération Cynologique Internationale or any other major club.[1] The Phu Quoc Ridgeback is one of the four native Vietnamese dog breeds, along with the Bắc Hà dog (Chó Bắc Hà), Lài dog (chó lài), Hmong Bobtail Dog (chó H’Mông cộc đuôi).[3][4][5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Picardy_Spaniel",
  "title": "Picardy Spaniel - Wikipedia",
  "paragraph": "The Picardy Spaniel is a breed of dog developed in France for use as a gundog. It is related to the Blue Picardy Spaniel, and still has many similarities, but the Picardy Spaniel is the older of the two breeds. It is thought to be one of the two oldest continental spaniel breeds and was favoured by the French nobility, remaining popular for hunting after the French Revolution due to its weather resistant coat that enabled it to hunt in a variety of conditions and terrain. However its popularity waned following the influx of English hunting breeds in the early 20th century. Slightly smaller than an English Setter but larger than most of its spaniel cousins, it has no major health issues although as with many breeds with pendulous ears, it can be prone to ear infections.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Plummer_Terrier",
  "title": "Plummer Terrier - Wikipedia",
  "paragraph": "The Plummer Terrier is a working terrier. It was originally bred by Brian Plummer to hunt vermin, especially rats. The breed, while unrecognized by any kennel club, is known for its rugged determination and hardiness.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Plott_Hound",
  "title": "Plott Hound - Wikipedia",
  "paragraph": "The Plott Hound is a large scent hound, originally bred for hunting bears. In 1989, the North Carolina General Assembly designated the Plott Hound as the official State Dog.[2][3] The Plott Hound was first registered with the United Kennel Club in 1946. Plott Hounds were recognized by the American Kennel Club in 2006[4] and were exhibited at the Westminster Show in 2008.[5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Podenco_Andaluz",
  "title": "Podenco Andaluz - Wikipedia",
  "paragraph": "The Podenco Andaluz is an ancient Spanish breed of warren hound used to hunt small game in Andalusia, Spain.[1][2] It is one of four podenco breeds recognized by the Real Sociedad Canina de España.[1] It is an agile dog generally used to hunt ducks, rabbits, boar and fowl.[1][3]  There are three accepted sizes (small, medium and large) and three coat types (wire-haired, long-haired and smooth).[2][4][5] \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Podenco_Canario",
  "title": "Podenco Canario - Wikipedia",
  "paragraph": "Podenco Canario (In English: Canary Island Podenco, Canary Island Hound, or Canarian Warren Hound) is a breed of dog from the Canary Islands. The Podenco Canario is still used today, primarily in packs, most often for the sport hunting of rabbits. The word \"podenco\" in Spain refers to a certain type of dog, typically rabbit hunters with the same body shape. \"Canario\" is a reference to its region of origin, the Canary Islands.  The Spanish Kennel Club, Real Sociedad Canina de España, recognises the following similar dog breeds that use the identifier \"podenco\" in their names: Podenco Andaluz, Podenco Ibicenco, and Podenco Valenciano.[1]\nge\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Podenco_Valenciano",
  "title": "Podenco Valenciano - Wikipedia",
  "paragraph": "The Podenco Valenciano or Xarnego Valenciano is a hound breed of dog originating in Valencian Community, Spain. This breed is known by several names, according to the different areas of the Valencian geography: Xarnego, Xarnego Valenciano, Gos coniller, Podenco Valencíano. It was officially recognized by the Real Sociedad Canina de España in 2017.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pointer_(dog_breed)",
  "title": "Pointer (dog breed) - Wikipedia",
  "paragraph": "The Pointer, sometimes called the English Pointer, is a medium-sized breed of pointing dog developed in England. Pointers are used to find game for hunters, and are considered by gundog enthusiasts to be one of the finest breeds of its type; however, unlike most other hunting breeds, its purpose is to point, not retrieve game.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Poitevin_hound",
  "title": "Poitevin hound - Wikipedia",
  "paragraph": "The Poitevin, also known as the Chien de Haut-Poitou, is a breed of French scenthound from the province of Poitou, this predominantly pack hound was created in the 17th century to hunt wolves.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Polish_Greyhound",
  "title": "Polish Greyhound - Wikipedia",
  "paragraph": "The Polish Greyhound (Polish: chart polski, pronounced [xart ˈpɔlskʲi]) is a Polish sighthound breed. It is known as the Polish Greyhound, although it is not a direct relative of the Greyhound dog.[1][2][3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Polish_Hound",
  "title": "Polish Hound - Wikipedia",
  "paragraph": "The Polish Hound, commonly known as Ogar Polski, is a breed of hunting dog indigenous to Poland.[1][2] The Polish Hound has a keen sense of smell. This heightened sense combined with the endurance needed to hunt in harsh environments led to its use in hunting, while its stature made it popular with Polish nobility.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Polish_Lowland_Sheepdog",
  "title": "Polish Lowland Sheepdog - Wikipedia",
  "paragraph": "The Polish Lowland Sheepdog (Polish: Polski Owczarek Nizinny, also PON), is a medium-sized, shaggy-coated, sheep dog breed native to Poland.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Polish_Tatra_Sheepdog",
  "title": "Tatra Shepherd Dog - Wikipedia",
  "paragraph": "The Tatra Shepherd Dog, Polish: Polski Owczarek Podhalański, is a Polish breed of large flock guardian dog originating in the Tatra Mountains of the Podhale region of southern Poland.[1]: 78 [3]: 148  It was fully recognised by the Fédération Cynologique Internationale in 1963.[4] It is one of five dog breeds originating in Poland, the others being the Polish Greyhound, the Polish Hound, the Polish Hunting Dog and the Polish Lowland Sheepdog.[5]: 254  \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pomeranian_(dog)",
  "title": "Pomeranian dog - Wikipedia",
  "paragraph": "The Pomeranian (often known as a Pom) is a breed of dog of the Spitz type that is named for the Pomerania region in north-west Poland and north-east Germany in Central Europe. Classed as a toy dog breed because of its small size, the Pomeranian is descended from larger Spitz-type dogs, specifically the German Spitz. It has been determined by the Fédération Cynologique Internationale to be part of the German Spitz breed; and in many countries, they are known as the Zwergspitz (\"Dwarf Spitz\").\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pont-Audemer_Spaniel",
  "title": "Pont-Audemer Spaniel - Wikipedia",
  "paragraph": "The Pont-Audemer Spaniel or Epagneul Pont-Audemer is a rare breed of French gundog. It originated in the nineteenth century from different breeds of water spaniels, and took more of a setter role in hunting than that of a traditional spaniel. Following the Second World War, the breed's numbers dropped so low that the breed club decided to allow cross breeding with other breeds because of fears of the existing stock becoming overly inbred. In 1980, the breed club was merged with that of the Picardy Spaniel.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Poodle",
  "title": "Poodle - Wikipedia",
  "paragraph": "The Poodle, called the Pudel in German and the Caniche in French, is a breed of water dog. The breed is divided into four varieties based on size, the Standard Poodle, Medium Poodle, Miniature Poodle and Toy Poodle, although the Medium Poodle is not universally recognised. They have a distinctive thick, curly coat that comes in many colors and patterns, with only solid colors recognized by breed registries. Poodles are active and intelligent, and are particularly able to learn from humans. Poodles tend to live 10–18 years, with smaller varieties tending to live longer than larger ones.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Porcelaine",
  "title": "Porcelaine - Wikipedia",
  "paragraph": "The Porcelaine [pɔʁsəlɛn] is a breed of dog originating from France. In 1844, this scent hound was originally called “Briquets Francs Comtois” and named after a French region bordering Switzerland.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Portuguese_Podengo",
  "title": "Portuguese Podengo - Wikipedia",
  "paragraph": "The Portuguese Podengo, also known as the Podengo Português or Portuguese Warren Hound, is a hound (sight and scent) breed from Portugal. As a breed, the Podengo is divided into three size categories that are not interbred: small (Pequeno), medium (Médio) and large (Grande). Their coats are either short and 'smooth', or longer and 'wired'. The smooth coated variety is traditional, whereas the wire coated variety is an outcome of the assimilation of various other breeds during the 20th century. In general, the breed is healthy; the Pequeno (small) variety has an average lifespan of approximately 15–17 years.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Portuguese_Pointer",
  "title": "Portuguese Pointer - Wikipedia",
  "paragraph": "A Portuguese Pointer, (Portuguese: Perdigueiro Português) is a breed of dog developed as a gun dog. It is one of several pointing breeds and is mainly used in red-legged partridge hunting.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Portuguese_Water_Dog",
  "title": "Portuguese Water Dog - Wikipedia",
  "paragraph": "The Portuguese Water Dog originated from the Algarve region of Portugal. From there the breed expanded to all around Portugal's coast, where they were taught to herd fish into fishermen's nets, retrieve lost tackle or broken nets, and act as couriers from ship to ship, or ship to shore.[1]\nPortuguese Water Dogs rode in fishing trawlers as they worked their way from the Atlantic waters of Portugal to the waters off the coast of Iceland fishing for cod.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Posavac_Hound",
  "title": "Posavac Hound - Wikipedia",
  "paragraph": "The Posavac Hound (FCI No. 154) (Croatian: posavski gonič) is a breed of dog, originating as a hunting dog of the scenthound type. Croatia is the home country for the breed. The name translates into English as the Scenthound From The Sava Valley, but is usually translated as the Posavac Hound.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pra%C5%BEsk%C3%BD_Krysa%C5%99%C3%ADk",
  "title": "Pražský Krysařík - Wikipedia",
  "paragraph": "The Pražský Krysařík (Prague Ratter) is a small breed of dog from the Czech Republic that is rarely seen outside its country of origin. It is the smallest breed in the world by breed standard, because of the maximum height of the dogs, unlike Chihuahuas who are measured by weight.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pudelpointer",
  "title": "Pudelpointer - Wikipedia",
  "paragraph": "The Pudelpointer is a versatile hunting dog breed from Germany.[1][2] It is a pointing breed that came from a cross between the German hunting poodle (pudel) and the English Pointer.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pug",
  "title": "Pug - Wikipedia",
  "paragraph": "The Pug is a breed of dog originally from China, with physically distinctive features of a wrinkly, short-muzzled face, and curled tail. The breed has a fine, glossy coat that comes in a variety of colors, most often fawn (light brown) or black, and a compact, square body with well developed and thick muscles all over the body.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Puli_dog",
  "title": "Puli dog - Wikipedia",
  "paragraph": "The Puli is a small-medium breed of Hungarian herding dog known for its long, corded coat. The tight curls of the coat appear similar to dreadlocks. A similar-looking, but much larger breed – also Hungarian – is the Komondor.\nPlural form of Puli is Pulik in Hungarian.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pumi_(dog)",
  "title": "Pumi dog - Wikipedia",
  "paragraph": "The Pumi (in Hungarian, the plural form is pumik) is a medium-small breed of sheep dog from Hungary.  They are versatile stock dogs equally adept at gathering, driving and keeping stock under control. They have a long head with semi-erect ears, a whimsical expression, and a tail that forms a circle over the back. The coat (black, white, grey, or fawn) is a combination of wavy and curly hair forming curls all over the body.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pungsan_dog",
  "title": "Pungsan dog - Wikipedia",
  "paragraph": "The Pungsan, Phungsan, Korean Phungsan, or Poongsan (Chosongul: 풍산개; Hanja: 豐山개) is a breed of hunting dog from Korea, named for originating in Kim Hyong Gwon County, formerly Phungsan county.[1] They were bred in the Kaema highlands of what is now North Korea, and were traditionally used as hunting dogs.[2] The dog is a rare breed, and is sometimes smuggled over the North Korea–China border.[3][4] The dog was made a national monument of North Korea in April 1956,[5] and the national dog of the DPRK in 2014.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pyrenean_Mastiff",
  "title": "Pyrenean Mastiff - Wikipedia",
  "paragraph": "The Pyrenean Mastiff or Mastín del Pirineo is a Spanish breed of large livestock guardian dog from the autonomous community of Aragón in north-eastern Spain.[1]: 552  It was traditionally used to protect flocks during the annual transhumance to high summer pasture in the Pyrenees.[1]: 552  It is a distinct and separate breed from the Spanish Mastiff or Mastin Español and from both the Pyrenean Mountain Dog and the Pyrenean Shepherd.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pyrenean_Mountain_Dog",
  "title": "Pyrenean Mountain Dog - Wikipedia",
  "paragraph": "The  Great Pyrenees Mountain Dog \n(French: chien de montagne des Pyrénées) is a breed of livestock guardian dog from France, where it is commonly called the Patou. The breed comes from the French side of the Pyrenees Mountains that separate France and Spain. It is recognised as a separate breed from the closely related Pyrenean Mastiff, which is from the Spanish side of the mountains.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Pyrenean_Sheepdog",
  "title": "Pyrenean Sheepdog - Wikipedia",
  "paragraph": "The Pyrenean Sheepdog, the Chien de Berger des Pyrénées in French, is a small to medium-sized breed of herding dog from the Pyrenees Mountains region of France. It is found herding flocks of sheep throughout the Pyrenees alongside the much larger Pyrenean Mountain Dog which is kept as a flock guardian.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Rafeiro_do_Alentejo",
  "title": "Rafeiro do Alentejo - Wikipedia",
  "paragraph": "The Rafeiro do Alentejo is a Portuguese breed of livestock guardian dog. It is named for its area of origin, the Alentejo region of southern Portugal.[2]: 33  It is recognised by the Clube Português de Canicultura,[3] and was definitively accepted by the Fédération Cynologique Internationale in 1954.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Rajapalayam_(dog)",
  "title": "Rajapalayam dog - Wikipedia",
  "paragraph": "The Rajapalayam, also known as the Polygar Hound or Indian Ghost Hound, is a southern Indian dog breed.[3][4][5] The breed is named after Rajapalayam, a town in the Virudhunagar, Tamil Nadu.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Rampur_Greyhound",
  "title": "Rampur Greyhound - Wikipedia",
  "paragraph": "The Rampur Greyhound is a breed of sighthound native to the Rampur region of Northern India, which lies between Delhi and Bareilly. It is believed the Rampur Greyhound descends from early Afghan Hounds, with their present-day appearance due to extensive crosses to the Greyhound in the 19th century to improve the breed's speed.[1][2][3] The Rampur Greyhound is a shorthaired, powerfully built sighthound that resembles the Sloughi in appearance. It is rarely seen outside of its native land where it is retained as a coursing dog and is rarely kept as a companion.[2][3][4]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Rat_Terrier",
  "title": "Rat Terrier - Wikipedia",
  "paragraph": "The Rat Terrier is an American dog breed with a background as a farm dog and hunting companion.[1] They share much ancestry with the small hunting dogs known as feists. Common throughout family farms in the 1920s and 1930s, they are now recognized by the United and American Kennel Clubs and are considered a rare breed.[2]  Rat Terrier are an intelligent and active breed that can be kept both for pest control and as a family pet.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Ratonero_Bodeguero_Andaluz",
  "title": "Ratonero Bodeguero Andaluz - Wikipedia",
  "paragraph": "The Ratonero Bodeguero Andaluz (Andalusian wine-cellar rat-hunting dog) is a Spanish breed of dog of the terrier type. Its name reflects its main occupation: hunting rats and mice hidden between barrels in the wineries of Andalusia in Spain. It was recognised as an indigenous Spanish breed in 2000 by the Spanish Ministry of Agriculture and by the Spanish Kennel Club, the Real Sociedad Canina de España.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Ca_Rater_Mallorqu%C3%AD",
  "title": "Ca Rater Mallorquí - Wikipedia",
  "paragraph": "The Ca Rater Mallorquí or Spanish: Ratonero mallorquín is a Spanish breed of dog of ratter type, found on the island of Mallorca in the Balearic Islands.[2][3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Ratonero_Murciano",
  "title": "Ratonero Murciano - Wikipedia",
  "paragraph": "The Ratonero Murciano is a breed of dog from the Spanish Region of Murcia.[1][better source needed][2][better source needed] The Ratonero Murciano was traditionally kept in Murcia as a mouse and rat hunter, it is claimed they descend from dogs introduced to the region by the Romans who imported them from Egypt.[1][2] In 1997 a breeding program was established to save the breed, by 2009 the program was up to its third generation, with 80 breeding specimens and a DNA testing program.[1][2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Ratonero_Valenciano",
  "title": "Valencian Terrier - Wikipedia",
  "paragraph": "The Ratonero Valenciano, also known as the Gos Rater Valencià (English for: Valencian rat hunting dog), is a breed of dog that originates in Spain. Recognised by the Real Sociedad Canina de España in 2004, it has had recent success with a member of the breed winning the Spanish National Dog Show in 2011. It is a traditionally docked breed. In 2022, the FCI finally recognised the breed, naming it rather \"Terrier\" than \"Ratter\".[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Redbone_Coonhound",
  "title": "Redbone Coonhound - Wikipedia",
  "paragraph": "The Redbone Coonhound is an American breed of hunting dog. The Redbone is a courageous hunter often used to track large game such as bear, boar, cougar, though is it also used to track smaller game such as deer. The breed dates back to pre-Civil War and is one of the most versatile of all the hounds. It originated in the Southern United States, and its foundation stock derives from bloodhounds[1] and foxhounds brought by immigrants from Scotland. It is characterized by its deep red coat.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Rhodesian_Ridgeback",
  "title": "Rhodesian Ridgeback - Wikipedia",
  "paragraph": "The Rhodesian Ridgeback is a large dog breed bred in the Southern Africa region.[1] Its forebears can be traced to the semi-domesticated ridged hunting and guardian dogs of the Khoikhoi. These were interbred with European dogs by the early colonists of the Cape Colony for assisting in the hunting of lions. \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Romanian_Mioritic_Shepherd_Dog",
  "title": "Romanian Mioritic Shepherd Dog - Wikipedia",
  "paragraph": "The Romanian Mioritic Shepherd Dog (Romanian: Ciobănesc Românesc Mioritic) is a large breed of livestock guardian dog that originated in the Carpathian Mountains of Romania.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Romanian_Raven_Shepherd_Dog",
  "title": "Romanian Raven Shepherd Dog - Wikipedia",
  "paragraph": "The Romanian Raven Shepherd Dog (Romanian: Ciobănesc Românesc Corb) is a livestock guardian dog originating in the southern and sub-Carpathian regions of Argeș County, Brașov County, Dâmbovița County, and Prahova County in Romania. They have been known for generations as \"Corbi\" because of their black coat. The dog was officially recognized by the Romanian Kennel Club on November 14, 2008.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Rottweiler",
  "title": "Rottweiler - Wikipedia",
  "paragraph": "The Rottweiler (/ˈrɒtwaɪlər/, UK also /-vaɪlər/)[1][2] is a breed of domestic dog, regarded as medium-to-large[3][4] or large.[5][6] The dogs were known in German as Rottweiler Metzgerhund, meaning Rottweil butchers' dogs,[7][8] because their main use was to herd livestock[3] and pull carts laden with butchered meat to market.[7] This continued until the mid-19th century when railways replaced droving. Although still used to herd stock in many parts of the world, Rottweilers are now also used as search and rescue dogs, guard dogs, and police dogs.[9]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Rough_Collie",
  "title": "Rough Collie - Wikipedia",
  "paragraph": "The Rough Collie (also known as the Long-Haired Collie) is a long-coated dog breed of medium to large size that, in its original form, was a type of collie used and bred for herding sheep in Scotland. More recent breeding has focused on the Collie as a show dog, and also companion. The breed specifications call for a distinctive long narrow tapered snout and tipped (semiprick) ears, so some dogs have their ears taped when young. Rough Collies generally come in shades of sable and white (sometimes mahogany), blue merle, tri-colored, and colour-headed white.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Russian_Spaniel",
  "title": "Russian Spaniel - Wikipedia",
  "paragraph": "The Russian Spaniel is a type of spaniel first standardised in 1951 in the Soviet Union after World War II by cross breeding English Cocker Spaniels, English Springer Spaniels and other spaniel breeds. In 1951, the standard of the Russian spaniel was adopted, the selection of dogs for breeding began to be carried out in accordance with the requirements. Physically it is similar to a Cocker Spaniel, but has a shorter, tighter coat and a longer body. Developed and used as hunting dogs, this breed does not suffer from any major health complaints other than those normally associated with spaniels. It is the only gun dog breed originated in Russia. It is used for hunting game birds (marsh, field, upland and waterfowl birds) and hares. Popular in its native Russia, the breed was only introduced overseas in the 1990s, and is not yet recognised by any major kennel clubs, but is recognised by Russian Kynological Federation.[1] \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Russkiy_Toy",
  "title": "Russkiy Toy - Wikipedia",
  "paragraph": "The Russian Toy (also known as the Russian Toy Terrier, and in Russia as the Russkiy Toy , Russian: Русский той) is a very small breed of dog originally bred in Russia from the English Toy Terrier. There are two types of coats in the breed: smooth coat and long coat. The smooth-coated variety was previously known as the Russian Toy Terrier and long-coated as the Moscow Long-Haired Toy Terrier. Both were brought together under the same Russian Toy Terrier name in 1988 and the \"Terrier\" was dropped from the name when the breed was added in 2006 to the official list of breeds registered with the Fédération Cynologique Internationale[1] and has been registered in the Foundation Stock Service of the American Kennel Club since 2008, allowed to compete in AKC companion events since 2010.[1][2] The first official breed standard of the two varieties was written in 1966 in Russia.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Russo-European_Laika",
  "title": "Russo-European Laika - Wikipedia",
  "paragraph": "Russo-European Laika (Russko-Evropeĭskaya Láĭka) is the name of a breed of hunting dog that originated in the forested region of northern Europe and Russia, one of several breeds developed from landrace Laika dogs of Spitz type. The Russo-European Laika itself dates to a breeding program begun in 1944 by E. I. Shereshevsky of the  All-Union Research Institute for the Hunting Industry, in Kalinin (now Tver) Province.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Ryukyu_Inu",
  "title": "Ryukyu dog - Wikipedia",
  "paragraph": "The Ryukyu dog (琉球犬, Ryūkyū-inu or Ryūkyū-ken) is an endangered, medium-sized breed of dog indigenous to Okinawa, Japan.[1][2] There were as few as 400 Ryukyu as of 2015.[3] Unlike dogs such as the Kai Ken, the Ryukyu dog is not protected by the Nihon Ken Hozonkai, but instead is protected by the Ryukyu Inu Hozonkai.[4]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Saarloos_wolfdog",
  "title": "Saarloos wolfdog - Wikipedia",
  "paragraph": "The Saarloos Wolfdog (Dutch: Saarlooswolfhond, German: Saarlooswolfhund) is a wolf-dog breed originating from the Netherlands by the crossing of a German Shepherd with a Siberian grey wolf in 1935.[1] The offspring were then further crossed with German Shepherds.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Sabueso_Espa%C3%B1ol",
  "title": "Sabueso Español - Wikipedia",
  "paragraph": "The Sabueso Español or Spanish Hound[1] is a scenthound breed with its origin in the far north of Iberian Peninsula. This breed has been used in this mountainous region since hundreds of years ago for all kind of game: wild boar, hare, brown bear, wolf, red deer, fox, roe deer and chamois. It is an exclusive working breed, employed in hunting with firearms.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/St._Bernard_(dog)",
  "title": "St. Bernard (dog) - Wikipedia",
  "paragraph": "The St. Bernard or Saint Bernard (UK: /ˈbɜːrnərd/, US: /bərˈnɑːrd/) is a breed of very large working dog from the Western Alps in Italy and Switzerland.[3] They were originally bred for rescue work by the hospice of the Great St Bernard Pass on the Italian-Swiss border.[4][5] The hospice, built by and named after the Alpine monk Saint Bernard of Menthon, \nacquired its first dogs between 1660 and 1670.[4] The breed has become famous through tales of Alpine rescues, as well as for its large size, and gentle temperament.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/St._Hubert_Jura_Hound",
  "title": "St. Hubert Jura Hound - Wikipedia",
  "paragraph": "The St. Hubert Jura Hound is a breed of scenthound originating in the Jura Mountains on the French-Swiss border.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Saint_Miguel_Cattle_Dog",
  "title": "Saint Miguel Cattle Dog - Wikipedia",
  "paragraph": "The Saint Miguel Cattle Dog (Portuguese: cão fila de São Miguel [ˈkɐ̃w ˈfilɐ ðɨ ˈsɐ̃w miˈɣɛl], literally 'catch dog of São Miguel') is a dog breed of mastiff type originating on São Miguel Island in the Azores, an island chain which is one of the autonomous regions of Portugal. The breed was originally used as a herding dog for working with cattle.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Saint-Usuge_Spaniel",
  "title": "Saint-Usuge Spaniel - Wikipedia",
  "paragraph": "The Saint-Usuge Spaniel (or Épagneul de Saint-Usuge) is a breed of Spaniel originating in the Bresse region of France.[1] The breed has origins dating back to at least the 16th century, but was nearly extinct by the end of World War II. Through the efforts of Father Robert Billard, the breed was resurrected during the second half of the 20th century; its national breed club was founded in 1990. The breed was recognised by the Société Centrale Canine (French Kennel Club) in 2003.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Saluki",
  "title": "Saluki - Wikipedia",
  "paragraph": "The Saluki is a standardised breed developed from sighthounds – dogs that hunt primarily by sight rather than strong scent – that was once used by nomadic tribes to run down game animals.[2] The dog was originally bred in the Fertile Crescent.[1] The modern breed is typically deep-chested and long-legged,[2] and similar dogs appear in medieval and ancient art. The breed is most closely related to the Afghan hound, a basal breed that predates the emergence of modern breeds in the 19th century,[3] and the Saluki has been purebred both in the Middle East, including by royalty, since at least that era, and in the West (especially in Britain and Germany) since the 1840s (with breed standards established in the West and the Middle East around the 1920s–1930s), though as a free-breeding landrace, similar dogs are common as feral animals in the Middle East. A related standardised breed is the north African Sloughi.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Samoyed_(dog)",
  "title": "Samoyed dog - Wikipedia",
  "paragraph": "The Samoyed (/ˈsæməjɛd/ SAM-ə-yed or /səˈmɔɪ.ɛd/ sə-MOY-ed;[1] Russian: Самое́дская соба́ка or Самое́д) is a breed of medium-sized herding dogs with thick, white, double-layer coats. They are a spitz-type dog which takes its name from the Samoyedic peoples of Siberia. Descending from the Nenets Herding Laika, they are a domesticated animal that assists in herding, hunting, protection and sled-pulling. \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Sapsali",
  "title": "Sapsali - Wikipedia",
  "paragraph": "The Sapsal (also Sapsali/Sapsari or Sapsalgae) (Korean: 삽살이) is a shaggy-haired South Korean breed of dog that is said to ward off evil spirits. In the Korean language, the word Sapsal is followed by either gae (개, meaning \"dog\") or the nominative particle i (이), and may occasionally be romanized as Sapsaree. The breed was designated as one of the Natural monuments of South Korea in 1992 to receive protected status and funding for its preservation as a part of Korea's cultural heritage.[1] The breed is officially recognized by the Korean Kennel Federation.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Sarabi_dog",
  "title": "Sarabi dog - Wikipedia",
  "paragraph": "The Sarabi dog or Persian mastiff,(Persian : سگ سرابی) is a large breed of livestock guardian dog from Iran, originating from the Sarab County, Sarabi dogs have been used for centuries by local shepherds to protect herds of sheep and goats from bears, wolves, jackals and other local predators. The Persian mastiff is calm, controlled, independent, powerful and protective, the breed is also used to compete in staged dog fights.[1] The breed is considered one of the oldest[2] and most powerful indigenous dog breeds in Iran; the larger and heavier an individual dog is, the greater its value.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Sardinian_Shepherd_Dog",
  "title": "Sardinian Shepherd Dog - Wikipedia",
  "paragraph": "The Sardinian Shepherd Dog or Fonni's Dog (Sardinian: cane fonnesu or cani sardu antigu; Italian: pastore fonnese) is an ancient landrace breed of Sardinian dog used as a herding, catching, and livestock guardian dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/%C5%A0arplaninac",
  "title": "Šarplaninac - Wikipedia",
  "paragraph": "The Šarplaninac[b] is a breed of dog of livestock guardian type.[2] It is named for the Šar Mountains or Šar Planina range in the Balkans, where it is principally found. Until 1957 it was known as the Illyrian Shepherd Dog or Ilirski Ovčar.[c] \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Schapendoes",
  "title": "Schapendoes - Wikipedia",
  "paragraph": "The Schapendoes (Dutch pronunciation: [ˈsxaːpəndus]) or Dutch Sheepdog, is a breed of dog originating in the Netherlands. The Schapendoes was originally a herding dog and general farm dog, but today also participates in dog sports such as agility and flyball.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Schillerst%C3%B6vare",
  "title": "Schillerstövare - Wikipedia",
  "paragraph": "The Schillerstövare, translated as the Schiller Hound in English, is a breed of dog of the scenthound type, originating as a hunting dog in Sweden in the late 19th century.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Schipperke",
  "title": "Schipperke - Wikipedia",
  "paragraph": "A Schipperke (/ˈskɪpərkiː/; Dutch: [ˈsxɪpərkə]) is a small breed of dog that is believed to have originated in the 1600s in Belgium.[1] There has been a long informal debate over whether this type of dog is a spitz or miniature sheepdog. In their home country of Belgium they are considered a small shepherd.[2] DNA research has shown that Schipperkes have a close relationship to the Spitz family of dog breeds.[3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Schweizer_Laufhund",
  "title": "Schweizer Laufhund - Wikipedia",
  "paragraph": "The Schweizer Laufhund is a breed of scenthound, originally from Switzerland.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Schweizerischer_Niederlaufhund",
  "title": "Schweizerischer Niederlaufhund - Wikipedia",
  "paragraph": "The Schweizerischer Niederlaufhund (Small Swiss Hound), is a breed of dog of the scenthound type from Switzerland. Niederlaufhund means short-legged hound.  The breed has a number of different varieties (all of the same breed).\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Scottish_Deerhound",
  "title": "Scottish Deerhound - Wikipedia",
  "paragraph": "The Scottish Deerhound, or simply the Deerhound, is a large breed of sighthound, once bred to hunt the red deer by coursing. In outward appearance, the Scottish Deerhound is similar to the Greyhound, but larger and more heavily boned with a rough-coat.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Scottish_Terrier",
  "title": "Scottish Terrier - Wikipedia",
  "paragraph": "The Scottish Terrier (Scottish Gaelic: Abhag Albannach; also known as the Aberdeen Terrier), popularly called the Scottie, is a breed of dog. Initially one of the highland breeds of terrier that were grouped under the name of Skye Terrier, it is one of five breeds of terrier that originated in Scotland, the other four being the modern Skye, Cairn, Dandie Dinmont, and West Highland White terriers. They are an independent and rugged breed with a wiry outer coat and a soft dense undercoat. The First Earl of Dumbarton nicknamed the breed \"the diehard\". According to legend, the Earl of Dumbarton gave this nickname because of the Scottish Terriers' bravery, and Scotties were also the inspiration for the name of his regiment, The Royal Scots, Dumbarton’s Diehard.[1] Scottish Terriers, were originally bred to hunt vermin on farms.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Sealyham_Terrier",
  "title": "Sealyham Terrier - Wikipedia",
  "paragraph": "The Sealyham Terrier (Welsh: Daeargi Sealyham) is a rare Welsh breed of small to medium-sized terrier that originated in Wales as a working dog.  It is principally a white-bodied, rough-coated breed, developed in the mid-to-late-19th century by Captain John Edwardes at Sealyham House, Pembrokeshire.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Segugio_dell%27Appennino",
  "title": "Segugio dell'Appennino - Wikipedia",
  "paragraph": "The Segugio dell'Appennino or Piccolo Lepraiolo Italiano is a breed of small Italian scenthound, bred specifically to hunt hare. It may be either smooth-haired or wire-haired.[2] It received full recognition from the Ente Nazionale della Cinofilia Italiana in 2010.[3] It is one of four Italian breeds of scenthound, the others being the Segugio Italiano a Pelo Forte, the Segugio Italiano a Pelo Raso and the Segugio Maremmano.[4]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Segugio_Italiano",
  "title": "Segugio Italiano - Wikipedia",
  "paragraph": "The Segugio Italiano[a] is either of two Italian breeds of dog of scent hound type, the wire-haired Segugio Italiano a Pelo Forte[1] or the short-haired Segugio Italiano a Pelo Raso.[2][3]: 531  Apart from the coat type, they are closely similar,[3]: 531  and in some sources may be treated as a single breed; the Fédération Cynologique Internationale and the Ente Nazionale della Cinofilia Italiana treat them as separate.[1][2][4] They are also genetically close to the other two Italian scent hound breeds, the Segugio Maremmano and the Segugio dell'Appennino.[3]: 536  They are traditionally used for hunting hare, but may also be used in boar hunts.[5]: 242 \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Segugio_Maremmano",
  "title": "Segugio Maremmano - Wikipedia",
  "paragraph": "The Segugio Maremmano is an Italian breed of scent hound from the coastal plains of the Maremma, in Tuscany. It is mainly used for hunting wild boar, but may also be used to hunt hare and other mammals.[1] They may be either smooth-haired or rough-haired.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Serbian_Hound",
  "title": "Serbian Hound - Wikipedia",
  "paragraph": "The Serbian Hound (Serbo-Croatian: srpski gonič / српски гонич), previously known as the Balkan Hound (Serbo-Croatian: balkanski gonič / балкански гонич), is a breed of scent hound from Serbia.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Serbian_Tricolour_Hound",
  "title": "Serbian Tricolour Hound - Wikipedia",
  "paragraph": "The Serbian Tricolour Hound (Serbian: српски тробојни гонич, romanized: srpski trobojni gonič) is a breed of scent hound from Serbia. \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Serrano_Bulldog",
  "title": "Serrano Bulldog - Wikipedia",
  "paragraph": "The Serrano Bulldog (Portuguese: Buldogue serrano) is a Brazilian dog breed recognized by the Brazilian Confederation of Cynophilia (CBKC).[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Shar_Pei",
  "title": "Shar Pei - Wikipedia",
  "paragraph": "The Shar Pei (Cantonese: shā pèih or Mandarin: 沙皮 shā pí) is a dog breed from \nsouthern China. Traditionally kept as a property guardian, the Shar Pei was driven to the brink of extinction in the 20th century. The breed is known in the West for its deep wrinkles, while a traditional less wrinkled form is maintained in Hong Kong.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Shetland_Sheepdog",
  "title": "Shetland Sheepdog - Wikipedia",
  "paragraph": "The Shetland Sheepdog, often known as the Sheltie, is a breed of herding dog that originated in the Shetland Islands of Scotland. The original name was Shetland Collie, but this caused controversy amongst Rough Collie breeders of the time, so the breed's name was formally changed.[2] This diligent small dog is clever, vocal, excitable and willing to please. They are incredibly trustworthy to their owners to the point where they are often referred to as \"shadows\" due to their attachment to family. This breed was formally recognized by The Kennel Club (UK) in 1909.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Shiba_Inu",
  "title": "Shiba Inu - Wikipedia",
  "paragraph": "The Shiba Inu (柴犬, Japanese: [ɕiba inɯ]) is a breed of hunting dog from Japan. A small-to-medium breed, it is the smallest of the six original and distinct spitz breeds of dog native to Japan.[1] Its name literally translates to \"brushwood dog\", as it is used to flush game.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Shih_Tzu",
  "title": "Shih Tzu - Wikipedia",
  "paragraph": "The Shih Tzu (UK: /ˌʃiːˈtsuː/, US: /ˈʃiːtsuː/;[1] Chinese: 西施犬; pinyin: Xī Shī quǎn literally \"Hsi Shih dog\") is a toy dog breed originating from Tibet and believed to be bred from the Pekingese and the Lhasa Apso.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Shikoku_(dog)",
  "title": "Shikoku dog - Wikipedia",
  "paragraph": "The Shikoku Inu (四国犬, Shikoku-ken) or Kōchi-ken (高知犬)[1]  is a Japanese breed of dog from Shikoku island.[2] It was designated by Japan as a culturally important national treasure in 1937.[3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Shiloh_Shepherd_dog",
  "title": "German Shepherd - Wikipedia",
  "paragraph": "The German Shepherd[a] is a German breed of working dog of medium to large size. The breed was developed by Max von Stephanitz using various traditional German herding dogs from 1899.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Siberian_Husky",
  "title": "Siberian Husky - Wikipedia",
  "paragraph": "The Siberian Husky is a medium-sized working sled dog breed. The breed belongs to the Spitz genetic family. It is recognizable by its thickly furred double coat, erect triangular ears, and distinctive markings, and is smaller than the similar-looking Alaskan Malamute.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Silken_Windhound",
  "title": "Silken Windhound - Wikipedia",
  "paragraph": "The Silken Windhound is an American breed of sighthound. Like most sighthounds, Silkens are noted coursers.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Australian_Silky_Terrier",
  "title": "Australian Silky Terrier - Wikipedia",
  "paragraph": "The Australian Silky Terrier or simply Silky Terrier (depending on the breed registry) is a small breed of dog of the terrier dog type. The breed was developed in Australia, although the ancestral types and breeds were from Great Britain. It is closely related to the Australian Terrier and the Yorkshire Terrier. The breed is called the Silky Terrier in North America, but is called the Australian Silky Terrier in its country of origin and in the rest of the world.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Sinhala_Hound",
  "title": "Sinhala Hound - Wikipedia",
  "paragraph": "The Sinhala Hound is a landrace of dog from Sri Lanka.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Skye_Terrier",
  "title": "Skye Terrier - Wikipedia",
  "paragraph": "The Skye Terrier is a Scottish dog breed that is a long, low, hardy terrier and \"one of the most endangered native dog breeds in the United Kingdom\" according to The Kennel Club.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Sloughi",
  "title": "Sloughi - Wikipedia",
  "paragraph": "The Sloughi /ˈsluːɡi/,[1] or Arabian Greyhound (Arabic: سلوقي),[2] is an ancient breed of domesticated dog, specifically a member of the sighthound family. It originates from North Africa and is found in Algeria, Tunisia, Morocco and Libya.[3][4][5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Slovak_Rough-haired_Pointer",
  "title": "Slovak Rough-haired Pointer - Wikipedia",
  "paragraph": "(Slovenský hrubosrstý Stavač)\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Slovak_Cuvac",
  "title": "Slovak Cuvac - Wikipedia",
  "paragraph": "The Slovak Cuvac is a Slovak breed of dog, bred for use as a livestock guard dog. This breed—also known as Slovensky Cuvac, Slovak Chuvach, Tatransky Cuvac and Slovensky Kuvac—is closely related to the Hungarian Kuvasz. The alternate German and English spelling Tchouvatch reflects the pronunciation: chew-votch( čuvati - in serbocroatian language  - guarding) . The breed is recognised under sponsorship from Slovakia by the Fédération Cynologique Internationale with the name Slovenský čuvač.[1] Despite the multiple renderings in English, these refer to only one breed. The United Kennel Club in the US uses the English version of the name Slovak Cuvac.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Slovensk%C3%BD_kopov",
  "title": "Slovenský kopov - Wikipedia",
  "paragraph": "The Slovenský kopov (translated into English as Slovak Hound) is a medium-sized breed of hunting dog of the scenthound type. The breed originated in Slovakia, in Central Europe, and is bred for boar hunting.  The name Black Forest Hound seems to have been created in North America for marketing purposes, since the breed has no connection with the Black Forest. The German name for this breed is Schwarzwildbracke which translates to Wild Boar Hound and not Schwarzwaldbracke which would be Black Forest Hound.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Smaland_Hound",
  "title": "Smaland Hound - Wikipedia",
  "paragraph": "Smaland Hound (Swedish: Smålandsstövare) is a breed of dog that originated in Sweden in the 16th century. Thought to be the oldest scent hound breed native to Sweden, it was first recognized by the Swedish Kennel Club in 1921. They are the smallest of the Swedish hound breeds, and have black and tan markings similar to the rottweiler. Internationally, it is recognized by a number of kennel clubs and registries including the Fédération Cynologique Internationale and United Kennel Club. It is considered rare, even in its native Sweden where only around sixty puppies are registered each year.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Small_Greek_domestic_dog",
  "title": "Kokoni - Wikipedia",
  "paragraph": "The Kokoni (Greek: Κοκόνι) is a small domestic dog breed from Greece, only recently established as a standardized breed.  The foundation stock, a general landrace of small dogs of the region, are widely found throughout the country.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Small_M%C3%BCnsterl%C3%A4nder",
  "title": "Small Münsterländer - Wikipedia",
  "paragraph": "The Small Münsterländer (also SM or Kleiner Münsterländer) is a versatile hunting-pointing-retrieving dog breed that reached its current form in the area around Münster, Germany. The Large Münsterländer is from the same area, but was developed from different breeding stock and is not related as the names would suggest. Small Münsterländers bear a resemblance to both spaniels and setters but are more versatile while hunting on land and water. The Small Münsterländer is recognized by the Fédération Cynologique Internationale under Group 7, Section 1.2, Continental Pointing Dogs of Spaniel type, by the American Kennel Club as a Foundation Stock Service breed, and by The Kennel Club and the United Kennel Club as a gun dog. It is related to the Epagneul Français and the Drentsche Patrijshond.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Smithfield_(dog)",
  "title": "Smithfield (dog) - Wikipedia",
  "paragraph": "The Smithfield, Smithfield Collie or Smithfield Sheepdog is a breed of herding dog. It is a large, strong dog of the collie type. The Smithfield can be black, grey or red with a white collar, or wholly white [1] and they always possess floppy ears and shaggy hair on the body, face and legs. Two varieties exist, with one having a natural bobtail and the second with a longer tail.[2] It was used for droving cattle in the southeast of England, especially the Smithfield Market in London,[3] and although this breed of dog is believed to be extinct and was never recognised by any of the major kennel clubs before its extinction, dogs of a similar type are shown under the same name in Tasmania, Australia.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Smooth_Collie",
  "title": "Smooth Collie - Wikipedia",
  "paragraph": "The Smooth Collie is a breed of dog developed originally for herding. It is a short-coated version of the Rough Collie of Lassie fame. Some breed organisations consider the smooth-coat and rough-coat dogs to be variations of the same breed.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Smooth_Fox_Terrier",
  "title": "Smooth Fox Terrier - Wikipedia",
  "paragraph": "The Smooth Fox Terrier is a breed of dog, one of many terrier breeds. It was the first breed in the fox terrier family to be given official recognition by The Kennel Club (circa 1875; breed standard 1876).  It is well known, and although not a widely popular breed today outside hunting and show circles, it is extremely significant due to the large number of terriers believed descended from the breed.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Soft-Coated_Wheaten_Terrier",
  "title": "Soft-coated Wheaten Terrier - Wikipedia",
  "paragraph": "The Soft-coated Wheaten Terrier (Irish: An Brocaire Buí - literally, \"Yellow Terrier\") is a pure-breed terrier originating from Ireland. Wheatens typically have one of two coat types: Irish or Heavy (American). The Irish coat is generally silkier and wavier than the Heavy, or American coat, which is thicker and fuller. Wheatens are generally friendly and playful, and tend to get along well with children and other dogs.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/South_Russian_Ovcharka",
  "title": "South Russian Ovcharka - Wikipedia",
  "paragraph": "The South Russian Ovcharka or South Russian Shepherd Dog (Russian: Южнорусская овчарка) is breed of livestock guardian dog and herding dog developed along the Black Sea steppe of the Russian Empire.[1][2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Spanish_Mastiff",
  "title": "Spanish Mastiff - Wikipedia",
  "paragraph": "The Spanish Mastiff or Mastín Español is a breed of dog from Spain, originally bred to be a guard dog and whose specialized purpose is to be a livestock guardian dog protecting flocks and/or herds from wolves and other predators.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Spanish_Water_Dog",
  "title": "Spanish Water Dog - Wikipedia",
  "paragraph": "The Spanish Water Dog (perro de agua español) breed is used in Spain as a general purpose sheepdog and guard. It is also used sometimes as a gundog, and is skilled at retrieval from water.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/List_of_Italian_dog_breeds",
  "title": "List of Italian dog breeds - Wikipedia",
  "paragraph": "Seventeen Italian dog breeds are recognised by the Ente Nazionale della Cinofilia Italiana,[1] of which fifteen are recognised also by the Fédération Cynologique Internationale. A further six are in the process of recognition by the ENCI. There are a number of local breeds or types without national recognition.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Spinone_Italiano",
  "title": "Spinone Italiano - Wikipedia",
  "paragraph": "The Spinone Italiano[a] is an Italian breed of hunting dog, traditionally used for tracking, for pointing and for retrieving game.[1][3][4][5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Sporting_Lucas_Terrier",
  "title": "Sporting Lucas Terrier - Wikipedia",
  "paragraph": "The Sporting Lucas Terrier is a small breed of dog of the terrier type. The breed is named for Jocelyn Lucas.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Stabyhoun",
  "title": "Stabyhoun - Wikipedia",
  "paragraph": "The Stabyhoun, or Stabijhoun or Stabij (in Frisian), is one of the rarest dog breeds in the world.[1][2][3] It hails from the Dutch province of Friesland; its origins lie in the forested region of eastern and southeastern Friesland. The breed has been mentioned in Dutch literature dating back to the early 1800s, but it was not until the 1960s that the breed became known outside its native province; the first Stabyhouns left the Netherlands some decades later, in the 2000s. The name Stabijhoun translates roughly to \"stand by [me] dog\". The dog is considered a Dutch national treasure. Today, there are only a few thousand Stabyhouns worldwide.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Staffordshire_Bull_Terrier",
  "title": "Staffordshire Bull Terrier - Wikipedia",
  "paragraph": "The Staffordshire Bull Terrier, also called the Staffy or Stafford, is a purebred dog of small to medium size in the terrier group that originated in the northern parts of Birmingham and in the Black Country of Staffordshire, for which it is named. They descended from 19th-century bull terriers that were developed by crossing bulldogs with various terriers to create a generic type of dog generally known as bull and terriers. Staffords share the same ancestry with the modern Bull Terrier, although the two breeds developed along independent lines, and do not resemble each other. Modern Staffords more closely resemble the old type of bull terrier, and were first recognised as a purebred dog breed by The Kennel Club of Great Britain in 1935.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Standard_Schnauzer",
  "title": "Standard Schnauzer - Wikipedia",
  "paragraph": "The Schnauzer or Mittelschnauzer is a German breed of dog in the Pinscher and Schnauzer group.[2] It is characterised by an abundant bristly beard and whiskers, usually lighter than the coat. It is one of three Schnauzer breeds, the others being the Giant Schnauzer or Riesenschnauzer, and the Miniature Schnauzer or Zwergschnauzer. In Germany it is an endangered breed, and is listed in category III of the Rote Liste of the Gesellschaft zur Erhaltung alter und gefährdeter Haustierrassen.[3] \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Stephens_Stock",
  "title": "Stephens Stock - Wikipedia",
  "paragraph": "The Stephens Stock, also known as the Stephens Stock Mountain Cur or simply the Stephens Cur, is a breed of cur from the United States.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Styrian_Coarse-haired_Hound",
  "title": "Styrian Coarse-haired Hound - Wikipedia",
  "paragraph": "The Styrian Coarse-haired Hound (German: Steirische Rauhhaarbracke) is a breed of medium-sized hound dog originated in the Austrian province of Styria. It is bred as a scenthound, for hunting boar in mountainous terrain. The breed is one of the large Austrian Bracke.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Sussex_Spaniel",
  "title": "Sussex Spaniel - Wikipedia",
  "paragraph": "The Sussex Spaniel is a breed of dog native to Sussex in southern England. It is a low, compact spaniel and is as old a breed as and similar in appearance to the Clumber Spaniel. They can be slow-paced, but can have a clownish and energetic temperament. They suffer from health conditions common to spaniels and some large dogs, as well as a specific range of heart conditions and spinal disc herniation.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Swedish_Lapphund",
  "title": "Swedish Lapphund - Wikipedia",
  "paragraph": "The Swedish Lapphund (Swedish: Svensk lapphund) is a breed of dog of the Spitz type from Sweden, one of three Lapphund breeds developed from a type of dog used by the Sami people for herding and guarding their reindeer.\nThe expression \"the black beauty of Norrland\" is very often attributed to the Swedish lapphund, which is most likely one of Sweden's oldest breeds.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Swedish_Vallhund",
  "title": "Swedish Vallhund - Wikipedia",
  "paragraph": "The Swedish Vallhund, also known as the Västgötaspets and Swedish cow dog, is a breed of dog native to Sweden. The breed's name, Vallhund, when translated into English, means herding dog, as the Swedish Vallhund was originally bred as a drover and herder of cows over 1,000 years ago.[1][2] In 1942, the dog came close to extinction, but careful breeding and publicity by Swedish national Björn von Rosen and K. G. Zettersten managed to revive the breed in popularity and save it from its likely end.[3] In 1943, the Swedish Kennel Club recognized the Swedish Vallhund as a breed, and officially categorized the Swedish Vallhund as \"the Västgötaspets\" for Västergötland, the province in which their revival took place.[3] Since then, the breed has been recognized by, and bred in, over ten countries and has gained some popularity.[3] \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Swinford_Bandog",
  "title": "Mastiff - Wikipedia",
  "paragraph": "A mastiff is a large and powerful type of dog.[1][2] Mastiffs are among the largest dogs, and typically have a short coat, a long low-set tail and large feet; the skull is large and bulky, the muzzle broad and short (brachycephalic) and the ears drooping and pendant-shaped.[1][2] European and Asian records dating back 3,000 years show dogs of the mastiff type.[3] Mastiffs have historically been guard dogs, protecting homes and property, although throughout history they have been used as hunting dogs, war dogs and for blood sports, such as fighting each other and other animals, including bulls, bears and even lions.[2][3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Taigan",
  "title": "Taigan - Wikipedia",
  "paragraph": "The Taigan (Kyrgyz: тайган), and also known as Kyrgyz Taighany (Kyrgyz: кыргыз тайганы) (Kyrgyzskaya Borzaya in Russian), Mongolian Taiga dog is a breed of sighthound from Kyrgyzstan. The Taigan is found in the alpine Tian Shan region of Kyrgyzstan on the border with China, it is closely related to the Tazy and the Saluki.[1][2][3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Taiwan_Dog",
  "title": "Taiwan Dog - Wikipedia",
  "paragraph": "The Taiwan Dog (Chinese: 台灣犬) is a breed of small or medium dog indigenous to Taiwan. These dogs are also known as the Formosan Mountain Dog.[1] They are well-adapted to the uneven and thickly forested terrain of Taiwan, having become a semi-wild breed prior to the arrival of several colonial reigns and foreign powers. Notwithstanding these adaptations, Formosans retained the potential to be trained and are now used as hunting dogs, guard dogs, stunt dogs, rescue dogs, or simply as companions.[2][3]  Formosans are classified into one medium type and two small types.[4]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tamaskan_Dog",
  "title": "Northern Inuit Dog - Wikipedia",
  "paragraph": "The Northern Inuit Dog, along with its offshoot breed lines the Tamaskan dog, the British Timber dog and the Utonagan, is a breed of dog developed from a 1980s breeding project in the United Kingdom with the objective of producing a dog breed that resembles wolves.[1][2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tang_Dog",
  "title": "Tang Dog - Wikipedia",
  "paragraph": "The Tang Dog (唐狗) is an ancient medium-sized dog breed indigenous to southern China. Tang dogs are prized as a companion and watch dog but are also occasionally used for hunting and as meat dogs.[1][2] The breed is named for the Tang Dynasty, a period of prosperity in China.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tarsus_%C3%A7atalburun",
  "title": "Tarsus çatalburun - Wikipedia",
  "paragraph": "The Tarsus çatalburun or Turkish Pointer is a native hound of Turkey most recognizable for its split or bifid nose.[1][2][3] The word \"çatalburuns\" meaning forked nose.[4][2] It is a very rare breed with only a few hundred specimens.[1][5] The Tarsus çatalburun is unrecognized by any kennel club.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tazy",
  "title": "Tazy - Wikipedia",
  "paragraph": "Tazy is a breed of sighthound hunting dog originating from Kazakhstan.[1][2][3] Though it looks similar to the Saluki sighthound, it is a related but different dog breed.[4]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Teddy_Roosevelt_Terrier",
  "title": "Teddy Roosevelt Terrier - Wikipedia",
  "paragraph": "The Teddy Roosevelt Terrier is a small to medium-sized American hunting terrier. It is lower-set, with shorter legs, and is more muscular with heavier bone density than the related American Rat Terrier. Much diversity exists in the history of the Teddy Roosevelt Terrier breed, and it shares a common early history with the American Rat Terrier, Fox Paulistinha, and Tenterfield Terrier. The Rat Terrier's background is said to stem from the terriers or other dogs that were brought over by early English and other working-class immigrants. Since the breed was a farm, hunting, and utility dog, little to no planned breeding was used  other than breeding dogs with agreeable traits to each other to produce the desired work ethic in the dog. The Feist (dog), Bull Terrier, Smooth Fox Terrier, Manchester Terrier, Whippet, Italian Greyhound, the now extinct English White Terrier, Turnspit Dog, and Wry-legged Terrier all share in the Teddy Roosevelt Terrier's ancestry.[1]  These early ratting terriers were then most likely bred to the Beagle or Beagle crossbred dogs (for increased scenting ability) and other dogs. Maximizing the influences from these various breeds provides the modern Teddy Roosevelt Terrier with a keen sense of awareness and prey drive, an acute sense of smell. and a very high intellect. Although they tend to be aloof with strangers, they are devoted companion dogs with a strong desire to please and be near their owners at all times.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Telomian",
  "title": "Telomian - Wikipedia",
  "paragraph": "The Telomian is a type of dog found in isolated villages near the Telom River in the rainforests of the Malay Peninsula.[2] It has been introduced into the United States.[2][3] Some US-based breeders were selling these dogs as pure breds, which was dismissed with the Malaysian Kennel Association in a statement that these are pariah dogs and not a breed.[4]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tenterfield_Terrier",
  "title": "Tenterfield Terrier - Wikipedia",
  "paragraph": "The Tenterfield Terrier is a dog breed developed in Australia. They are a strong, active, hardy and agile dog, their smooth short coat making them 'easy care' family companions.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Brazilian_Terrier",
  "title": "Brazilian Terrier - Wikipedia",
  "paragraph": "The Brazilian Terrier is a breed of dog developed in Brazil. It is one of several terriers and one of the two worldwide recognized native breeds of Brazil.[2][3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Thai_Bangkaew_Dog",
  "title": "Thai Bangkaew Dog - Wikipedia",
  "paragraph": "The Thai Bangkaew Dog (Thai: ไทยบางแก้ว) is an Asian dog breed. It is a medium-sized spitz-type dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Thai_Ridgeback",
  "title": "Thai Ridgeback - Wikipedia",
  "paragraph": "The Thai Ridgeback (Thai: ไทยหลังอาน, RTGS: Thai Lang-An) is a dog from Thailand. The Thai Ridgeback is one of only three breeds that has a ridge of hair that runs along its back in the opposite direction to the rest of the coat. The other two are the Rhodesian Ridgeback and the Phu Quoc Ridgeback.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tibetan_Kyi_Apso",
  "title": "Tibetan Kyi Apso - Wikipedia",
  "paragraph": "The Tibetan Kyi Apso (Tibetan:  འདོགས་ཁྱི; Apso Do Khyi) is a medium to large sized breed of livestock guardian dog originating from Tibet and the Himalayas. It is considered an ancient and rare landrace, similar in appearance and stature to the related Tibetan Mastiff.[1]  \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tibetan_Mastiff",
  "title": "Tibetan Mastiff - Wikipedia",
  "paragraph": "The Tibetan Mastiff (Tibetan: འབྲོག་ཁྱི། འདོགས་ཁྱི། སེང་ཁྱི།, romanized: Drok chi/kyi; 'Dok kyi; Seng kyi, lit. 'Nomad-dog; chaining dog; lion-dog', THL: Do khyi, Wylie: 'brog khyi; 'dogs khyi; seng khyi)[a] is a large size Tibetan dog breed. Its double coat is medium to long, subject to climate, and found in a wide variety of colors, including solid black, black and tan, various shades of red (from pale gold to deep red) and bluish-gray (dilute black), and sometimes with white markings around neck, chest and legs.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tibetan_Spaniel",
  "title": "Tibetan spaniel - Wikipedia",
  "paragraph": "The Tibetan Spaniel is a breed of assertive, small dogs originating in Tibet. This breed is not a spaniel in the original meaning of the term; its breeding differs from other spaniels, and unlike true spaniels, which are gun dogs, the Tibetan spaniel is a companion dog. The spaniel name may have been given due to its resemblance to the bred-down lapdog versions of the hunting spaniels, such as the Cavalier King Charles spaniel.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tibetan_Terrier",
  "title": "Tibetan Terrier - Wikipedia",
  "paragraph": "The Tibetan Terrier is a medium-sized breed of dog that originated in Tibet.[1] Despite its name, it is not a member of the terrier group. The breed was given its English name by European travelers due to its resemblance to known terrier breeds.[2] The Tibetan name for the breed, Tsang Apso, roughly translates to \"shaggy or bearded (\"apso\") dog, from the province of Tsang\". Some old travelers' accounts refer to the dog as Dokhi Apso or \"outdoor\" Apso, indicating a shaggy or bearded working dog which lives outdoors.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tonya_Finosu",
  "title": "Tonya Finosu - Wikipedia",
  "paragraph": "The Tonya Finosu is a white spitz dog indigenous to Trabzon, Turkey, especially the city of Tonya.[1] Tonya Finosu are valued both for their natural suspicion of strangers as well as their playfulness and affection with their family.[2][3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tornjak",
  "title": "Tornjak - Wikipedia",
  "paragraph": "The Tornjak (pronounced [torɲâk]), is a breed of livestock guardian dog native to Bosnia and Herzegovina and Croatia.[1] The name comes from the local word for a sheep pen, \"tor\". The foundation stock is made up from genetically homogeneous landrace shepherding dogs dispersed in the mountains and valleys of the region.[2] They are molosser-type mountain dogs,[1] similar to other livestock guardian breeds of the region, the Šarplaninac, Bucovina Shepherd Dog, and the Greek Shepherd.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tosa_(dog)",
  "title": "Tosa (dog) - Wikipedia",
  "paragraph": "The Tosa Inu (土佐, also called the Tosa-Ken and Japanese Mastiff) is a breed of dog of Japanese origin that is considered rare. It was originally bred in Tosa, Shikoku (present day Kōchi), as a fighting dog and is the only breed still used (legally) in Japanese dog fighting.[1] Ownership is restricted in some countries as a dangerous breed.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Toy_Fox_Terrier",
  "title": "Toy Fox Terrier - Wikipedia",
  "paragraph": "The Toy Fox Terrier is a small terrier breed of dog, directly descended from the larger Smooth Fox Terrier but since 1936, it has been registered in the USA with the UKC as a separate breed.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Toy_Manchester_Terrier",
  "title": "Toy Manchester Terrier - Wikipedia",
  "paragraph": "The Toy Manchester Terrier is a breed of dog, categorized as a terrier. The breed was bred down in size in North America from the Manchester Terrier, and is placed in the Toy Group by the American Kennel Club and the Canadian Kennel Club (the Manchester Terrier is placed in the Terrier Group). Neither the Fédération Cynologique Internationale nor The Kennel Club recognize a Toy variety of the Manchester Terrier.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Transylvanian_Hound",
  "title": "Transylvanian Hound - Wikipedia",
  "paragraph": "The Transylvanian Hound (Hungarian: erdélyi kopó [ˈɛrdeːji kopoː]; Romanian: copoi ardelenesc Romanian pronunciation: [ko'poj ardele'nesk]; also known as the Transylvanian Scent Hound or Hungarian Hound)[1] is a dog breed originating from Hungary and Transylvania (Transylvania was part the Kingdom of Hungary-nowadays Romania) and was historically primarily used for hunting. It is a strong, medium-sized scent hound, characterized by a black body, with tan and sometimes white markings on the muzzle, chest and extremities, and distinctive tan eyebrow spots. It has a high-pitched bark for a dog of its size. The breed was rescued from extinction by focused breeding efforts in the late 20th century. There were formerly two varieties, the tall and the short, developed for different kinds of hunting in the Middle Ages. Only the tall variety survives today.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Treeing_Cur",
  "title": "Treeing Cur - Wikipedia",
  "paragraph": "The Treeing Cur is a breed of dog that originated in the mid-west of the United States. It was first recognized by United Kennel Club on November 1, 1998, due to the efforts of Alex and Ray Kovac. \"Most Cur breeders were not well off and so they required a dog that could serve multiple purposes: hunter, guardian, and stock dog. The result was the Treeing Cur, which is the most varied in size and colors of the Cur breeds\", according to United Kennel Club. They are primarily used to tree squirrels, raccoons, opossum, wild boar, bears, mountain lion, bobcat as well as to hunt big game.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Treeing_Feist",
  "title": "Treeing Feist - Wikipedia",
  "paragraph": "The Treeing Feist is a  breed of feist from the Southeastern United States. Originally considered a single breed, the Mountain Feist is now considered a separate breed with both being separately recognized by the United Kennel Club.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Treeing_Tennessee_Brindle",
  "title": "Treeing Tennessee Brindle - Wikipedia",
  "paragraph": "The Treeing Tennessee Brindle is a breed of cur. Since 1995, its records have been maintained through the American Kennel Club's Foundation Stock Service Program.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Treeing_Walker_Coonhound",
  "title": "Treeing Walker Coonhound - Wikipedia",
  "paragraph": "The Treeing Walker Coonhound is a breed of hound descended from the English and American Foxhounds. The breed originated in the United States when a stolen dog known as \"Tennessee Lead\" was crossed into the Walker Hound in the 19th century.[1] The Treeing Walker Coonhound was recognized officially as a breed by the United Kennel Club in 1945 and by the American Kennel Club in 2012.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Trigg_Hound",
  "title": "American Foxhound - Wikipedia",
  "paragraph": "The American Foxhound is a breed of dog, closely related to the English Foxhound. They are scent hounds, bred to hunt foxes by scent. United States Founding Father George Washington contributed to the breed's development.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tyrolean_Hound",
  "title": "Tyrolean Hound - Wikipedia",
  "paragraph": "The Tyrolean Hound is a breed of dog that originated in Tyrol also called the Tiroler Bracke or Tyroler Bracke. They are scent hounds that descended from the Celtic hounds in the late 1800s, mainly for their hunting skills. They are hardworking, passionate, and independent dogs not known for their size, but rather their intelligence. For that reason, hunters can regularly use these dogs to catch their prey, wounded or otherwise. Their ability to stretch over long distances, on rough hot or cold terrain for their prey is also another perk of keeping this dog by your side. Hunters do have to worry about injuries to their dog, however, along with the common injuries that these dogs obtain throughout their life, like hip dysplasia or ear infections. Barring any injuries, these dogs tend to live an energetic life for about 12-14 years, and tend to be an overall healthy and robust dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Vikhan",
  "title": "Vikhan - Wikipedia",
  "paragraph": "The Vikhan is a breed of livestock guardian dog from Pakistan and India.[1] In Pakistan, it is found specifically the Chitral region of the Khyber Pakhtunkhwa Province,[2][3] while in India, it is found in Himachal Pradesh. The breed's name is derived from the Sanskrit word \"vikh\", meaning broken, noseless or hermit. It is possible the name was given due to the broken, uneven land on which it is found, or because the breed often lives in solitude from other parts of the Indian sub-continent.[2][3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Villano_de_Las_Encartaciones",
  "title": "Villano de Las Encartaciones - Wikipedia",
  "paragraph": "The Villano de Las Encartaciones is a Spanish breed of large working dog from the region of Las Encartaciones in the province of Biscay, in the Basque country; it is found also in Álava, in eastern Cantabria and in northern Burgos.[2]: 596  The traditional use of the dogs is in management of the Monchina breed of cattle of Cantabria and the País Vasco,[3] and particularly to assist with bringing the cattle down from the mountain pastures between October and December. In 2009 there were fewer than 200 dogs registered in the studbook.[2]: 596 \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Villanuco_de_Las_Encartaciones",
  "title": "Villanuco de Las Encartaciones - Wikipedia",
  "paragraph": "The Villanuco de Las Encartaciones (Basque: Enkarterriko Billanuko, Cantabrian: Villanucu) is a Spanish breed of small dog of ratter type. It originates in the comarca of Enkarterri (Spanish: Las Encartaciones) in the Basque Autonomous Community in northern Spain. It is one of five Basque breeds of dog, the others being the Basque Shepherd Dog, the Erbi Txakur, the Pachón Navarro and the Villano de Las Encartaciones,[2][3] and one of fourteen animal breeds native to the País Vasco.[4]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Vizsla",
  "title": "Vizsla - Wikipedia",
  "paragraph": "The Vizsla (Hungarian: [ˈviʒlɒ])[a] is a dog breed from Hungary and belongs to the Federation Cynologique Internationale (FCI) group 7 (Pointing Dogs),[3] the Canadian Kennel Club (CKC) group 1 (Sporting group),[4] and the American Kennel Club (Sporting group).[5] The Hungarian or Magyar Vizsla or Smooth-Haired Vizsla are sporting dogs and loyal companions. The Vizsla's medium size is one of the breed's most appealing characteristics. As a hunter of fowl and upland game, the Vizsla has held a prominent position among sporting dogs – that of household companion and family dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Volkosob",
  "title": "Wolfdog - Wikipedia",
  "paragraph": "A wolfdog is a canine produced by the mating of a domestic dog (Canis familiaris) with a gray wolf (Canis lupus), eastern wolf (Canis lycaon), red wolf (Canis rufus), or Ethiopian wolf (Canis simensis) to produce a hybrid.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Volpino_Italiano",
  "title": "Volpino Italiano - Wikipedia",
  "paragraph": "The Volpino Italiano[a] or Volpino is an Italian breed of dog of Spitz type.[2] It is closely related to the Pomeranian[3]: 234 [4] and to the German Spitz.[5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Weimaraner",
  "title": "Weimaraner - Wikipedia",
  "paragraph": "Weim\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Welsh_Hound",
  "title": "Welsh Hound - Wikipedia",
  "paragraph": "The Welsh Hound (Welsh: Bytheiad or Ci Hela Cymreig) is a breed of hunting dog of the foxhound type, indigenous to Wales.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Welsh_Sheepdog",
  "title": "Welsh Sheepdog - Wikipedia",
  "paragraph": "The Welsh Sheepdog (Welsh: Ci Defaid Cymreig, pronounced [kiː ˈdɛvaɪd kəmˈrɛɨɡ]) is a breed of herding dog of medium size from Wales. \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Welsh_Springer_Spaniel",
  "title": "Welsh Springer Spaniel - Wikipedia",
  "paragraph": "The Welsh Springer Spaniel (Welsh: Llamgi Cymru) is a breed of dog and a member of the spaniel family. Thought to be comparable to the old Land Spaniel, they are similar to the English Springer Spaniel and historically have been referred to as both the Welsh Spaniel and the Welsh Cocker Spaniel. They were relatively unknown until a succession of victories in dog trials by the breed increased its popularity. Following recognition by The Kennel Club in 1902, the breed gained the modern name of Welsh Springer Spaniel. The breed's coat only comes in a single colour combination of white with red markings, usually in a piebald pattern. Loyal and affectionate, they can become very attached to family members and are wary of strangers. Health conditions are limited to those common among many breeds of dog, although they are affected more than average by hip dysplasia and some eye conditions. They are a working dog, bred for hunting, and while not as rare as some varieties of spaniel, they are rarer than the more widely known English Springer Spaniel with which they are sometimes confused.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Welsh_Terrier",
  "title": "Welsh Terrier - Wikipedia",
  "paragraph": "The Welsh Terrier (Welsh: Daeargi Cymreig) originates from Wales and was originally bred for hunting fox, rodents and badger; [1] but during the last century, it has mainly been bred for showing. Despite this, it has retained its terrier strength of character. The Welsh Terrier has been claimed to be the oldest existing dog breed in the UK.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/West_Country_Harrier",
  "title": "West Country Harrier - Wikipedia",
  "paragraph": "The West Country Harrier, sometimes called Somerset Harrier, is a breed of scent hound from the south west of England that is used to hunt hare in packs. The West Country Harrier is often considered to be a variety of the more common Harrier breed, which is sometimes referred to as the Studbook Harrier.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/West_Highland_White_Terrier",
  "title": "West Highland White Terrier - Wikipedia",
  "paragraph": "The West Highland White Terrier, commonly known as the Westie, is a breed of dog from Scotland with a distinctive white harsh coat with a somewhat soft white undercoat. It is a medium-sized terrier, although with longer legs than other Scottish breeds of terrier. It has a white double coat of fur which fills out the dog's face, giving it a rounded appearance.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/West_Siberian_Laika",
  "title": "West Siberian Laika - Wikipedia",
  "paragraph": "The West Siberian Laika or WSL, is a breed of spitz–type hunting dog. Russian publications indicate that the term West Siberian Laika loosely applied to hunting dogs originating with the Mansi and Khanty people in Ural and West Siberia, but there were no standards or registrations of WSL as such until 1930. Then WWII disrupted it for a while, but systematic breeding with registrations resumed after the war ended, in 1946. This was the time the breed began taking modern shape.  Before that hunters only knew of Mansi Laika and Khanty Laika. In early 1960 many hunters in Ural still preferred the term Mansi Laika, when speaking of West Siberian Laika.[1] In Russian language, the term Laika originated from the word layat that means to bark. The word Laika simply means barker. Any hunting Laika is a bark pointer (pointing at animal of interest by barking and staying with the animal[2] ). It is a versatile dog depending on use and environment, but in certain parts of the country they have become more specialized.[3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Westphalian_Dachsbracke",
  "title": "Westphalian Dachsbracke - Wikipedia",
  "paragraph": "The Westphalian Dachsbracke is a small, short-legged scenthound, a breed of dog originating in Westphalia, a region of Germany. The Westphalian Dachsbracke was used in Sweden to develop the Drever.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Wetterhoun",
  "title": "Wetterhoun - Wikipedia",
  "paragraph": "The Wetterhoun (translated into English as the Frisian Water Dog) is a breed traditionally used as a hunting dog for small game and waterfowl and native to the province of Friesland in the Netherlands. The name of the breed comes from the West Frisian Wetterhûn, meaning \"water dog.\" The plural of Wetterhoun is Wetterhounen in Frisian. The breed may also be called the Otterhoun (not to be confused with the Otterhound) or Dutch Spaniel, although it is not a Spaniel-type dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Whippet",
  "title": "Whippet - Wikipedia",
  "paragraph": "The Whippet is a British breed of medium-sized dog of sighthound type. It is closely related to the  Greyhound and – apart from its smaller size – closely resembles it. It has sometimes been described as \"the poor man's greyhound\".[4] It is kept as a companion dog, and also for showing and for amateur racing and lure coursing. It has the highest running speed of any breed of its weight, and may have the fastest acceleration of any dog.[5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/White_Shepherd",
  "title": "White Shepherd - Wikipedia",
  "paragraph": "The White Shepherd is a variety of the German Shepherd bred in the United States. Although white-coated German Shepherds have been known in Europe as early as 1882, in 1933 the breed standard was amended in their native Germany, banning white-coated dogs from registration.[1][2] In the United States and Canada the coloration had gained a following and in 1969 a breed club was formed specifically for white-coloured German Shepherds, calling their variety the White Shepherd.[1][2] The variety is recognized as a separate breed by the United Kennel Club.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/White_Swiss_Shepherd_Dog",
  "title": "White Swiss Shepherd Dog - Wikipedia",
  "paragraph": "The White Swiss Shepherd Dog or Berger Blanc Suisse (German: Weisser Schweizer Schäferhund, Italian: Pastore Svizzero Bianco) is a Swiss breed of shepherd dog. It descends from North American White Shepherds imported to Switzerland; the White Shepherd itself descends from white-coloured purebred German Shepherds.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Wire_Fox_Terrier",
  "title": "Wire Fox Terrier - Wikipedia",
  "paragraph": "The Wire Fox Terrier (also known as Wire Hair Fox Terrier or Wirehaired Terrier)[1] is a breed of dog, one of many terrier breeds. It is a fox terrier, and although it bears a resemblance to the Smooth Fox Terrier, they are believed to have been developed separately. It originates from England.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Wirehaired_Pointing_Griffon",
  "title": "Wirehaired Pointing Griffon - Wikipedia",
  "paragraph": "The Wirehaired Pointing Griffon (also called the Korthals  Griffon and the Griffon d'arrêt à poil dur Korthals in France and Quebec) is a breed of dog used in hunting as a gundog.  It is sometimes considered to be Dutch in ancestry, due to the nationality of the breed founder, Eduard Karel Korthals.  History records the progression of the development of the breed through Biebesheim am Rhein, Germany where the founder established the Ipenwoud kennel and the breed type was established and then into France where it is now recognized.  Others consider the Griffon to be a German breed because Korthals' kennel, Ipenwoud, was located in Biebesheim am Rhein, Germany.  It was there for over twenty years that Korthals dedicated his life to the development  and perfection of the Korthals Griffon.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Wirehaired_Vizsla",
  "title": "Wirehaired Vizsla - Wikipedia",
  "paragraph": "The Hungarian Wirehaired Vizsla (/ˈviːʃlə/ VEESH-lə; Hungarian: [ˈviʒlɒ]) is the English name of the Drótszőrű Magyar Vizsla, a dog breed originating in Hungary, with the name translating directly as Hungarian wirehaired pointer.[1] The English plural is vizslas or sometimes vizslak,[2][3] based on the Hungarian plural vizslák [ˈviʒlaːk]). \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Xiasi_Dog",
  "title": "Xiasi Dog - Wikipedia",
  "paragraph": "Xiasi Dog (Chinese: 下司犬)[1] or Lower Division Dog is a breed of tugou named after the village of Xiasi, Guizhou Province in China where they have been raised by the Miao people for thousands of years.[2][3]  Historically bred as a hunting dog and watchdog, the Xiasi Dog is prized today for bringing wealth to the family.[1][3] Today the breed is critically endangered with low genetic diversity and an estimate of only 270 purebred Xiasi left.[2][4] Xiasi Dogs are now accepted in most Chinese dog shows.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Mexican_Hairless_Dog",
  "title": "Xoloitzcuintle - Wikipedia",
  "paragraph": "The Xoloitzcuintle (or Xoloitzquintle, Xoloitzcuintli, or Xolo) is one of several breeds of hairless dog. It is found in standard, intermediate, and miniature sizes. The Xolo also comes in a coated variety, totally covered in fur. Coated and hairless can be born in the same litter as a result of the same combination of genes. The hairless variant is known as the Perro pelón mexicano or Mexican hairless dog.[1] It is characterized by its duality, wrinkles, and dental abnormalities, along with a primitive temper. In Nahuatl, from which its name originates, it is xōlōitzcuintli [ʃoːloːit͡sˈkʷint͡ɬi] (singular)[2] and xōlōitzcuintin [ʃoːloːit͡sˈkʷintin] (plural).[2] The name comes from the god Xolotl that, according to ancient narratives, is its creator and itzcuīntli [it͡sˈkʷiːnt͡ɬi], meaning 'dog' in the Nahuatl language.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Yakutian_Laika",
  "title": "Yakutian Laika - Wikipedia",
  "paragraph": "The Yakutian Laika (Russian: Якутская лайка) is an ancient working dog breed that originated in the Arctic seashore of the Sakha (Yakutia) Republic. Yakutian Laikas are multipurpose laikas, with many lineages able to herd reindeer, hunt game and/or pull a sled.[1] They are registered with the Russian Kennel Club,[2] the FCI[3] and the AKC's Foundation Stock Service in 2017.[4][5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Yorkshire_Terrier",
  "title": "Yorkshire Terrier - Wikipedia",
  "paragraph": "The Yorkshire Terrier is a British breed of toy dog of terrier type. It is among the smallest of the terriers and indeed of all dog breeds, with a weight of no more than 3.2 kg.[1] It originated in the nineteenth century in the English county of Yorkshire, for which it is named.[2] Their coats are typically tan on the head with a dark steel-grey body, but they can come in a variety of colors.[1][3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Zerdava",
  "title": "Zerdava - Wikipedia",
  "paragraph": "The Zerdava (Georgian: მეკვერნე) is an aboriginal laika dog breed native to  Black Sea region of Turkey and Georgia.[1][2] Zerdava are traditionally used as guard and hunting dog and are especially prized for boar hunting.[3][2] The name “Zerdava” is Slavic for mustelid, possibly in reference to their Marten-brown color or their treeing behavior when hunting martens.[3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Abyssinian_sand_terrier",
  "title": "Abyssinian sand terrier - Wikipedia",
  "paragraph": "African hairless dogs, also known as Abyssinian sand terriers, were hairless dogs from Africa. It is unknown if any examples still exist.[1][2][3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Alaunt",
  "title": "Alaunt - Wikipedia",
  "paragraph": "The Alaunt is an extinct type of dog which came in different forms,[1][2] with the original possibly having existed in North Caucasus, Central Asia and Europe from ancient times.  \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Alpine_Mastiff",
  "title": "Alpine Mastiff - Wikipedia",
  "paragraph": "The Alpine mastiff was a type of molosser, or \"flock-guardian phenotype\" with the same or similar ancestral origins as the Saint Bernard.[1] However, unlike the Saint Bernard, the Alpine mastiff was never a bona fide breed. It is believed to be the progenitor of the modern English Mastiff,[2] as well as other breeds that derive from these types of dogs or that are closely related. M. B. Wynn wrote, \"In 1829 a vast light brindle dog of the old Alpine mastiff breed, named L'Ami, was brought from the convent of Great St. Bernard area, and exhibited in London and Liverpool as the largest dog in England.\" William Cavendish, 5th Duke of Devonshire, is believed to have bred Alpine mastiffs at Chatsworth House. It was earlier thought that ears of the Alpine mastiffs were cut to prevent them becoming frost bitten.[3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Belgian_Mastiff",
  "title": "Belgian Mastiff - Wikipedia",
  "paragraph": "The Belgian Mastiff, also known as the Chien de Trait Belge, Mâtin Belge and Belgian Draught Dog, was a breed of mastiff-type dog from the Low Countries that was used as a draught dog. It is believed to be extinct.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Black_and_Tan_Terrier",
  "title": "Black and Tan Terrier - Wikipedia",
  "paragraph": "The Black and Tan Terrier was a broad breed or type of terrier that was one of the earliest terrier breeds. Although it is now extinct, it is believed to be the ancestor of all modern Fell Terrier breeds and the Welsh Terrier, a breed recognised by The Kennel Club.[citation needed]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Blue_Paul_Terrier",
  "title": "Bull and terrier - Wikipedia",
  "paragraph": "Bull and terrier was a common name for bulldog and terrier crossbreeds of the early 1800s. Other names included half-and-halfs and half-breds.[2] It was a time in history when, for thousands of years, dogs were classified by use or function, unlike the modern pets of today that were bred to be conformation show dogs and family pets.[3]: 14  Bull and terrier crosses were originally bred to function as fighting dogs for bull and bear baiting, and other popular blood sports during the Victorian era. The sport of bull baiting required a dog with attributes such as tenacity and courage, a wide frame with heavy bone, and a muscular, protruding jaw. By crossing bulldogs with various terriers from Ireland and Great Britain, breeders introduced \"gameness and agility\" into the hybrid mix.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Braque_Dupuy",
  "title": "Braque Dupuy - Wikipedia",
  "paragraph": "The Braque Dupuy, also known as the Dupuy Pointer, was a breed of pointer from the Poitou region of France. It is believed to be extinct.[1][2][3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Buckhound",
  "title": "Buckhound - Wikipedia",
  "paragraph": "The Buckhound was a breed of now extinct scent hound from England; they were used to hunt fallow deer in packs.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bull_and_terrier",
  "title": "Bull and terrier - Wikipedia",
  "paragraph": "Bull and terrier was a common name for bulldog and terrier crossbreeds of the early 1800s. Other names included half-and-halfs and half-breds.[2] It was a time in history when, for thousands of years, dogs were classified by use or function, unlike the modern pets of today that were bred to be conformation show dogs and family pets.[3]: 14  Bull and terrier crosses were originally bred to function as fighting dogs for bull and bear baiting, and other popular blood sports during the Victorian era. The sport of bull baiting required a dog with attributes such as tenacity and courage, a wide frame with heavy bone, and a muscular, protruding jaw. By crossing bulldogs with various terriers from Ireland and Great Britain, breeders introduced \"gameness and agility\" into the hybrid mix.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Bullenbeisser",
  "title": "Bullenbeisser - Wikipedia",
  "paragraph": "The Bullenbeisser, also known as the German Bulldog, is an extinct breed of dog known for its strength and agility. The breed was closely related to the Bärenbeisser (some authorities believe that the two breeds were one and the same; the names mean \"Bull-biter\" and \"Bear-biter\", respectively, and it is possible they were names for whether the dog was used for bull-baiting or bear-baiting) and was an ancestor to the modern Boxer. It was, in all aspects, similar to the present Alano Español (Spanish Bulldog) and very similar to the Dogo Argentino, not only in aspect, but also in usage. There were two regional varieties, the large Danziger Bullenbeisser and the small Brabanter Bullenbeisser. The breed is now extinct.[1][2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Chien-gris",
  "title": "Chien-gris - Wikipedia",
  "paragraph": "The Chien-gris a.k.a. Gris de Saint-Louis (Grey Saint Louis Hound) is an extinct breed of dog which originated in Medieval times. Like the Chien de Saint-Hubert, it was a scent hound, and formed part of the royal packs of France, which were composed, from about 1250 till 1470, exclusively of hounds of this type.[1][page needed] According to King Charles IX,[2] (1550–1574) they supposedly were introduced to France through Saint Louis (i.e. King Louis IX, 1226–1270), who had encountered these hounds while a prisoner during the Crusades, and subsequently received some as a gift. Old writers on hunting liked to ascribe an ancient and remote origin to their hounds, and these were claimed to be originally from Tartary. They were large, and, even though they did not have such good noses, were preferred by the Kings to the St Huberts, which were said to be only of medium size.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Chiribaya_Dog",
  "title": "Chiribaya Dog - Wikipedia",
  "paragraph": "The Chiribaya Dog (Spanish: perro Chiribaya) or Peruvian Shepherd Dog (perro pastor Peruano) is an extinct pre-Columbian breed of dog from the southwest of Peru. It has been established that it was a  llama herding dog. The dogs were not only an important part of the social structure of the ancient Peruvians, but they received special treatment after death as well.[1] The remains were 1,000 years old.[2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/C%C3%B3rdoba_fighting_dog",
  "title": "Córdoba fighting dog - Wikipedia",
  "paragraph": "The (old) Córdoba fighting dog (Spanish: viejo perro de pelea cordobés), was a type of dog, indigenous to Córdoba, Argentina, that resulted from crossbreeding old mastiff types of unknown pedigree. They were purposely bred for the sport of dog fighting until the early 20th century, when Antonio Nores Martinez and his brother Agustin were inspired to develop a dog that could hunt wildcats, boar, fox and other vermin that were harmful to the region's agriculture.[1]  Over time, Martinez developed a new breed of pedigreed dog by repeatedly crossbreeding the Córdoba fighting dogs with modern breeds of dogs that were internationally recognized, such as the Boxer, Dogue de Bordeaux, Bulldog, Pointer, Bull Terrier, Irish Wolfhound, Great Pyrenees, and Great Dane. As a result of that purposeful breeding, the Córdoba fighting dog was transformed into the white hunting dog we know as the Dogo Argentino.[1][2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Cumberland_Sheepdog",
  "title": "Cumberland Sheepdog - Wikipedia",
  "paragraph": "The Cumberland sheepdog is an extinct dog breed related to the border collie and other old working collie types.  It is claimed to be one of the ancestors of the Australian shepherd[1] and in the early part of the 20th century some Cumberland sheepdogs were being referred to as border collies and may have been absorbed into the latter breed.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Cur",
  "title": "Cur - Wikipedia",
  "paragraph": "A cur was a dog breed used by cattle drovers in England.\nThe breed is now extinct. In the United States a short-haired dog used in hunting and herding is called \"cur-tailed\", or \"cur\" for short.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Dalbo_dog",
  "title": "Dalbo dog - Wikipedia",
  "paragraph": "The Dalbo dog (Dalbohund) or Dalsland Mastiff is an extinct livestock guardian dog breed from Sweden.[1][2][3][4][5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Dogo_Cubano",
  "title": "Dogo Cubano - Wikipedia",
  "paragraph": "The Dogo Cubano, also called the Cuban Bloodhound or Cuban Bullmastiff, is an extinct Cuban breed of domestic dog. It was of the dogo sub-type of the bullmastiff dog type, which as a general class was used for bull-baiting[1]: 369  and dog fighting. The variety was introduced in Cuba to capture runaway slaves (cimarrones). After the abolition of slavery, they ceased to exist as a distinct population over time.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Dumfriesshire_hound",
  "title": "Dumfriesshire hound - Wikipedia",
  "paragraph": "Dumfriesshire Black and Tan Foxhounds were a pack of foxhounds kennelled at Glenholm Kennels, Kettleholm, near Lockerbie until they were disbanded in 2001. They were established by Sir John Buchanan Jardine, author of Hounds of the World (1937),[1][page needed] after the First World War. The hounds are believed to have originally been created by crossing Bloodhound/Grand Bleu de Gascogne/English Foxhound. They were larger than standard foxhounds and were black and tan. There is a pack descended from them in France, known as Equipage de la Roirie, and they are used also by the Equipage Pique Avant Nivernais as staghounds, along with the Français Blanc et Noir hound.[citation needed]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/English_Water_Spaniel",
  "title": "English Water Spaniel - Wikipedia",
  "paragraph": "The English Water Spaniel is a breed of dog that has been extinct since the first part of the 20th century, with the last specimen seen in the 1930s. It was best known for its use in hunting waterfowl and for being able to dive as well as a duck. It is described as  similar to a Collie or to a cross between a Poodle and a Springer Spaniel with curly fur and typically in a white and liver/tan pattern.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/English_White_Terrier",
  "title": "English White Terrier - Wikipedia",
  "paragraph": "The English White Terrier (also known as the White English Terrier)[1][2] is an extinct breed of dog. The English White Terrier is the failed show ring name of a pricked-ear version of the white fox-working terriers that have existed in Great Britain since the late 18th century.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Terceira_Mastiff",
  "title": "Terceira Mastiff - Wikipedia",
  "paragraph": "The Terceira Mastiff  (Portuguese: Cão de Fila da Terceira) is an extinct Portuguese dog landrace, also known as the Rabo Torto (rabo=tail, torto=curled/twisted).[1][page needed]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Fuegian_dog",
  "title": "Fuegian dog - Wikipedia",
  "paragraph": "The Fuegian dog (Spanish: perro yagán, perro fueguino), also known as the Yahgan dog, is an extinct domesticated canid. It was a domesticated form of the culpeo (Lycalopex culpaeus).[1] The culpeo is similar in build to true foxes (tribe Vulpini) but is actually more closely related to wolves and jackals, being placed in a separate genus within the South American foxes or zorros. The Fuegian dog is not descended from domestic dogs, which were domesticated from an ancestor shared with the modern gray wolf (Canis lupus), nor from the domesticated silver fox which was domesticated from a melanistic population of the red fox (Vulpes vulpes).\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Grand_Fauve_de_Bretagne",
  "title": "Grand Fauve de Bretagne - Wikipedia",
  "paragraph": "The Grand Fauve de Bretagne was a breed of scenthound from Brittany used to hunt wolves and wild boar.[1][2][3] The Grand Fauve de Bretagne were large rough-coated hounds, their coats were short, dense and harsh, and they were a uniform pale golden-brown in colour.[2][3] Grand Fauve de Bretagnes were renowned for their unruly natures, being very difficult to control; their temperament suited them for hunting dangerous game like wolf and wild boar, but due to their unruliness they were also known to kill sheep and goats against their huntsman's wishes.[2][3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Halls_Heeler",
  "title": "Halls Heeler - Wikipedia",
  "paragraph": "The Halls Heeler was a dog bred by Thomas Simpson Hall to herd cattle on the Hall family's extensive properties in northwestern New South Wales in the 19th century.  On Dartbrook Station, in the Upper Hunter Valley, Hall selectively crossed the offspring of Northumberland Drover's Dogs (Border Collie lineage) that he had imported, with the progeny of dingoes that he had tamed. By 1840 he had bred the type of dog that he needed to control cattle on the massive runs that his family owned, and until he died in 1870 few of these dogs were owned and used by anyone outside the Hall family and their workers.[1] However the death of Thomas Hall and the break-up of the Hall estate coincided with the development of the dog show, and an interest in breeding dogs to specific criteria or standards. The Halls Heeler was further developed into two contemporary dog breeds, the Australian Cattle Dog and the Australian Stumpy Tail Cattle Dog.[1] \n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Hare_Indian_Dog",
  "title": "Hare Indian Dog - Wikipedia",
  "paragraph": "The Hare Indian dog is an extinct domesticated canine; possibly a breed of domestic dog, coydog, or domesticated coyote; formerly found and originally bred in northern Canada by the Hare Indians for coursing.  It had the speed and some characteristics of the coyote, and the domesticated temperament and other characteristics of a domestic dog.  It gradually lost its usefulness as aboriginal hunting methods declined, and became extinct or lost its separate identity through interbreeding with dogs in the 19th century, though some claim the breed still exists in modified form.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Hawaiian_Poi_Dog",
  "title": "Hawaiian Poi Dog - Wikipedia",
  "paragraph": "The Hawaiian Poi Dog (Hawaiian: ʻīlio or ʻīlio mākuʻe) is an extinct breed of pariah dog from Hawaiʻi which was used by Native Hawaiians as a spiritual protector of children and as a source of food.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/King%27s_White_Hound",
  "title": "King's White Hound - Wikipedia",
  "paragraph": "The King's White Hound, the Chien Blanc du Roi in French, was a now extinct breed of scent hound from France. The breed was said to be the favourite of the French kings from Louis XI to Louis XIV.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Kur%C4%AB",
  "title": "Kurī - Wikipedia",
  "paragraph": "Kurī is the Māori name for the extinct Polynesian dog. It was introduced to New Zealand by the Polynesian ancestors of the Māori during their migration from East Polynesia in the 13th century AD. According to Māori tradition, the demigod Māui transformed his brother-in-law Irawaru into the first dog.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Lapponian_Shepherd",
  "title": "Lapponian Shepherd - Wikipedia",
  "paragraph": "The Lapponian Shepherd (Lapinpaimenkoira)[1] or Cockhill's Finnish Lapphound[2] (Kukonharjunkoira)[1] is an extinct dog breed originating from Finland. Despite its name, it did not come from Lapland, but from the southern parts of the country.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Limer",
  "title": "Limer - Wikipedia",
  "paragraph": "A limer, or lymer /ˈlaɪmər/, was a kind of dog, a scenthound, used on a leash in medieval times to find large game before it was hunted down by the pack. It was sometimes known as a lyam hound/dog  or lime-hound, from the Middle English word lyam, meaning 'leash'. The French cognate limier has sometimes been used for the dogs in English as well. The type is not to be confused with the bandog, which was also a dog controlled by a leash, typically a chain, but was a watchdog or guard dog.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Marquesan_Dog",
  "title": "Marquesan Dog - Wikipedia",
  "paragraph": "The Marquesan Dog or Marquesas Islands Dog is an extinct breed of dog from the Marquesas Islands. Similar to other strains of Polynesian dogs, it was introduced to the Marquesas by the ancestors of the Polynesian people during their migrations. Serving as a tribal totems and religious symbols, they were sometimes consumed as meat although less frequently than in other parts of the Pacific because of their scarcity. These native dogs are thought to have become extinct before the arrival of Europeans, who did not record their presence on the islands. Petroglyphic representations of dogs and the archaeological remains of dog bones and burials are the only evidence that the breed ever existed. Modern dog populations on the island are the descendants of foreign breeds later reintroduced in the 19th century as companions for European settlers.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Molossus_(dog)",
  "title": "Molossus (dog) - Wikipedia",
  "paragraph": "The Molossus (Greek: Μολοσσός, romanized: Molossós; also known as the Molossian hound, Epirus mastiff) was a breed of dog from Ancient Greece.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Moscow_Water_Dog",
  "title": "Moscow Water Dog - Wikipedia",
  "paragraph": "The Moscow Water Dog, also known as the Moscow Diver, Moscow Retriever or Moskovsky Vodolaz, was a little-known dog breed derived from the Newfoundland, Caucasian Shepherd Dog and East European Shepherd. It is now extinct, but was used in the development of the Black Russian Terrier.[citation needed] The Moscow Water Dog was produced only by the Red Star Kennels, the state-operated organization chartered to provide working dogs for the armed services of the Soviet Union. The breeding program was discontinued as the dogs would attack drowning victims instead of saving them.[citation needed]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Norfolk_Spaniel",
  "title": "Norfolk Spaniel - Wikipedia",
  "paragraph": "The Norfolk Spaniel or Shropshire Spaniel is an extinct breed of dog since the early 20th century. It was originally thought to have originated from the work of one of the Dukes of Norfolk, but this theory was disproven after being in doubt during the later part of the 19th century. The term was used to designate springer type spaniels that were neither Sussex nor Clumber Spaniels, and attempts were made to use it to specify a breed that would later become known as the English Springer Spaniel.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Norman_Hound",
  "title": "Norman Hound - Wikipedia",
  "paragraph": "The Norman Hound is a now extinct breed of scent hound from France.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/North_Country_Beagle",
  "title": "North Country Beagle - Wikipedia",
  "paragraph": "The North Country Beagle, Northern Hound or Northern Beagle was a breed of dog that existed in Britain probably until early in the 19th century. The exact date of its extinction is not known; it is likely that it was gradually interbred with other breeds, particularly the modern Beagle, until the genuine North Country Beagle bloodline ceased to exist.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Old_Croatian_Sighthound",
  "title": "Old Croatian Sighthound - Wikipedia",
  "paragraph": "The Old Croatian Sighthound (Croatian: hrti, 'greyhound'), also known as the Old Bosnian Sighthound, is an extinct breed of sighthound from the Balkan countries of Bosnia–Herzegovina and Croatia.[1][2]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Old_English_Bulldog",
  "title": "Old English Bulldog - Wikipedia",
  "paragraph": "The Old English Bulldog is an extinct breed of dog.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Old_Spanish_Pointer",
  "title": "Old Spanish Pointer - Wikipedia",
  "paragraph": "The Old Spanish Pointer, or Perro de Punta Español, is an extinct breed of dog originating in Spain, believed to be the ultimate ancestor of almost all pointing dogs.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Old_Welsh_Grey_Sheepdog",
  "title": "Old Welsh Grey Sheepdog - Wikipedia",
  "paragraph": "The Welsh Grey or Old Welsh Grey was a breed of sheepdog native to Wales. It is probably now extinct.[1]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Paisley_Terrier",
  "title": "Paisley Terrier - Wikipedia",
  "paragraph": "The Paisley Terrier was a breed of terrier-type dog that is now extinct. Originating in Scotland, the Paisley Terrier was bred primarily as a pet and showdog version of the Skye Terrier, and was the progenitor of today's Yorkshire Terrier. The breed was called the Paisley Terrier since most of the dogs came from that location, but it was also called the Clydesdale Terrier, for another location in the Clyde Valley where the dogs were bred.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Polynesian_Dog",
  "title": "Polynesian Dog - Wikipedia",
  "paragraph": "The Polynesian Dog refers to a few extinct varieties of domesticated dogs from the islands of Polynesia. These dogs were used for both companionship and food and were introduced alongside poultry and pigs to various islands. They became extinct as a result of the crossbreeding that occurred after European breeds of dogs were introduced. Modern studies done on the DNA of the Polynesian dogs indicate that they descended from the domesticated dogs of Southeast Asia and may have shared a remote ancestor with the dingo.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Rache",
  "title": "Rache - Wikipedia",
  "paragraph": "Rache /ˈrætʃ/, also spelled racch, rach, and ratch, from Old English ræcc, linked to Old Norse rakkí, is an obsolete name for a type of hunting dog used in Great Britain in the Middle Ages. It was a scenthound used in a pack to run down and kill game, or bring it to bay. The word appears before the Norman Conquest.[1] It was sometimes confused with 'brache', (also 'bratchet') which is a French derived word for a female scenthound.[citation needed]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Rastreador_Brasileiro",
  "title": "Rastreador Brasileiro - Wikipedia",
  "paragraph": "The Rastreador Brasileiro (in English, Brazilian Tracker) is a large breed of dog from Brazil, first recognised by the Fédération Cynologique Internationale in 1967, but an outbreak of disease, compounded by an overdose of insecticide, wiped out the breed's entire breeding stock.  The FCI and the Brazilian Kennel Club (Confederação Brasileira de Cinofilia) then declared the breed extinct in 1973 and delisted it.[1] Since then, efforts have been made to re-create the breed. The Rastreador Brasileiro is a hunting dog of the scenthound type. The breed is also known by the names Urrador (for its hunting cry) or Urrador Americano, in reference to the American (U.S.) coonhounds in its background.[1] In 2013, the Brazilian Kennel Club (CBKC) officially re-recognized the breed.[2] The FCI Breed Standard was produced in 2019.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/St._John%27s_water_dog",
  "title": "St. John's water dog - Wikipedia",
  "paragraph": "The St. John's water dog, also known as the St. John's dog or the lesser Newfoundland,  is an extinct landrace of domestic dog from Newfoundland. Little is known of the types that went into its genetic makeup, although it was probably a random-bred mix of old English, Irish and Portuguese working dogs.[2] They were favourite dogs of fishermen because they had extraordinary qualities like good temperament and working behaviour. The number of St. John's water dogs started declining by the beginning of the 20th century. By the early 1980s, the landrace was extinct.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Sakhalin_Husky",
  "title": "Sakhalin Husky - Wikipedia",
  "paragraph": "The Sakhalin Husky (Japanese: 樺太犬, Russian:  Сахалинский хаски) is an extinct[1] sled laika bred by the Nivkh people of Sakhalin Island and adjacent areas.[2][3] The breed is also known as Karafuto Ken, Sakhalin Laika, or Gilyak Laika. While bred primarily as a sled dog, some Sakhalin Huskies were used for hunting bear.[2] As of 2015, there were only seven known dogs of this breed on their native island of Sakhalin.[4]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Salish_Wool_Dog",
  "title": "Salish Wool Dog - Wikipedia",
  "paragraph": "The Salish Wool Dog or Comox dog is an extinct breed of white, long-haired, Spitz-type dog that was developed and bred by the Coast Salish peoples of what is now Washington state and British Columbia.[1] The small, long-haired wool dog and the coyote-like village dogs were deliberately maintained as separate populations. The dogs were kept in packs of about 12 to 20 animals, and fed primarily raw and cooked salmon. To keep the breed true to type and the preferred white color, Salish Wool Dogs were confined on islands and in gated caves.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Sleuth_hound",
  "title": "Sleuth hound - Wikipedia",
  "paragraph": "The sleuth hound (/ˈsluːθhaʊnd/, from Old Norse slóð \"track, trail\" + hound)[1] was a breed of dog. Broadly, it was a Scottish term for what in England was called the Bloodhound, although it seems that there were slight differences between them. It was also referred to as a 'slough dog', (or 'slewe dogge'), and a 'slow hound', the first word probably representing a mispronunciation of 'slough' rather than a reference to the speed of the hound.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Southern_Hound",
  "title": "Southern Hound - Wikipedia",
  "paragraph": "The Southern Hound was a breed of dog that existed in Britain probably until sometime in the 19th century, now extinct. The exact date of its extinction is not known; it is likely that it was gradually interbred with other breeds until the genuine Southern Hound bloodline ceased to exist.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Staghound",
  "title": "Staghound - Wikipedia",
  "paragraph": "The Staghound, sometimes referred to as the English Staghound, is an extinct breed of scent hound from England. A pack hound, the breed was used to hunt red deer and became extinct in the 19th century when the last pack was sold.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tahitian_Dog",
  "title": "Tahitian Dog - Wikipedia",
  "paragraph": "The Tahitian Dog (Tahitian: ʻŪrī Mā’ohi, literally translated as 'native dog'[B]) is an extinct breed of dog from Tahiti and the Society Islands. Similar to other strains of Polynesian dogs, it was introduced to the Society Islands and Tahiti by the ancestors of the Tahitian (Mā’ohi) people during their migrations to Polynesia. They were an essential part of traditional Tahitian society; their meat was included in Tahitian cuisine and other parts of the dog were used to make tools and ornamental clothing. Dogs were fed a vegetarian diet and served during feasts as a delicacy. European explorers were the first outsiders to observe and record their existence, and they were served to early explorers including Captain James Cook. The Tahitian Dog disappeared as a distinct breed after the introduction of foreign European dogs.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tahltan_Bear_Dog",
  "title": "Tahltan Bear Dog - Wikipedia",
  "paragraph": "The Tahltan Bear Dog was a breed of dog that came to Canada in early migrations and acclimatised to the environment.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Talbot_(dog)",
  "title": "Talbot (dog) - Wikipedia",
  "paragraph": "The Talbot was a  type of hunting hound common in England during the Middle Ages. It is depicted in art of the period as small to medium-sized, white in colour, with short legs, large powerful feet, a deep chest with a slender waist, long drooping ears, and a very long curled tail. It is shown in one well-known example at Haddon Hall with a fierce facial expression. It is now extinct, but is believed to be an ancestor of the modern Beagle[1] and Bloodhound.[2] It is uncertain whether it was a scenthound (bred for the quality of its nose), a sighthound (bred for the quality of sight and speed), or a dog used for digging out quarry, nor is it known what type of quarry it hunted, whether deer, fox, boar, etc.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Techichi",
  "title": "Techichi - Wikipedia",
  "paragraph": "The Techichi is an extinct breed of small, mute dog bred by the Toltec culture as long ago as the 9th century C.E. It is thought to be an ancestor of the modern Chihuahua.[1][2][3][4][5]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tesem",
  "title": "Tesem - Wikipedia",
  "paragraph": "Tesem (Ancient Egyptian: ṯzm, tjezem; ) was the ancient Egyptian name for \"hunting dog\". In popular literature it denotes the prick-eared, leggy dog with a curled tail from the early Egyptian age, but it was also used with reference to the lop-eared \"Saluki/Sloughi\" type.[1] It was one of several types of dogs in Ancient Egypt; particularly the latter Saluki/Sloughi type of Tesem, having the appearance most similar to that of a true sighthound.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Toy_Bulldog",
  "title": "Toy Bulldog - Wikipedia",
  "paragraph": "The toy bulldog is an extinct unrecognized breed of small bulldog that existed in England during the 18th and early 19th centuries.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Toy_Trawler_Spaniel",
  "title": "Toy Trawler Spaniel - Wikipedia",
  "paragraph": "The Toy Trawler Spaniel is an extinct breed of Spaniel which physically was similar to the King Charles Spaniel of the 16th century. It is considered to have descended from the original King Charles Spaniel, and the older variety of the Sussex Spaniel. It was employed as a sports dog first before becoming a toy and show dog. It was considered to be on the verge of extinction by 1920. A preserved specimen is kept in Tring at the Natural History Museum.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Turnspit_dog",
  "title": "Turnspit dog - Wikipedia",
  "paragraph": "The turnspit dog is an extinct short-legged, long-bodied dog bred to run on a wheel, called a turnspit or dog wheel, to turn meat. It is mentioned in Of English Dogs in 1576 under the name \"Turnespete\".[1] William Bingley's Memoirs of British Quadrupeds (1809) also talks of a dog employed to help chefs and cooks. It is also known as the Kitchen Dog, the Cooking Dog, the Underdog and the Vernepator. In Linnaeus's 18th-century classification of dogs it is listed as Canis vertigus (also used as Latin name for the Dachshund). The breed was lost, since it was considered to be such a lowly and common dog that no record was effectively kept of it. Some sources consider the Turnspit dog a kind of Glen of Imaal Terrier,[2] while others make it a relative of the Welsh Corgi.[3]\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Tweed_Water_Spaniel",
  "title": "Tweed Water Spaniel - Wikipedia",
  "paragraph": "The Tweed Water Spaniel, or Tweed Spaniel, is a breed of dog extinct since the 19th century. It is best known for being involved in the early development of the modern Curly Coated Retriever and Golden Retriever breeds of dogs. They were described as generally brown, athletic dogs from the area around Berwick-upon-Tweed near the River Tweed and close to the Scottish Borders. A type of water dog, the breed was not well known outside the local area. This breed may have been created by crossing local water dogs with imported St. John's water dog, another breed which is also now extinct.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Welsh_Hillman",
  "title": "Welsh Hillman - Wikipedia",
  "paragraph": "The Welsh Hillman[1] was an ancient landrace or type of herding dog in Wales, used for herding and droving. The variety is thought to have become extinct around 1990.\n"
 }
]