[
 {
  "url": "https://en.wikipedia.org/wiki/Hoplocetus",
  "title": "Hoplocetus - Wikipedia",
  "paragraph": "\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Hollnseth",
  "title": "Hollnseth - Wikipedia",
  "paragraph": "Hollnseth is a municipality in the district of Cuxhaven, in Lower Saxony, Germany.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/The_Heart_of_the_Warrior",
  "title": "The Heart of the Warrior - Wikipedia",
  "paragraph": "The Heart of the Warrior is a Star Trek: Deep Space Nine novel written by John Gregory Betancourt.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Palh_railway_station",
  "title": "Palh railway station - Wikipedia",
  "paragraph": "Palh Railway Station (Urdu: پلہ ریلوے اسٹیشن, Sindhi: پلھ ريلوي اسٽيشن) is located in Sindh, Pakistan.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Douglas_Whynott",
  "title": "Douglas Whynott - Wikipedia",
  "paragraph": "\nDouglas Whynott is an American writer who has written five critically acclaimed books of narrative nonfiction. The subjects of his books range from migratory commercial beekeepers and the beekeeping industry, to the bluefin tuna fishery in New England, a boatyard in Maine, a veterinary clinic in New Hampshire, and the maple syrup industry.  In his early years Whynott worked as a dolphin trainer, fish curator, piano tuner, apiary inspector, track coach, and blues piano player.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Basic_Education_High_School_No._1_Kyaukse",
  "title": "Basic Education High School No. 1 Kyaukse - Wikipedia",
  "paragraph": "Basic Education High School No. 1 Kyaukse (Burmese: အခြေခံ ပညာ အထက်တန်း ကျောင်း အမှတ် (၁) ကျောက်ဆည်; abbreviated to အ.ထ.က. (၁) ကျောက်ဆည်) is a public high school located in Kyaukse, Mandalay Region, Myanmar. The school offers classes from kindergarten to Tenth Standard.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/John_P._Marquand",
  "title": "John P. Marquand - Wikipedia",
  "paragraph": "John Phillips Marquand (November 10, 1893 – July 16, 1960) was an American writer. Originally best known for his Mr. Moto spy stories, he achieved popular success and critical respect for his satirical novels, winning a Pulitzer Prize for The Late George Apley in 1938.[1] One of his abiding themes was the confining nature of life in America's upper class and among those who aspired to join it. Marquand treated those whose lives were bound by these unwritten codes with a characteristic mix of respect and satire.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Corrado_Casalini",
  "title": "Corrado Casalini - Wikipedia",
  "paragraph": "Ivo Corrado Casalini (born November 2, 1914 in Bologna) was an Italian professional football player.\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Grange_Thistle_FC",
  "title": "Grange Thistle FC - Wikipedia",
  "paragraph": "\n\n"
 },
 {
  "url": "https://en.wikipedia.org/wiki/Sterling_Jarvis",
  "title": "Sterling Jarvis - Wikipedia",
  "paragraph": "Sterling Jarvis is a Canadian actor and singer.[2] Originally from Nova Scotia, he currently lives in Toronto, Ontario.\n"
 }
]